{
    "postText": "Hi. I'm a new mom, had my son 5 weeks ago. my husband's parents have been staying with us and things have been super overwhelming.\n\nMIL has a habit of taking the baby and refusing to give him back to me. She'd say I'm deliberately ruining her time with him. My son needs feeding every 2hrs and she basically makes me beg her to hand him over to me so I could feed.\n\nlast night at 10PM. MIL had my son in her arms while sitting on the couch with my husband and his dad. I was exhausted, the baby started crying. I told my MIL to hand him over to me so I could feed him. She refused and I kept asking. my husband starts talking about what a whinny little girl I was to complain that our son is receiving love and cuddles and how I'm using feeding as an excuse to keep the baby away from his mom. I ignored him and told his mom to hand over the baby. she refused and said I needed to wait a little longer.\n\nI got angry at this point, My husband said I could take the baby after I ask his mom nicely. This had me seething I meanly told his mom to stop being annoying and overbearing and hand him over to me. She looked at me shocked and hurt. She handed the baby over and ran into the guest room and my husband gave me a look than followed her and stayed inside to comfort her.\n\nHe came into the room while I was feeding my son and started yelling about how disrespectful I was to speak to his mom this way and treat her poorly when all she's doing is showing our son more love than I do. I told him about how she's been taking the baby for hours and preventing me from feeding him properly. he said that 1, our son isn't an object for me to act like I own him and 2, his mom was doing nothing wrong and 3, I should've asked nicely instead of being a bi$ch to his mom and making her cry. I started crying and yelled that I'd go to my mom's place if his parents stay any longer and he yelled back saying \"shut the fuck up, you're only acting up cause you don't want my parents around! fuck's wrong with you?\" then walked out. I felt terrible thinking maybe I was rude to his mom but I also think that I'd hit my limits here.\nAITA for not asking her nicely like my husband wanted?\n\nEdit; some mistakes because my hands are a bit unsteady.\n",
    "postAuthor": "Newmomma353",
    "postTitle": "AITA for not asking my MIL nicely to hand over the baby for feeding?"
}