{
    "postText": "So pretty much the title, I don't think I am the A but I've been getting some flack for it so I really want to clear this up.\n\nSo I started a new job recently I work in small studio, there are several others in the building, think open plan office with sections assigned to each studio. The person I had an altercation with doesn't work for my studio just FYI. \n\nI eat lunch at 1ish and most people eat at 12. I came down ealry to eat at 12, I made coffee and while at the counter noticed my tuppaware in the sink, empty. \n\nImagine my surprise when I turned around and saw a man I didn't know sitting down at the table with my food on his plate. He had just stuck it in the microwave. Acting rashly since I was mad, I sat down next to him and said 'hey that looks good, mind if I try it?' Then before waiting for an answer I yanked the plate away from him and snatched his fork out his hand, he just blinked in shock as did the other people there as I started eating.\n\nHe then, quite loudly, asked what I thought I was doing and I replied 'huh you know this was actually much better when I first cooked it, it probably lost some flavor in the fridge.' he caught on quickly that it was it was my food and went a lil red. I then asked him where he got the gall to steal someone else's lunch and then ask them what they were doing when they took it back.\n\nHe stuttered out some nonsense about not knowing it was mine and I replied well you knew it wasn't yours right? He just mumbled something like an apology and I said that's no problem it was nice he'd warmed it up for me at least, in an admittedly b*tchy tone, and then he just got up and left and the people there just stared in silence. 2 of the silent watchers, maybe his mates idk, told me that I was rude to him and that there had been nicer ways to go about it. I told them to think how they'd feel if someone ate their food before saying they should focus on their lunch and I'll focus on mine.\n\nWell it's been a little awkward at lunch since and I have the impression a few people are talking shite about me at work now, maybe I could've been nicer sure. I still don't think I was wrong but tell me reddit AITA\n\nTldr lunchthief tried to eat my food in front of me I took it back and embarrassed him in front of his colleagues.\n\nEdit: Okay this blew up, just wanted to drop an edit on here to say thank you so much for all the comments, support and awards it's great to know I wasn't completely overreacting. Maybe I shoudl chat tp some people and see if the food thief has struck before will update then if yall are interested. \n\nOtherwise additional info, I saw some comments saying I should go to hr but my studio doesn't have hr and the perp doesn't work for the same place, we do have a defacto office manager but I don't want to take it any further since I'm still new here and on probation/think my reaction might have been enough. \n\nAlso to add a little unnessasary fuel to the fire, the lunch he took was enough for 2 days, I meal prep in bulk, and he plated the lot. Didn't even wash the tuppaware either.\n",
    "postAuthor": "Steelsnapdragon",
    "postTitle": "AITA for embarrassing a lunch thief at work."
}