{
    "postText": "So I recently got together with a guy from my hobby, he asked me out first and I had some doubts that we'd work together as a couple because of the age difference, he's 35 and I'm 22.\n\nSo, in my apartment, since it's an old house that was originally a single family house, there isn't much soundproofing. And the floors creak when people move. \n\nI've gotten used to the sound of the guy upstairs getting up at 4 am since he starts work at 5.\n\nAnd the sound of the girls in the apartments to either side of mine watching telenovelas till midnight, taking work calls all day and having friends over on weekend nights. \n\nI know when I play music or have friends over, some of the sound leaks through the walls. So I'd never get upset about hearing my neighbors because it goes both ways. \n\nSo... When my boyfriend started coming over more often, he had complaints about the neighbors. Which put me in an awkward place, he wanted to go speak to them or have me text them and I said no. \n\nFor example, one of the early times he stayed over we went to bed around 10. He wanted me to ask my neighbor to turn down her TV. I said she didn't have it that loud and she turns it off at midnight anyway. \n\nAt 4 am, he got very irritated with my upstairs neighbor getting up and cooking breakfast. I said that he would be done by 5 because that's when his shift starts. \n\nAt 7 am, he was still trying to sleep in and the neighbor on the other side had some work calls that he said he couldn't sleep through. I offered him earplugs and he said he couldn't sleep with them in either, he wanted me to ask her to quiet down.\n\nHe had similar comments every time he heard someone else in the building just living their life especially if it was when he was in bed. \n\nI got frustrated with my boyfriend and told him \"you know, you can't expect to date a 'hot young' 22 year old and not wanna deal with a 22 year olds living situation! I don't know if you realize but this is a normal apartment for someone my age... Hell, my neighbors are pretty great; nobody's throwing loud parties on work nights, nobody's having screaming fights, nobody's having babies!\" \n\n(The 'hot young' part was in sarcastic air quotes because those were his words not mine)\n\nHe got irritated and asked why I was bringing age into it, and I said it's because he can't both want someone so young and also want someone with house kinda money! And he was being so out of touch with how normal people in their 20s live.\n\nHe got really irritated with me bringing age into it, and even more annoyed when I'd respond to his neighbor complaints in the future with \"ok boomer\" or tell him that if he wanted me to have a \"rich person apartment\" he could pay for it. \n\nAITA for what I said to my boyfriend about my apartment?\n\nEdit - A lot of comments are asking if we could stay at his house\n\nIt's not possible for me to get to his house on my own because I don't have a car and the buses don't go that far into the suburbs. \n\nSo that would mean him driving 30 minutes from his house in the suburbs to pick me up, then an extra 30 to drive me to his house. Then an hour round trip early in the morning to get me home in time for work. \n\nIt's a lot easier for him to visit me in the city.\n\nEdit 2 - a lot of people in the comments are saying Technically 35 is a milennial and not a boomer. I know that.\n\nI am using boomer as A JOKE or a figure of speech to say \"acting out of touch and entitled to tell other people what to do\". It is a common figure of speech to say \"ok boomer\" to someone who is acting entitled regardless of their actual age... It's more of a mindset thing.\n\nEdit 3 - I googled his property records for his house and HE CO OWNS IT WITH A WOMAN WHO SHARES HIS LAST NAME! holy shit... I don't know if she's his wife or ex wife or what but I'm OUT OF HERE. I'm honestly freaking out right now but I just gotta say .. great big thank you to everyone who noticed red flags and made me question that. I've blocked his number, he can have fun figuring out where I went.\n",
    "postAuthor": "cheapapartmenty",
    "postTitle": "AITA for telling my boyfriend that he can't date younger and then get upset about my budget apartment?"
}