{
    "postText": "My F/33 Dad passed away and left me one of his last and favorite ship model, I had it on display in my living room. but for some reason I never actually mentioned it to my boyfriend M/37 of 6 months. Maybe because we don't live together and he don't visit often.\n\nThe other day he and his friends came over to my place to celebrate his birthday. They got drunk and started throwing the sofas pillows at each others. I told them to stop then went into the kitchen to clean up.\n\nI then started hearing loud noise, I walked out the kitchen and saw my model ship in my boyfriend's hands. I rushed to get it but he passed it on to his friend, and then his friend passed it on to the other friend.\n\nI started running around trying to catch it while yelling at them to stop then my boyfriend grabbed it again. I was so angry I told him to hand it over but he said I needed to kiss him first. I yelled at him and he tried to threw it to his friend who tried to catch it but it missee and hit the wall and broke.\n\nI lost it!! kicked all of his friend out then had a fight with him telling him this was a sentimental item from dad and demanded that he pay me $3,500 because this is how much it costs. He left then called in the morning asking if I was serious about wanting him to pay $3,500 and I said I was dead serious. He started making excuses saying he was drunk and also, I never told him about this ship and how important it was for me before both monetarily and sentimentally so that's on me. we had another fight and then I hung up upon telling him I'm expecting the 3,500 and that I wasn't afraid to take the legal route if I have to. He kept texting asking me to let it go and saying it was cruel of me to threaten him with the law. he had his friends apologize thinking this would be it but I insisted that he pay me.\n\nI get that I might've got worked up over an item and treated my boyfriend badly but to me it seemed like recklessness on his part. AITA?\n",
    "postAuthor": "Blue-Ozone-1870",
    "postTitle": "AITA for insisting that my boyfriend pay me for breaking my $3,500 model ship?"
}