{
    "postText": "This might sound bad but I don't know if I was TA here.\n\nI (F30) have been dating my boyfriend Rhett (M31) for 4 months, we live in different town and he's not from here, (he's american living here) he usually visits on the weekends, This time I decided to visit his town and eat out at a diner.\n\nRhett was already there when I arrived to the diner, we talked some, checked the menu, then when it was time to order he pulled a small bell out of his jacket pocket, lifted it up then started shaking it. it produced a loud, annoying sound my ears started hurting. I was so confused I asked what he was doing and he said that he was trying to get one of the waiter staff's attention. I said it was embarrassing and he should stop right then but he kept shaking it. I can not begin to explain the looks we received from everyone.\n\nI demanded him to stop but he said not til someone came and took our order. I threatened to leave the place and cancel dinner if he wouldn't and he kept doing it. Someone came already, but I'd already gotten up, took my purse and started making my way out. He followed me and started arguing about walking out but I told him that I couldn't take being embarrassed by him and he got upset and said that he didn't get why I thought the bell was embarrassing, explained that it was a perfect solution for no longer be forced to wait til someone shows up. I asked if it was acceptable to do this in america and he said \"yes because it's a free country and people there usually don't give a shit\" but I said it's inappropriate and embarrasding here. he said I was being too sensitive and overreacted over nothing. He insisted we go back inside but I refused.\n\nWe ended up leaving, he kept on about how I ruined dinner by cancelling it and offending him by acting like his behavior is shamful. I said I had a right to give an opinion on what he's done even if he thought what he was doing  but he basically told me to get off my high horse and stop calling his \"genius\" idea embarrassing.\n\nHe's been sulking for days now and wanting an apology, Maybe I overreacted. maybe it's nothing where he lives but here it's just unacceptable.\n",
    "postAuthor": "Blain-Ad-5996",
    "postTitle": "AITA for cancelling dinner when my boyfriend brought a bell to the diner to \"grab\" the staff's attention?"
}