{
    "postText": "My husband (m33) & I (f30) are expecting a baby boy, We're barely catching up with preperation and getting everything ready. His mom (kind of a busy body type but can be helpful at times) invited us for dinner and said she has an important request to make.\n\nShe brought her request up at dinner table and blatantly said that she wanted to be in the delivery room with me when I give birth. I was taken back by her request -- I really thought it had something to do with the nursery or diaper brand. I said I was sorry but only my mom and my husband will be there. She made a face, got quiet for a while then brought it up again. just kept pushing saying she is as much of a grandmother as my mom and that she just wanted to be there for support and get the opportunity to see her grandbaby's first moments. my husband sided with her.\n\nI just stared at her and said \"it's alright, you can have the opportunity to be in the delivery room when it's your son who's giving birth\". everyone stopped eating and my mother in law left the table in an instance. My husband had me got up although I wasn't finish with dinner but he said we should leave.\n\nIn the car, he lost it on me asking \"what brain cell\" made me think it was a good idea to tell his mom that. I told him his mom kept pushing after I'd already given her an answer. still he said this was the most fucked up shit he heard me say. I replied that I was just frustrated and didn't mean to hurt her feelings and cause issues. he argued that if I don't want issues then I should stop making shit difficult and just say yes to his mom's request. he then ranted about how it's his son too and then said if his mom isn't allowed in there then he won't be there too. now I don't know if he really meant this or just said it in the hear of the moment but it had me fuming.\n\nHe's been ignoring me when I try to talk to him and act like I'm not in the room. I think I might have gone too far and created tension by responding inappropriately. AITA?\n\nEDIT/ there has been some tension between me, my husband, and his family lately this probably blew up because of built up resentment\n",
    "postAuthor": "ChelseaRoberts345",
    "postTitle": "AITA for what I told my mother In Law when she asked to be in the delivery room?"
}