{
    "postText": "My wife runs a website dedicated for cooking and recipes. She takes pictures of food before we eat wether it's lunch or dinner and post them on her insta account. to be honest, I'm annoyed by having to wait so long for her to \"get the perfeft shot\" of the food after decorating it, adding this fork and removing that salad dish. It just takes so long and I lose my appetite from just waiting til she's done. This has become the norm but yesterday, I decided I was having none of it.\n\nI came to found that she has cooked an entire feast as her \"next cooking project\" and put it on the table. Note that by lokking at the whole table setting, I figured pictures had already been taken, right? but no, she said she was gOiNg to take few pictures and I had to wait. She went upstairs to get her camera that's when I grabbed the spoon and started filling my plate from every dish she's made and \"ruining\" the look as a result. I was hungry and unwilling to wait around for 10+ to eat.\n\nShe came downstairs, saw the \"damage\" and blew up almost crying saying I just ruined her cooking project that she worked hours for as well as putting efforts into. I said I was hungry and couldn't wait but she kept yelling how much of an obnoxious jerk I was for not waiting til dhe took pictures of the dishes she made, Even said that this was an AttEmPt of me to \"Sabotage\" her success. I said \"oh please enough with those conspiracy theories, I'm just hungry and couldn't wait til she got the perfect shot\". We had a big argument and shewent upstairs crying. I finished my food then went out to cool off a bit.\n\nWhen I returned she'd threatened that she'll never have me eat anything she cooks and said she'd rather throw it in the garbage then give it to a ungrateful, obnoxious jerk like me. I said this wasn't cool but she told me to go fuck myself. I said fine then went to spend the night in the guests room. she texted me the word \"jerk\" about 15 times til I turned my phone off.\n\nToday she has gone complete radio silence. AITA?\n",
    "postAuthor": "RoyalBeggers33",
    "postTitle": "AITA for ruining my wife's work and eating the food before she could take pictures of it?"
}