{
    "question": "People who don't sleep naked, why?",
    "questionAuthor": "u/kellogg888",
    "arrayAnswer": [
        {
            "commentText": "Because family members don't know how to fucking knock that's why.\n",
            "commentAuthor": "u/mishi-as-in-m",
            "commentReplies": [
                {
                    "commentText": "Honestly mine don't either. I just let them learn their lesson. Don't knock? You see something that'll scare you for life. Your fault not mine. I have no shame.",
                    "commentAuthor": "u/IFuckedYourDadd",
                    "commentReplies": []
                },
                {
                    "commentText": "Didn't work.  Mine walked on me several times while I was jerking off.They just walk in, say what they were going to say, and then leave, leaving the door open and me with my wilting dick still in my hand.",
                    "commentAuthor": "u/RandeKnight",
                    "commentReplies": []
                },
                {
                    "commentText": "Test out some erection drug, maybe staying hard and confidently whacking it through the conversation like an alpha will really put them in their place... Failing that keep going and follow them out the door. If they're going to leave it open then they're asking for it.",
                    "commentAuthor": "u/meiyer89",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "If I have skin touching skin, it sweats a lot.\n",
            "commentAuthor": "u/svenson_26",
            "commentReplies": [
                {
                    "commentText": "yup. my thighs and nuts sweat if they stay touching for too long.",
                    "commentAuthor": "u/axxonn13",
                    "commentReplies": []
                },
                {
                    "commentText": "Was totally confused for a second and my first thought was “what clothing garment is he using to keep each nut separate”. My bad.",
                    "commentAuthor": "u/twistsouth",
                    "commentReplies": []
                },
                {
                    "commentText": "RAISE AND SEPARATE.",
                    "commentAuthor": "u/Rezzone",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Woman. Blood.\n",
            "commentAuthor": "u/Halalamay",
            "commentReplies": [
                {
                    "commentText": "General discharge too",
                    "commentAuthor": "u/PetiteEbonyDoll",
                    "commentReplies": []
                },
                {
                    "commentText": "what an unfortunate name for a General",
                    "commentAuthor": "u/fat_over_lean",
                    "commentReplies": []
                },
                {
                    "commentText": "it was way worse when he was just a private, and slightly better than when he was a major",
                    "commentAuthor": "u/TopFloorApartment",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "it's cold and washing clothes is easier than washing sheets\n",
            "commentAuthor": "u/i-need-blinker-fluid",
            "commentReplies": [
                {
                    "commentText": "Yes! I am cold. I can’t believe I had to scroll so far to see this.",
                    "commentAuthor": "u/jennyrules",
                    "commentReplies": []
                },
                {
                    "commentText": "Had to wade through so much fucking menstrual blood and precum and shit and piss and sweat and vaginal discharge to get to “cold”.",
                    "commentAuthor": "u/Miserable_Leek6023",
                    "commentReplies": []
                },
                {
                    "commentText": "It took you blood, sweat and tears.",
                    "commentAuthor": "u/FloofyTuffy",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Got kids. Underwear are to protect the world from my ass.\n",
            "commentAuthor": "u/i-love-reddit-so-muc",
            "commentReplies": [
                {
                    "commentText": "I slept naked until I had a kid. She usually sleeps through the night but the last thing I wanna do when I'm awoken by cries at 3 am is start fumbling for pants or whack my titty into a door.Edit: It has nothing to do with her seeing me naked. It's just not as comfortable or practical with the way nighttime wakes go for us. Also there's snow on the ground 4-5 months out of the year so it's just plain cold.",
                    "commentAuthor": "u/Much_Difference",
                    "commentReplies": []
                },
                {
                    "commentText": "r/BrandNewSentence",
                    "commentAuthor": "u/Daroodedoo",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "What if a there’s an earthquake in the middle of night and i have to run.\n",
            "commentAuthor": "u/ICumCoffee",
            "commentReplies": [
                {
                    "commentText": "My uncle used to sleep naked. Until his trailer caught fire in the middle of the night and he had to run butt ass naked to some old woman's house and convince her to open the door or call 911.Didn't help that he's a gun guy, so all his ammo was firing in the background.I was a kid when this happened. The whole idea just makes me nervous.",
                    "commentAuthor": "u/avamarie",
                    "commentReplies": []
                },
                {
                    "commentText": "There are major motion pictures with less going on than this post.",
                    "commentAuthor": "u/LogicBalm",
                    "commentReplies": []
                },
                {
                    "commentText": "If a movie doesn't at least have a naked uncle screaming while a bullet-laced fire is leaping around behind him, I don't want to see it.",
                    "commentAuthor": "u/Maybetaxes",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Any time I do, my kid will need me or a pet is going to get into some chaos until I get out of bed!\n",
            "commentAuthor": "u/ChthonicGarnet",
            "commentReplies": [
                {
                    "commentText": "My four year old daughter came into my room the next morning when I attempted to sleep without a shirt. She shamed me for having “my boobies” out. :(E: Glad to see some people get it and got the laugh, but it’s not that deep guys. She knows about body positivity. She’s also fuckin 4. She spoke on something in her immediate view after waking up.“Why are your boobies out mommy? You need a shirt.” My first thought was, ‘slut shamed by my own daughter’ and I told her I got hot. She also regularly takes her pj bottoms off in the middle of the night because SHE gets it.Sleeping with clothes sucks, yes, but sometimes you gotta do what you gotta do.Stay comfy <3",
                    "commentAuthor": "u/erra_r",
                    "commentReplies": []
                },
                {
                    "commentText": "Imagine being slut shamed by your kid lol.",
                    "commentAuthor": "u/Sawses",
                    "commentReplies": []
                },
                {
                    "commentText": "That was my exact thought lol",
                    "commentAuthor": "u/erra_r",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Because the tip of my dick touching the bedding drives me insane\n",
            "commentAuthor": "u/dingbatyokel5000",
            "commentReplies": [
                {
                    "commentText": "Agreed.  I told my girlfriend it feels like my dick is \"paintbrushing\" the bed.",
                    "commentAuthor": "u/minidude140",
                    "commentReplies": []
                },
                {
                    "commentText": "Wet dreams are happy little accidents",
                    "commentAuthor": "u/-SHORSEY-",
                    "commentReplies": []
                },
                {
                    "commentText": "They're parties you're not invited to but still have to clean up afterwards.",
                    "commentAuthor": "u/Ruffled_Ferret",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It makes me feel too vulnerable. Even though I’m totally safe, I just feel too exposed.\n",
            "commentAuthor": "u/LunaValley",
            "commentReplies": [
                {
                    "commentText": "Right? It's like all these muthafckrs casually sleeping with an hand or foot off the bed.THATS HOW IT GETS YOU!",
                    "commentAuthor": "u/JadeGrapes",
                    "commentReplies": []
                },
                {
                    "commentText": "I put my extremities off the bed to assert dominance",
                    "commentAuthor": "u/nolanhoff",
                    "commentReplies": []
                },
                {
                    "commentText": "Apex predators sleep with their cocks hanging over the side of the bed.",
                    "commentAuthor": "u/Jakenator1296",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I slept naked for a long time and I was always waking up hot or cold. Pajamas fixed the issue. There was also that time a drunk neighbor broke in and took the blankets off me and tried to kiss me.\n\nEdit: here’s how it went down. \n\nWe were friends with the neighbor and would hang out on the back patio smoking. We’d walk to the wing place and eat. He would always go to his place to use the bathroom. One night he used ours and took the opportunity to unlock the front door that nobody used. He asked to borrow my roommates phone and she agreed and just told him to leave it on the porch when he was done. At about 5am I woke up with no covers on and he was whispering in my ear to kiss him just once. I grabbed the renaissance fest battle axe by my bed and swung and he ran. I went out of my room and my roommate heard the noise and she came out to find me naked with an axe. Then she found her phone in her room. We didn’t see him for a week and when he showed up he was arrested for something drug related and he left his dog on our porch. Eventually we found his mom and gave her the dog. And that’s it.\n",
            "commentAuthor": "u/Antigravity1231",
            "commentReplies": [
                {
                    "commentText": "The nudity, the AXE, the dog! There’s simply too\nMuch to process here.",
                    "commentAuthor": "u/treatcounsel",
                    "commentReplies": []
                },
                {
                    "commentText": "I'm flabbergasted that the naked Kratos cosplay angle wasn't included the first time",
                    "commentAuthor": "u/mcsonboy",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I live in a block of about 100 people each with different sleep patterns. If someone burns toast at 02:00 i want to be prepared for when that fire alarm goes off\n",
            "commentAuthor": "u/zygomelonm",
            "commentReplies": [
                {
                    "commentText": "If you slept naked you'd just make the emergency sexy.Edit - Thank you strangers for the awards!  I feel validated!  And Sexy!",
                    "commentAuthor": "u/Namoric",
                    "commentReplies": []
                },
                {
                    "commentText": "Imagine burning your house AND seeing your neighbor with the dad bod's sack on the same day.",
                    "commentAuthor": "u/birblover69420",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I don't want my dog to be nosing at my cooter or my tooter.\n",
            "commentAuthor": "u/kingswing77",
            "commentReplies": [
                {
                    "commentText": "Used to sleep naked until my cat chomped on a ball.  Very rude awakening. No damage but now boxer briefs keep the dangly bits from dangling in my sleep.",
                    "commentAuthor": "u/Wezbob",
                    "commentReplies": []
                },
                {
                    "commentText": "My cat bit my nipple ring straight outta my nipple. I wasn’t sleeping naked, in a tank top, but I twisted out of my shirt and he saw shiny. What a fun way to wake up. Haha. We lost him to osteosarcoma in 2018, almost a decade after the nip nop incident and I’d let him rip my other nipple in half if it meant he didn’t get cancer.",
                    "commentAuthor": "u/mrsfinchthesparrow",
                    "commentReplies": []
                },
                {
                    "commentText": "So sorry to hear that.  The ol' ball biter has outlived his brother who died young (fuggin' cat kidneys) but capt. cantankerous over here is almost 12 and still chases the chihuahuas around the house like he was still a kitten.",
                    "commentAuthor": "u/Wezbob",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Tbh when I lay on my side and curl my arms sorta against my stomach to sleep, if I’m naked I am basically falling asleep directly grabbing fat rolls on my stomach. \n\nIf I wear a big soft T-shirt the fat rolls are tucked away better out of sight and I can sleep in denial that they exist.\n",
            "commentAuthor": "u/amelia_health",
            "commentReplies": [
                {
                    "commentText": "I just hate my boobs sticking together so I tuck the shirt between them",
                    "commentAuthor": "u/astrobre",
                    "commentReplies": []
                },
                {
                    "commentText": "Same. But with my balls. And my inner thigh. And my boxers.",
                    "commentAuthor": "u/JuckChones",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I'm prone to sudden bouts of diarrhea.\n\nEdit: This is now my top comment, and I couldn't be more ashamed.\n",
            "commentAuthor": "u/Ozyman_Dias",
            "commentReplies": [
                {
                    "commentText": "That’s shitty",
                    "commentAuthor": "u/SkipperTex",
                    "commentReplies": []
                },
                {
                    "commentText": "Out.",
                    "commentAuthor": "u/Anudist",
                    "commentReplies": []
                },
                {
                    "commentText": "Well, yeah. Diarrhea definitely doesn’t go in.",
                    "commentAuthor": "u/motolabjed",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "\nPeriod blood is easier to wash out of pyjamas than sheets.\nMine is a cold and bleak country.\nWearing pyjamas at night make waking up to a lazy day in pyjamas infinitely more likely.\n\n",
            "commentAuthor": "u/RMDrunkenRat",
            "commentReplies": [
                {
                    "commentText": "I’d rather wake up in the middle of the night to ruined underwear than ruined sheets. At least with the first you can clean up quickly then go back to bed",
                    "commentAuthor": "u/zygomelonm",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Because not all of us have our own room\n",
            "commentAuthor": "u/find-me-in-bub",
            "commentReplies": [
                {
                    "commentText": "OP forgot that 50% of Reddit is children.",
                    "commentAuthor": "u/bugalaman",
                    "commentReplies": []
                },
                {
                    "commentText": "And a certain percentage is women too. Who the fuck wants to sleep naked and get discharge all over their sheets?",
                    "commentAuthor": "u/Basic_Bichette",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It’s just too cold to sleep naked most nights. If I’m in a humid place without a fan or AC, then I don’t want to be sticky all over my bed and then have to change the sheets more often.\n",
            "commentAuthor": "u/buhbuhnuhnuh",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My boobs like to be cosy at night, and I like wearing silky jammies so that I can wriggle around and create tiny electric sparks in the sheets.\n\nPlus is makes me feel like a lady of luxury.\n",
            "commentAuthor": "u/crospingtonfrotz",
            "commentReplies": [
                {
                    "commentText": "But what do you do with all that static and your hair?! Static hair is one of the worst feelings for me",
                    "commentAuthor": "u/whotookmyshit",
                    "commentReplies": []
                },
                {
                    "commentText": "Oh! I have silk pillowcases and somehow my hair never ends up staticky when I sleep on them. Granted it’s wavy white girl hair so I don’t know how universal this experience is, but works well for me!",
                    "commentAuthor": "u/crospingtonfrotz",
                    "commentReplies": []
                },
                {
                    "commentText": "My daughter has super curly white girl hair and I don’t, so I had to look up how to care for her hair. One of the recommendations is to change to satin pillow cases.",
                    "commentAuthor": "u/SollSister",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It doesn't feel right to sleep naked, it makes me uncomfortable. I've always slept with clothes on\n",
            "commentAuthor": "u/PeterTheFoxx",
            "commentReplies": [
                {
                    "commentText": "This gets my answer, there has to be something. It can just be a t-shirt, but still I'd need that. Also it's cold naked.",
                    "commentAuthor": "u/dppflyingtime",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Agree. I’m not necessarily uncomfortable naked, but I’m more cozy/comfortable in really soft clothes like sweats or pjs. Anytime I’ve slept naked I just didn’t prefer it.",
                    "commentAuthor": "u/Nyetnyetnanette8",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I dont wanna twist my balls around in my sleep. Boxers kinda keep that area nice and packed away.\n",
            "commentAuthor": "u/big-mod-salary",
            "commentReplies": [
                {
                    "commentText": "Yes. I like things packed in.",
                    "commentAuthor": "u/Anonymousma",
                    "commentReplies": []
                },
                {
                    "commentText": "That's my reason, too.  I've tried it, and it always just feels like things are flopping every direction every time I turn.  I gotta be careful switching positions. But wearing some clothes, I just feel comfier, packed in.  For me, it's like the difference between sleeping with a blanket and sleeping without.  Sure, I could do it, but being wrapped up just feels more comfortable and cozy.",
                    "commentAuthor": "u/Secret_Map",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Because if there was a fire I wouldn’t want to run outside naked. Or if there was an intruder, I wouldn’t want them to see me naked either.\n",
            "commentAuthor": "u/Dino-Nuggies4457",
            "commentReplies": [
                {
                    "commentText": "If an intruder came in and saw me completely naked, I feel like they would potentially be distracted for a second and my chances of escape would be greater… thoughts?",
                    "commentAuthor": "u/tpdovu",
                    "commentReplies": []
                },
                {
                    "commentText": "But what if the intruder is naked too?",
                    "commentAuthor": "u/Philipp",
                    "commentReplies": []
                },
                {
                    "commentText": "I’d think we would both be stunned that the other is naked. This would result in us standing there for a second, examining each other’s naked bodies before we proceed with subsequent events.",
                    "commentAuthor": "u/tpdovu",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My nightwear gets washed more often than the sheets, if I sleep nekkid I have to wash the sheets more often.  Also my pajamas are softer and more comfortable against my skin than the sheets.  Maybe you can afford silk sheets OP, but I can't.\n",
            "commentAuthor": "u/LucyVialli",
            "commentReplies": [
                {
                    "commentText": "[removed]",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "completed that chapter of pop.​thanks",
                    "commentAuthor": "u/VirtualKoba",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I don’t want a ghost in the butt\n",
            "commentAuthor": "u/_BluLeaf",
            "commentReplies": [
                {
                    "commentText": "I ...Ok.",
                    "commentAuthor": "u/dougaderly",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "That makes 1 of us..",
                    "commentAuthor": "u/5thcirclesauces",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Because the vagina is an amazing self cleaning engine, and when she changes her own oil, my sheets don't want to cosplay a garage floor.\n",
            "commentAuthor": "u/zingingcutie333",
            "commentReplies": [
                {
                    "commentText": "The Cars spin offs just keep getting weirder",
                    "commentAuthor": "u/-SHORSEY-",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "People who sleep naked, why?\n\nedit: why y'all giving me awards? This post doesn't deserve shit\n\nedit 2: and the damn upvotes! my god, stop!\n\nedit 3:BRRRRRUUUUUUUUUUUUHHHHHHHHHHHHHH\n\nedit 4: ok I'll stop editing this\n",
            "commentAuthor": "u/Tastystab540",
            "commentReplies": [
                {
                    "commentText": "(Edit: apparently this post is a reversal of a previous post. I did not know that. That puts everything in an entirely different context. Personally, I still feel more comfortable in pajamas. Seems like a real personal taste situation on the comfort front.)How is this not the top reply, full of rewards and all? Why is OP assuming naked is default? I don’t get it. My siblings and I grew up with pajamas, same with my wife and hers, no reason to change, that’s what I had always done, for awhile when single I had several roommates and they all wore pajamas…might be anecdotal but I feel like pajamas are the standard, not naked. Who tf sleeps LITERALLY naked? And like, year round? Even when it’s cold? What?",
                    "commentAuthor": "u/xSmittyxCorex",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I don't find it physically comfortable to be naked unless I'm showering or sexing.\n",
            "commentAuthor": "u/iamnomansland",
            "commentReplies": [
                {
                    "commentText": "Agreed. I don't even understand when people say they walk around at home in just their underwear. Minimum I need shorts and a t shirt.",
                    "commentAuthor": "u/Dulakk",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}