{
    "question": "Dear Americans of Reddit, how do you find this first year of Biden's presidency compared to Trump's?",
    "questionAuthor": "u/HannibalGoddamnit",
    "arrayAnswer": [
        {
            "commentText": "During the first year of Trump’s administration the majority of news headlines were about Trump. \n\nDuring the first year of Biden’s administration the majority of news headlines were about Trump\n",
            "commentAuthor": "u/st11es",
            "commentReplies": [
                {
                    "commentText": "It’s actually kind of scary because Biden has done some things that need to be brought up but it’s like a radio silence around him. Unless it’s about his pets.",
                    "commentAuthor": "u/Legeto",
                    "commentReplies": []
                },
                {
                    "commentText": "What kind of things? I want to be informed and read up on things so I'm not asking this in an attacking way I'm actually curious what the president of my country is doing.",
                    "commentAuthor": "u/jaywan1991",
                    "commentReplies": []
                },
                {
                    "commentText": "You sure REDDIT is the place to get ubiased answers for that?",
                    "commentAuthor": "u/OkArrival4281",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Well it's certainly been quieter\n",
            "commentAuthor": "u/GuyInGrouchoGlasses",
            "commentReplies": [
                {
                    "commentText": "Whatever your opinion of Trump, I feel like if he would have just STFU most people would have been a lot less stressed out.  He was certainly his own worst enemy at times.",
                    "commentAuthor": "u/LlamaWithAnAttitude",
                    "commentReplies": []
                },
                {
                    "commentText": "Staying in the news cycle was an intentional move.How do you get people to ignore fucked up shit?By doing it SO MUCH that you burn everyone out and lower the bar for what constitutes as “fucked up”.How are we supposed to be angry about Trump being racist when it’s not even the worst thing he’s done that day and it’s barely fucking lunchtime?Edit: You Trump supporters had YEARS to come up with better bait. \nYour shit is weaker than my gramps with Crohn’s disease.",
                    "commentAuthor": "u/Chris4477",
                    "commentReplies": []
                },
                {
                    "commentText": "I’m Canadian and I was so sick of hearing about trump, and we only heard the “big deal things” which seemed to happen three times a week. I blocked his name from my google search results at one point. Can’t even imagine how you guys felt!Edit: Here’s google chromes trump filter, keep in mind the default setting is mild so change to your liking!Edit2: u/TwistMeTwice brought up another option, detrumpify if you want the news replaced with funny things and kitten pictures",
                    "commentAuthor": "u/makpat",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "ITT: people not actually aware of what the president does\n",
            "commentAuthor": "u/pendrekky",
            "commentReplies": [
                {
                    "commentText": "A guy said it's quieter. I think it's pretty presidential to not suck your own dick 24/7Edit: guys I'm not changing my mind. I'm left and socialist first and my opinion is my opinion. I'd love to debate with all of you but there's too many comments. Just know I see capitalism and right wings as the enemy to my country and that won't changeEdit #2: I don't care of you guys send me death threats. I will continue to not take that seriously",
                    "commentAuthor": "u/Virtual-Okra6996",
                    "commentReplies": []
                },
                {
                    "commentText": "I agree although it’s a low bar",
                    "commentAuthor": "u/blondechinesehair",
                    "commentReplies": []
                },
                {
                    "commentText": "We weren't offered much better choices",
                    "commentAuthor": "u/Virtual-Okra6996",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "At least 90% of people couldn't even tell you 5 things that the president has done since taking office, let alone give a good opinion on a president's performance. For some reason everyone cares a lot about the election process, and then completely ignores what the elected president does beyond that point.\n",
            "commentAuthor": "u/HellzBlazez",
            "commentReplies": [
                {
                    "commentText": "To be fair, that’s partly the point of a republic: vote some people in to deal with these problems since we don’t have the time and most aren’t qualified/educated enough on every world problem. Still, people should actually learn what a president does and pay attention to what they do, not just what happens to occur while they are president; although, it’s probably more important to focus on congress members that represent you.",
                    "commentAuthor": "u/selfproclaimedthot",
                    "commentReplies": []
                },
                {
                    "commentText": "It's also more or less out of our hands at this point. At the end of four years we get the TL;DR version and decide if it's time for them to step down or not.",
                    "commentAuthor": "u/oWatchdog",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Being terrified in slow motion instead of being terrified on fast forward.\n",
            "commentAuthor": "u/frown-umbrella",
            "commentReplies": [
                {
                    "commentText": "This is the best description I've found so far in the thread.",
                    "commentAuthor": "u/wynden",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah, it’s still bad but I definitely feel less worn out.",
                    "commentAuthor": "u/Picnicfixins",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Tbh most Americans stopped paying attention the second Trump was out of office. You'll have a hard time finding a crowd sourced educated opinion, especially on Reddit.\n",
            "commentAuthor": "u/-banned-",
            "commentReplies": [
                {
                    "commentText": "This! The media loved reporting on Trump so that’s all we heard. Now it’s been…quiet.",
                    "commentAuthor": "u/infinitejess8",
                    "commentReplies": []
                },
                {
                    "commentText": "They still fucking talk about Trump…it’s so annoying.ETA: I get it that investigations are producing newsworthy items.  I guess I’m just not surprised…”how far Trump went to overturn the election…”. Not shocked. I don’t care about his statements.  I’m not shocked he wants to give pardons to January 6 rioters.",
                    "commentAuthor": "u/spoda1975",
                    "commentReplies": []
                },
                {
                    "commentText": "I honestly just wish they'd stop talking about him. Continuing to be in the public eye is exactly what he wants. Stop talking about him, and he becomes irrelevant",
                    "commentAuthor": "u/holycowrap",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I saw a political bumper sticker today that said  2020: Any sane person\n\nThats pretty much how I feel\n",
            "commentAuthor": "u/9erInLKN",
            "commentReplies": [
                {
                    "commentText": "[removed]",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "[removed]",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "[removed]",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "If I am being honest, I don't have enough education in political science to have an actual opinion in politics. I do however feel like that is also the case for 90% of the American populace\n\nEdit: two words motherfucker. I am not perfect.\nEdit #2: this is kinda my point. I am.just a regular old blue collar worker getting black out drunk on steel reserves tonight and one comment about politics and my aversion to them ruffled so many feathers. They want us to hate each other. They want a divide. We'll never agree on the fundamental things that keep as down as a nation. And the one thing that keeps us down as a nation is to forget that we are a together. We are the people. They are the government.\n",
            "commentAuthor": "u/vanillaISISISISbaby",
            "commentReplies": [
                {
                    "commentText": "As a random American with a political science degree, i would say it is not relevant to forming a political opinion. Your stance on science, guns, social services, access to abortion, climate, taxes, military etc. don't require any academic justification and it's pretty clear where each of the main two parties stand on each of these. It's common for people to say the two political parties are the same, but this is less the case every year, that is what polarization is.",
                    "commentAuthor": "u/red204",
                    "commentReplies": []
                },
                {
                    "commentText": "Without any knowledge behind, these opinions might be easy manipulate and changed by f e emotional social media and psychological tricks.",
                    "commentAuthor": "u/AgapeMagdalena",
                    "commentReplies": []
                },
                {
                    "commentText": "Now THAT is a large segment of what political science is. Politics, I'd argue, is just about what you think people deserve and how society should work, regardless of what led or influenced you to those opinions.",
                    "commentAuthor": "u/red204",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The only defining thing about Biden administration is that \"He is not Trump\". And that is a sad legacy to leave behind.\n",
            "commentAuthor": "u/professorjerkolino",
            "commentReplies": [
                {
                    "commentText": "Isn't that why people voted for him?",
                    "commentAuthor": "u/MartyWhelan",
                    "commentReplies": []
                },
                {
                    "commentText": "Yes it is. That was the only reason",
                    "commentAuthor": "u/GoldCherries",
                    "commentReplies": []
                },
                {
                    "commentText": "Literally... the only reason.",
                    "commentAuthor": "u/ChessBorg",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It’s too bad that there are thousands of people better qualified to be president, but it’s always the out of touch career politicians that we get for choices. Politics are a pseudoscience\n\nEdit: I’m not implying that Biden is unqualified or ineffective, but that there may be someone out there that is simply better. I’m aware that Trump was not a career politician, I just want to see a change from the old, rich guy template.\n",
            "commentAuthor": "u/phat5pliff",
            "commentReplies": [
                {
                    "commentText": "The best person qualified to be president, doesn't want to be president.",
                    "commentAuthor": "u/trunts",
                    "commentReplies": []
                },
                {
                    "commentText": "It really is a job that nobody in their right mind would want.  As such, we get a lot of presidents who aren't in their right mind.",
                    "commentAuthor": "u/digitaljestin",
                    "commentReplies": []
                },
                {
                    "commentText": "oh Id do it, but theyd impeach my ass within 6 months. Start cutting back on the corruption & the whole system will turn on you",
                    "commentAuthor": "u/CarpAndTunnel",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Well, there is pretty much one thing that's continuing to make me mad. It's that Biden lowered the threshold from $20,000 to $600 to get a 1099-K form.\n\nInstead of taxing the rich, they want to go after the gig economy (like door dash, or Uber) or small time eBay sellers to nickel and dime them to death. Most people using these platforms are doing so as a side gig to make enough money to support their families. So let's go after those people and not the billionaires, right Biden?\n",
            "commentAuthor": "u/ColtsFanNY",
            "commentReplies": [
                {
                    "commentText": "Guess it's good for my local card shop. Before the change I could sell for 80-90% of market value through various platforms. After fees I'd come out ahead of my local stores trade in value. Now, taxes plus fees means I barely make more, and dealing with shipping and customer problems just isn't worth the hassle. Now I just trade in for straight cash.",
                    "commentAuthor": "u/Weasel_Boy",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Coincide with this I also don’t like how they are beginning to track the money being sent through cash app and taxing it as well. Feels like they’re just trying to grind down any small business",
                    "commentAuthor": "u/rosiegirl8903",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Biden is the quiet dissapointment I expected him to be; a placeholder president\n",
            "commentAuthor": "u/CarpAndTunnel",
            "commentReplies": [
                {
                    "commentText": "A placeholder for the next disappointment",
                    "commentAuthor": "u/gingerflakes",
                    "commentReplies": []
                },
                {
                    "commentText": "This the maddening irony of that compromise, that disappointment gets a republican elected next election.",
                    "commentAuthor": "u/updateSeason",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Refreshing, but unsatisfying.\n",
            "commentAuthor": "u/C1ashRkr",
            "commentReplies": [
                {
                    "commentText": "Title of your sex tape?",
                    "commentAuthor": "u/kris_deep",
                    "commentReplies": []
                },
                {
                    "commentText": "Ouch",
                    "commentAuthor": "u/SurelyNotAnOctopus",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Someone asked about Biden, entire thread is still about trump 😂\n",
            "commentAuthor": "u/KnightFire17",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Two things. Way calmer. Also, this country is still fucked. It goes way deeper than the white horse\n\nEdit: You guys are great.\n\nEdit2: Some of you get triggered very easily.\n",
            "commentAuthor": "u/Recent_Assumption_63",
            "commentReplies": [
                {
                    "commentText": "You leave shadowfax out of this",
                    "commentAuthor": "u/a_0692",
                    "commentReplies": []
                },
                {
                    "commentText": "Show us the meaning of haste!",
                    "commentAuthor": "u/A_BURLAP_THONG",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The way I see it is that each president has the opportunity to come into your house and make some home improvements during their tenure. Generally, some large projects like replacing your roof or major remodel don’t happen all too frequently because they’re expensive and you have to prioritize other repairs first.\n\nIn my mind, Trump took a shit bazooka and started blowing out all the doors, walls and windows with it. Biden came in and couldn’t get to any of the plans he had for the house because he’s still cleaning shit off the walls and making it a livable space again.\n\nDid the overall condition of the house improve? Not really. Is that his fault? Not at all. All his contractors are tools and don’t actually help him, meanwhile the occupants are busy fighting with each other and there’s always that one guy in the background yelling world star.\n\nI don’t expect Biden to have a stellar presidency. The circumstances preceding him just won’t allow for it. His job is to rehabilitate the house he inherited, and it’s going to be someone else’s to actually make the needed improvements.\n",
            "commentAuthor": "u/Ladle-to-the-Gravy",
            "commentReplies": [
                {
                    "commentText": "+1 for 2017-2021 the years of the great shit bazooka",
                    "commentAuthor": "u/debbiegrund",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Plus he's fucking really old.​There really needs to be a cap on presidents ages. Like 65 or something.",
                    "commentAuthor": "u/DreamerMMA",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "ESH\n",
            "commentAuthor": "u/Laurechaun",
            "commentReplies": [
                {
                    "commentText": "I can't be the only one, I'll ask...What does this mean please.",
                    "commentAuthor": "u/timeup",
                    "commentReplies": []
                },
                {
                    "commentText": "ESH is an abbreviation used on r/AmITheAsshole. It means “everyone sucks here”.",
                    "commentAuthor": "u/Pepe_Dev",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "He managed to make it a whole year without committing obstruction of justice, so that's a positive.\n",
            "commentAuthor": "u/grombleduke",
            "commentReplies": [
                {
                    "commentText": "The bar is so low.",
                    "commentAuthor": "u/sacrificialfuck",
                    "commentReplies": []
                },
                {
                    "commentText": "Trump set the bar so low mole people were worshipping it.",
                    "commentAuthor": "u/Tobias_Atwood",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Does noone realise there are macro economic trends that are totally out of control of the President? Trump had nothing to do with the stock market increasing just like Biden has nothing to do with the stock market increasing during his term. The increase in the cost of living is happening all over the world (I'm not American btw) so why does anyone think it is because of any policy Biden has enacted?\n\nEdit: for those saying that quantitative easing has contributed to the problem, I wholeheartedly agree. But when every single developed nation has been printing money for the past 30 years it is a systemic issue and one that cannot necessarily be blamed on a single leaders policies.\n",
            "commentAuthor": "u/Hoodoo89",
            "commentReplies": [
                {
                    "commentText": "Ugh, it’s infuriating. Back in 2020 when COVID got serious, my friends and I (mostly mathematicians and economists and a few other types of nerds) took bets on what it would do to inflation and our bets ranged from 6-13%. We knew it was coming because that’s what’s obviously going to happen when a global pandemic disrupts supply chains and governments across the world scramble to keep their economies from collapsing with stimulus and bailouts. And yet I can’t go a week without hearing some moron declare Biden managed to create 7% inflation in just months. The economy doesn’t work that fast and the inflation is a global phenomenon anyway! And if you ask them how he did it… they always think it’s so unfair you expect them to have reasoning behind their beliefs.Hyper-partisanism has made people object to the very notion of logic if it gets in the way of their beliefs. It’s so frustrating to listen to.",
                    "commentAuthor": "u/Brainsonastick",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "I agree with you! People just want a scapegoat to put all their problems on",
                    "commentAuthor": "u/Wit-Hoid6674",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "He expanded Bears Ears National Monument and so that’s a plus.  Besides that, not much to say\n",
            "commentAuthor": "u/jebhebmeb",
            "commentReplies": [
                {
                    "commentText": "He also reinstated a number of environmental protections relating to pfas that Trump had repealed, rejoined the Paris Climate Accord, made the situation at least a little better for children at the border and got rid of the \"remain in Mexico\" policy (but that was later overruled by conservative judges), and passed the infrastructure bill. Biden has done a few good things, they just don't immediately positively affect most people (and most people don't pay attention) so they assume he has done nothing. Don't get me wrong, he obviously should have done far more by now but the \"Biden is the exact same as Trump\" people are almost as dumb as the \"Biden is a socialist\" people.Edit: Holy moly, I keep getting the same 2 or 3 arguments against what I said. Please read the comments below before responding so I don't have keep typing the same thing over and over, hahaha",
                    "commentAuthor": "u/AnonAlcoholic",
                    "commentReplies": []
                },
                {
                    "commentText": "As an environmental analyst, Biden has reduced a lot of my stress. He's far from perfect and has still been doing little to nothing about climate change, but at least he hit the breaks on our slide toward an absurd amount of contamination and pollution hitting our water and air.",
                    "commentAuthor": "u/A-Pedestrian",
                    "commentReplies": []
                },
                {
                    "commentText": "He's placed pressure on us here in Australia about climate.  When trump was in our right wing government didn't give 2 shits about climate change, along with many other counties. Now Biden is in, we have finally agreed to net 0 2050",
                    "commentAuthor": "u/Patzdat",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It would have been easy for almost anyone other than Biden to come in and feel like a cool breeze compared to Trump.\n\nBut Biden is not a cool breeze. \n\nMaybe it's not entirely him, and maybe it's partly the political environment. Maybe the pandemic.\n\nWhen Obama came into office, I felt a seismic shift. A sigh of relief. He was very smart, very competent. It was refreshing when he spoke.\n\nThis has not felt like that, which is very surprising given what happened right before he was inaugurated. The bar was pretty low.\n\nThe government has still been no better with the pandemic response. The best thing we did was get the vaccines out, but that had started under Trump. We beat Europe in that regard, and yet the uptake was slower and less.\n\nThe public policy has been confusing. Huge bills and people aren't exactly sure what's in them, and they didn't pass anyway.\n\nAnd with Ukraine we've reversed the trend of avoiding hawkishness. I cannot claim to be an expert of what's going on, but as a layperson I cannot understand the doctrine of saying Afghanistan is not in our vital national interest but Ukraine is.\n\nBiden sold himself as healing the nation. That has not happened, at all. That's not his fault. But all the same, it's what he was selling.\n\nThe US federal government in general doesn't work that well, so I mean there's that. Nothing much feels that different.\n\nPersonally I care the most about schools and COVID safety since my mom is older and an elementary school teacher, and billions and billion were spent under Biden for ventilation and testing in the schools. And almost none of it went to that, and I don't know where it's all gone. A lot of that is how the government works in general.\n\nThe public has no appetite for what I was hoping to see which was stricter COVID control. Biden could have still fallen on his sword to have better policy because he probably will be a one term president anyway. He allowed the CDC to put out policies that benefited corporations, and a lot of things happened where I think if Trump had still been president there would have been more outrage.\n\nBiden feels like a placeholder for something else. I don't know what that is or what's coming. He and Kamala Harris are not the future of the Democratic party.\n\nThe way social issues are addressed in the US now is problematic and is going to hold Democrats back. They should, in my opinion, be almost singularly focused on economic justice for everyone and stop addressing things group by group. Eventually everyone is going to be a member of an aggrieved group in order to get equity. It's the wrong way to approach it. It's going to put some white voters back in a position to back someone like Trump again. They have never in their lifetime seen the promise of redistribution of wealth work for them or the promise of free trade work for them, so they turn to nationalism. They can be their own worst enemy at times in the way they vote, and Republicans can stymie progress in Congress. But the bills need to be clearer about what is promised to everyone is they pass. Biden is not capable of going on a barnburner tour across the country to campaign the public to push for something. There's just big blobs of bills he tweets about that have everything under the sun in them. They needed someone younger and frankly smarter and more able. There's also the problem of  nuts on the left putting pressure on the Democratic party to have aggrieved groups fight over table scraps rather than raise the standard for everyone. And when Democrats don't tell the truth about one thing often by catering to smaller social causes or groups or to the increasingly tedious standards they have, conservatives will pounce and fill the void.\n\nRight now, I feel like Biden is just there as the world is changing around us and we don't know where it's going. So maybe he's a steady hand. The best we can do. I don't know.\n",
            "commentAuthor": "u/finestartlover",
            "commentReplies": [
                {
                    "commentText": "You're exactly right that Biden is a placeholder, America didn't want Trump and the Democrats didn't want Bernie. The other Democrat candidates were getting steamrolled so they said fuck it, 4 years of placeholder is preferable. Both Bernie and Biden will be too old for another run IMO, and Kamala is even less popular than Biden so I honestly do not know who's going to carry the torch going forward, and neither do the Democrats. So now we're back to more mediocre placeholder candidates until someone DOES appear(so long as they're not progressive, god forbid).",
                    "commentAuthor": "u/dagofin",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I’m ready for a cleaning out of the entire government\n",
            "commentAuthor": "u/cm_bonski",
            "commentReplies": [
                {
                    "commentText": "YES! But this time  NO LOBBIESTS!  Non paid concerned American's should be the only voices they are listening to.",
                    "commentAuthor": "u/Boingboingdurhurh",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Biden is living up to his main campaign platform of not being Trump. So there's that.\n",
            "commentAuthor": "u/theChinStrikesAgain",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Record shattering inflation, high unemployment, plummeting labor participation, constant covid fear propaganda, the brink of war in Taiwan and Ukraine, record shattering deficits, loss of medical freedom and privacy, chaos in the middle east, a pattern of perniciously unconstitutional edicts from the oval office, but hey, at least the President isn't orange, so I guess we're way better off.  That people can even ask questions like this with a straight face shows how little people actually know about current events, economics, and politics.  The comments are enough to make me wonder if I actually died years ago and am unknowingly in hell right now.\n",
            "commentAuthor": "u/awfulcrowded117",
            "commentReplies": [
                {
                    "commentText": "Right? Dont forget about the Americans that are still stranded in the middle east. These people who know absolutely nothing actually vote. Because he isn't Trump, they will ignore everything that is bad because they hate being so wrong.",
                    "commentAuthor": "u/GummyJohny",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "European here. Not as much fun to watch\n",
            "commentAuthor": "u/Tovakhiin",
            "commentReplies": [
                {
                    "commentText": "Too bad! Go watch England, they seem to be having a rough time of things.",
                    "commentAuthor": "u/Roguespiffy",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I’m not a raging maga trump fan. In fact I’m pretty moderate. And I certainly get a sense of relief knowing that my president isn’t saying something stupid or horrible every 15 minutes.\n\nWith that said, i hate Biden. And his entire administration. The economy is out of control, inflation is skyrocketing, the stock market sucks, trade deficits suck, we’re on the brink of war with Russia and China and escalating shit in the Middle East again, and nothing has gotten better for Americans in the homeland. So social justice has actually been done, no marginalized communities have been helped, big corporations and big pharma are still fucking us in the ass, unemployment is out of control, etc etc etc. Biden just sucks.\n\nAnd it doesn’t help that he’s practically dead. The man is a vegetable, an octogenarian who is WELL past his prime, has one foot in the grave and is essentially a puppet on strings for corrupt politicians and special interests.\n\nAgain, and I can’t stress this enough: I DO NOT LIKE TRUMP. Not at all. And most conservatives suck. But Biden is literally no better whatsoever, in any way shape or form\n\nEDIT: love all these angry comments trying to prove me wrong as if I asked for a debate lmao. Fuck off guys, I was simply answering the prompt with my honest opinion. Idc if you don’t like it, and you won’t convince me of otherwise. I didn’t ask for your input, so keep your stupidity to yourself.\n",
            "commentAuthor": "u/lmatier",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}