{
    "question": "What famous person would you be totally heartbroken to find out is a terrible human being?",
    "questionAuthor": "u/sydj_k941",
    "arrayAnswer": [
        {
            "commentText": "The original host for Blue's Clues, Steve Burns.\n",
            "commentAuthor": "u/kalanawi",
            "commentReplies": [
                {
                    "commentText": "When I was really little traveling with my parents, I had this favorite Blue’s Clues backpack. He was at that airport and saw it and came over to me and started talking to me about it! I was really little so I don’t remember everything he said but I remember asking him where Blue was and he said she was at Magenta’s house. So wholesome and I will forever cherish that moment and never forget it or the pic of me with himETA: Thank you for the awards! I asked my parents more about it, I apparently asked him where his \"green stripy shirt was\" and my mom said he said something along the lines of \"it was in the wash\" so was just wearing a blue shirt and baseball cap.",
                    "commentAuthor": "u/howsthatpepper",
                    "commentReplies": []
                },
                {
                    "commentText": "Oh! What a wonderful & amazing memory to be able to treasure.As a woman in my early 40s, I ugly cried when he put that video out last year. Ugly ugly ugly .. What a great man.",
                    "commentAuthor": "u/nutcracker_78",
                    "commentReplies": []
                },
                {
                    "commentText": "I'm at uni and that video came out right in a rather stressful week so it helped a lot, there was plenty of crying for sure",
                    "commentAuthor": "u/_solounwnmas",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Alan Rickman probably. He plays bad so well, but comes across very sweet and nurturing in interviews.\n",
            "commentAuthor": "u/Zjixujix",
            "commentReplies": [
                {
                    "commentText": "Someone I know who's really connected in Hollywood once told me that there are two types people who play evil characters:  The biggest assholes in the world and the nicest people you'll ever meet.I ran into Billy Zabka (villain of Karate Kid, star of Cobra Kai) once at a convenience store and told him I really loved the show, and he so appreciative I could tell I really made his day.   He just kept smiling at me as I walked to my car.",
                    "commentAuthor": "u/hotdoug1",
                    "commentReplies": []
                },
                {
                    "commentText": "...he kept following me home, still smiling. He's outside my bedroom window right now. It's on the second floor?",
                    "commentAuthor": "u/sladives",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Mr Rogers\n",
            "commentAuthor": "u/The-Reddit-Giraffe",
            "commentReplies": [
                {
                    "commentText": "Funny fact: Mr Rogers thought farts were funny and would make fart noises to make his wife laugh.",
                    "commentAuthor": "u/QcumberKid",
                    "commentReplies": []
                },
                {
                    "commentText": "He also was known to never swear. But apparently Lady Elena swore A LOT.",
                    "commentAuthor": "u/ScarletCaptain",
                    "commentReplies": []
                },
                {
                    "commentText": "The harshest thing in his vocabulary was “Oh, Mercy!” a phrase he often uttered when looking at the day’s stack of letters. He also tried very hard to answer every bit of fan mail he got.",
                    "commentAuthor": "u/cantfindausernameffs",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Bob Ross\n",
            "commentAuthor": "u/LovliBea85",
            "commentReplies": [
                {
                    "commentText": "Favorite bit about the Boss Ross, he was the drill instructor equivalent in the air force. When questioned on why he’s so easy going when he used to have to yell at people for discipline. Bob responds “I decided I didn’t want to yell at people anymore, so I stopped”, what a legendedit: spelling happy accidents",
                    "commentAuthor": "u/TheRealJugger",
                    "commentReplies": []
                },
                {
                    "commentText": "He was a First Sergeant, not Military Training Instructor (AF version of Drill Sergeant).1Sgt is a position (not rank) in which he's the bridge between the commander and the enlisted people assigned to them. He's basically the person people go to whenever they have some kind of issue, whether personal or job related, but that also means they're the person alongside the commander when dishing out corrective actions. Their job is to take care of troops and assist/advice the commander. Some Shirts (common nickname for 1Sgts) are awesome at really taking care of folks and make themselves really approachable. Had one that would walk around with a backpack full of BK Stackers during training exercises to hand out to people who were swamped working and couldn't get a chance to eat. Others are hard asses and make people fear getting in trouble. The position is mainly filled by volunteers and being selected is hard, so most of them do care about their people to some degree.EDIT: Thanks for the awards! Never expected to get so many votes over this. Way more than my engagement post with my wife lol. Also, didn't know Shirts were different in the other branches in terms of rank/position. In the AF, any Senior Non Commissioned Officer (E-7 through E-9) can be a shirt. They work with the commander (Major and above... not sure if Captains can be commanders but I've never seen one). Whenever they're not available due to leave or whatever, there will be an \"acting 1Sgt\" who is usually a TSgt (E-7) and above. Sometimes they even rotate if the Shirt is gone for an extended period of time. Now and then they'll also have someone shadow them to prepare for that position if the individual is going for it, and we called them Under Shirts. Instead of having platoon leaders, we had an OIC (Officer in Charge) for the unit. They were usually a Captain or Major, and had a Superintendent (Senior/Chief... E-8 or E-9) to assist them, so not too far off in terms of structure when compared to the other branches. Oh, and a little fact I found out once was that the Shirt will even take care of troops who are in confinement. I had a troop do a month before being separated and the 1Sgt had to visit by reg, though I'm not sure what the specifics are.So yeah, I got lucky and had good Shirts through most of my career, but it's definitely not a job for everyone.",
                    "commentAuthor": "u/evening_crow",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Dolly Parton\n",
            "commentAuthor": "u/throwaway_0k_",
            "commentReplies": [
                {
                    "commentText": "\"Even I think she's delightful.\"~Some hussy with Emerald eyes and Auburn hair.",
                    "commentAuthor": "u/PM-Me_Your_Penis_Pls",
                    "commentReplies": []
                },
                {
                    "commentText": "Fun fact about Jolene, Jolene was a bank teller dolly Parton was jealous of. She looks back and thinks she was young and insecure. Jolene had never do e anything in the wrong.",
                    "commentAuthor": "u/willthesane",
                    "commentReplies": []
                },
                {
                    "commentText": "Fun fact about I will always love you, totally platonic love. Song was written for Porter Wagner who made her a star but she was leaving his variety show. The song was her farewell.",
                    "commentAuthor": "u/cbizzle187",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "It’d be a rude awakening to find out Danny Devito took notes from Epstein\n",
            "commentAuthor": "u/Obliviouslynormal",
            "commentReplies": [
                {
                    "commentText": "Then he would be a literal TRAAASH MAAN!",
                    "commentAuthor": "u/smilingcorpse",
                    "commentReplies": []
                },
                {
                    "commentText": "you called?",
                    "commentAuthor": "u/OfficialTrashMan",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Julie Andrews. She just seems so genuinely lovely.\n",
            "commentAuthor": "u/Zoe270101",
            "commentReplies": [
                {
                    "commentText": "I'd let Julie Andrews beat me to death with an umbrella.",
                    "commentAuthor": "u/LordCloverskull",
                    "commentReplies": []
                },
                {
                    "commentText": "Just aSMACKspoonful ofSMACKsugar makes theSMACKmedi-cine goSMACKdown",
                    "commentAuthor": "u/Boloar",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Keanu  Reeves\n",
            "commentAuthor": "u/Clockwork-Clementine",
            "commentReplies": [
                {
                    "commentText": "I always like to tell this story when he comes up:A friend of mine was in Hamlet with him when he played the role in Winnipeg. He took equity scale (minimum union salary)  so that all of the actors wouldn’t have to be paid less.",
                    "commentAuthor": "u/SexyHamburgerMeat",
                    "commentReplies": []
                },
                {
                    "commentText": "He went into Eaton's downtown to buy a watch during that stint, my mom waited on him. Said afterwards that he was an extremely polite young man but at the time she had no clue who he was. After he left a bunch of other staff ran over to tell her. She still had no idea who he was, \"they said he was famous!\"",
                    "commentAuthor": "u/have2gopee",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "David Tennant\n",
            "commentAuthor": "u/tilyver",
            "commentReplies": [
                {
                    "commentText": "I think he's just got to be the same delightful ball of chaos and merriment in real life that he comes off as in many of his roles.   It'd be an awful thing to find he isn't as nice as he appears.",
                    "commentAuthor": "u/NotARobotDefACyborg",
                    "commentReplies": []
                },
                {
                    "commentText": "I think so too! He just seems so good! And fun and mischievous!",
                    "commentAuthor": "u/tilyver",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Hugh Jackman\n",
            "commentAuthor": "u/Yodeling_Prospector",
            "commentReplies": [
                {
                    "commentText": "That 1 video of his old student being an interviewer talk to him, live rent free in my head. Pretty much solidify Hugh Jackman's personality to me. It would legit be ashame if I'm wrong.",
                    "commentAuthor": "u/ericmok100",
                    "commentReplies": []
                },
                {
                    "commentText": "There was also a video that was  pretty cool recently where he was doing The Music Man and one of the leads was out sick and they had to call in a swing, a last minute substitute who trains to sub in for many  roles on a production (this lady was prepared to sub in for 8 of them).  This person didn't have any rehearsal time on this production prior to the day of the production.  She basically came in and nailed the part.  Hugh Jackman made it a point to praise her in front of the audience at the end and she got an ovation just for her efforts.https://www.youtube.com/watch?v=VMW45PHkDp0",
                    "commentAuthor": "u/Wilhelm_Amenbreak",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "[removed]\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "When I was in 7th grade I was at Dave & Busters when I saw Tony Hawk in a photo booth with his son.  I didn't want to be rude but I couldn't pass up the opportunity to ask for an autograph.  When he was leaving the photo booth I ran up to him with my little brother and asked and he happily said of course and signed my shirt I was wearing.  Immediately after he got swarmed by the other kids nearby. I felt so bad but he was just signing away.  He's definitely a nice guy.",
                    "commentAuthor": "u/ctatum89",
                    "commentReplies": []
                },
                {
                    "commentText": "A couple of Tony's kids played rec soccer in a program i ran. He was at a practice at a local elementary school one day and he was catching about 8 little brothers and sisters after the ran down a steep hill. He'd catch them and they took another turn. This went on until practice ended.Rob Machado is pretty cool, too.",
                    "commentAuthor": "u/underlyingconditions",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Jack Black\n",
            "commentAuthor": "u/dugonit",
            "commentReplies": [
                {
                    "commentText": "Had a buddy run into him at a skate shop in my city. Buddy said he was super cool and had a great convo, took a picture, and said he was as jack blackish as you’d expect.",
                    "commentAuthor": "u/N0wayjose",
                    "commentReplies": []
                },
                {
                    "commentText": "I hope I'm as Jack Blackish as I can be.",
                    "commentAuthor": "u/Dogsaway41",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Brendan Fraser\n",
            "commentAuthor": "u/hellkittyx",
            "commentReplies": [
                {
                    "commentText": "For the amount of personal & professional stuff he’s gone through… but, yeah, that would be tough.  “Blast from the Past” is still one of my favorites.",
                    "commentAuthor": "u/CarlosAVP",
                    "commentReplies": []
                },
                {
                    "commentText": "Bedazzled! Or Encino Man are also great fun!Fun fact Elizabeth Hurley provided her OWN outfits for that movie...",
                    "commentAuthor": "u/decoy777",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Alan Tudyk. He’s my favorite scene chewing villain, my favorite alien, my favorite chicken. \n\nThe last thing I read about him was he helped his wife out on the set of Peacemaker with choreography.\n",
            "commentAuthor": "u/kauni",
            "commentReplies": [
                {
                    "commentText": "He's an amazing hillbilly to. If you haven't seen Tucker and Dale vs Evil, definitely give it a watch",
                    "commentAuthor": "u/Dexnix",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Recently found out he played a dumb toucan in Encanto and I was like. Of fucking course it’s fucking Alan Tudyk. The man is amazing and talented and doesn’t get near as much love as he deserves.",
                    "commentAuthor": "u/unbentlettuce12",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Betty White\n",
            "commentAuthor": "u/ashnoelle1217",
            "commentReplies": [
                {
                    "commentText": "I remember after she died people were instantly trying to bring up old shit she did to drag her.\nWhat a shock that a 100 year old white lady wore a Native American head dress on the golden girls one time.",
                    "commentAuthor": "u/BeelzebubParty",
                    "commentReplies": []
                },
                {
                    "commentText": "Speaking of golden girls, it does semi blow my mind how the four women didn’t like each other, outside of rue and Betty who became genuine friends. Bea didn’t like how optimistic Betty was and admitted she lost contact with the girls after the show ended, Estelle would forget lines and this upset rue, albeit she did apologize when she found out it was because of dementia, etc. The only thing they did together was eat lunch. In a sense, their relationship was very “I don’t like you but we have a job to do so let’s do it.”",
                    "commentAuthor": "u/CapriciousSalmon",
                    "commentReplies": []
                },
                {
                    "commentText": "I suppose that just shows how talented they were at acting since they could convince everyone they liked each other.",
                    "commentAuthor": "u/BeelzebubParty",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Patrick Stewart.\n",
            "commentAuthor": "u/azzoun",
            "commentReplies": [
                {
                    "commentText": "Patrick Stewart doesn't really like engaging with fans about his X-Men or Star Trek stuff. But if you talk to him about some obscue Broadway play he's been in, he is very gracious and seems to have all the time in the world for you.",
                    "commentAuthor": "u/Gendug",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah from what I've seen in interviews, the more obscure and lesser known the role, the more excited he gets. The guy has a great range for acting but most only see him as Picard and Xavier.",
                    "commentAuthor": "u/LuntiX",
                    "commentReplies": []
                },
                {
                    "commentText": "I'll be sure to bring up his role as the Poop Emoji if I ever meet him.",
                    "commentAuthor": "u/Justice_Prince",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Grant Imahara. RIP, he’s one of my role models.\n",
            "commentAuthor": "u/IzaCoder",
            "commentReplies": [
                {
                    "commentText": "We had a corporate event where he came and talked about innovation. I met him and spoke for a bit….was really friendly!",
                    "commentAuthor": "u/SwissRanger1003",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Grant was a death that didn't really hit me at first, which surprised me, because mythbusters may as well be my main personality trait. MB basically raised me, and had an unparalleled effect on how I look at the world.But when Grant died, it was just another minor celebrity death to me. I thought, you know, I'll be a lot sadder when Adam or Jaime go.Until I read all the things other people like me said about him. All the ways that he, specifically, informed who they are today.He had a profound influence on a lot of people that I did not expect.",
                    "commentAuthor": "u/DangerSwan33",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Weird Al. Everything about him is just wholesome. -R\n",
            "commentAuthor": "u/randtcouple",
            "commentReplies": [
                {
                    "commentText": "Fun fact: my step dad was working with him when he was doing standup one time a loooonggg time ago. Absolutely nice guy who doesn’t act like he’s famous. (Also my stepdad was doing standup, sorry for confusion)",
                    "commentAuthor": "u/Background_Parsnip_2",
                    "commentReplies": []
                },
                {
                    "commentText": "I’ve worked with him a couple times as a stagehand. One time he b-lined over to me to shake my hand and ask me how I was doing. Then later he was spotted walking around downtown just going into local businesses by himself, meeting locals, taking photos. He’s genuinely genuine. Now that I’m higher up the ladder in my industry, the fact that my company does a lot of shows with him, I cannot wait to get to eventually do a few with him as the guy running the show.",
                    "commentAuthor": "u/praisecarcinoma",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Robin Williams\n",
            "commentAuthor": "u/Adriennesegur",
            "commentReplies": [
                {
                    "commentText": "I would legitimately cry. This is the only celebrity death that fucked me up when I heard about it",
                    "commentAuthor": "u/acru95",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "He had his moments, but he was always open with his demons. If his honesty helped one person rehab out of drugs and/or alcohol, I feel he would've been overjoyed to know that.",
                    "commentAuthor": "u/SSBoe",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Sir David Attenborough\n",
            "commentAuthor": "u/rublehousen",
            "commentReplies": [
                {
                    "commentText": "I’ve seen him talk live. He’s a funny, little bit dirty, witty old man. Just like your favourite grandpa.",
                    "commentAuthor": "u/mooseman2234",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Oh that would suck so bad",
                    "commentAuthor": "u/Curious_Wrangler_980",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Paul Rudd.\n",
            "commentAuthor": "u/uhhshlay",
            "commentReplies": [
                {
                    "commentText": "Completely chill guy. I saw him at a bar with some of the other avengers while they were filming, it was like 2 am, and even though he totally could have said no or ignored me and it would have been completely understandable he took a pic with me and chatted with me for thirty seconds. And before you ask, I was like 8 drinks into my night which was the only reason I even approached him.",
                    "commentAuthor": "u/SEODRohan",
                    "commentReplies": []
                },
                {
                    "commentText": "Is his booty as awesome in person as it is in every single movie he’s ever been in? Asking for a friend who is presumptuous and immature.",
                    "commentAuthor": "u/verguenzapato",
                    "commentReplies": []
                },
                {
                    "commentText": "Well it's not America's ass, but he was close enough to it during filming!",
                    "commentAuthor": "u/Boloar",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Steve Irwin (if he were still with us)\n",
            "commentAuthor": "u/Clockwork-Clementine",
            "commentReplies": [
                {
                    "commentText": "Would be worse since he's dead, having gone all this time remembering him in wholesome way",
                    "commentAuthor": "u/Flaccid-Chicken",
                    "commentReplies": []
                },
                {
                    "commentText": "That’s really sad to think about",
                    "commentAuthor": "u/sydj_k941",
                    "commentReplies": []
                },
                {
                    "commentText": "Imagine it. Steve fuckin’ Irwin, didn’t give a shit about nature, he just wanted to get on tv and make cash. I’d off myself, right here, right now.Have you ever seen that interview of him saying that he just wants to use whatever wealth he accumulates to help animals? He is literally the best person to ever walk this earth. Such a pure motherfucker. I’d love to have met him.",
                    "commentAuthor": "u/___JohnnyBravo",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Oh God I accidentally read the title as, \"What famous person is a terrible human being\". Reading the comments I was lost for a good 5 minutes\n",
            "commentAuthor": "u/EELDealz",
            "commentReplies": [
                {
                    "commentText": "Sees Bob Ross at the very top“WHAT THE FUCK?!”",
                    "commentAuthor": "u/Entercheesynamehere",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Steve Carell\n",
            "commentAuthor": "u/Weatherbunny7",
            "commentReplies": [
                {
                    "commentText": "Oh man that would hurt. It would take me awhile to separate his Michael Scott character from him mentally",
                    "commentAuthor": "u/allisonofgreengables",
                    "commentReplies": []
                },
                {
                    "commentText": "Don’t watch The Morning Show! It’s really good, but he is so convincing in that role, and it was so hard to reconcile that with lovable Steve!",
                    "commentAuthor": "u/sydj_k941",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Mr.Bean\n",
            "commentAuthor": "u/IcyMoistTowel",
            "commentReplies": [
                {
                    "commentText": "The Blackadders are right pricks, though.",
                    "commentAuthor": "u/psilcosyin",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "His name is Rowan Atkinson.",
                    "commentAuthor": "u/gnomzy123",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Tom Hanks\n",
            "commentAuthor": "u/EddieAllenPoe",
            "commentReplies": [
                {
                    "commentText": "I was looking for this entry to make sure i wouldn't repeat.He seems the nices person in the world, I would really be heartbroken",
                    "commentAuthor": "u/Fun_Computer_8401",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}