{
    "question": "What is the most controversial food opinion you have?",
    "questionAuthor": "u/PairWorldly169",
    "arrayAnswer": [
        {
            "commentText": "I’ve got the cilantro soap gene. It is very hard having this gene in a primarily Mexican community and I always get the “yOurE sUCh a PIcKy eaTer”. NO. I DONT WANT MY TACOS TASTING LIKE FABULOSO GOT POURED ON THEM. (Edit; for those not in the US cilantro is coriander)\n",
            "commentAuthor": "u/houseofreturn",
            "commentReplies": [
                {
                    "commentText": "I only recently learned that there's an actual genetic difference between those that enjoy cilantro and those that cannot stand it.  I really feel bad for the latter group.  Imagine having such a severe genetic disorder that cannot be concealed.Edit:  spelling",
                    "commentAuthor": "u/AmigoDelDiabla",
                    "commentReplies": []
                },
                {
                    "commentText": "I went to this very expansive restaurant once-ordered a beautiful crab and white asparagus soup. I was so excited!  Took my first spoonful-might as well have been drinking the dishwater. $30 bowl of soup, and I couldn’t eat it. Stupid cilantro.",
                    "commentAuthor": "u/The_I_in_IT",
                    "commentReplies": []
                },
                {
                    "commentText": "Dang, after reading this I might have it. My wife made food the other night and I was like dang, this taste like soap was left in the bowl. Figured it was just my bowl. Could have been, we'll never know.",
                    "commentAuthor": "u/Mindspiked",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "You can eat anything, any time.\n\nHave a three-course pasta-based feast for breakfast. Do it. I dare you.\n\nEveryone I knows says you can't do that because it's not \"breakfast food\" and whatnot.\n\nYOU CAN DO WHATEVER THE FUCK YOU WANT.\n",
            "commentAuthor": "u/SeemytrVASF",
            "commentReplies": [
                {
                    "commentText": "In the morning when my husband tells me what I’m eating isn’t “breakfast food” my response is “it is if I’m eating it in the morning!”",
                    "commentAuthor": "u/omgbbqpork",
                    "commentReplies": []
                },
                {
                    "commentText": "Fun Fact: in Thailand, they don’t have “breakfast food.”  Breakfast Food is just whatever regular food you ate for breakfast.  There’s no special times of day that people eat certain foods (other than personal preference).",
                    "commentAuthor": "u/JetScreamerBaby",
                    "commentReplies": []
                },
                {
                    "commentText": "Am Half-Thai. Visited fam. Can vouch. It’s whatever you saved the night before that becomes breakfast-ish.",
                    "commentAuthor": "u/N00dlemonk3y",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Muffins are just cake disguised as breakfast food.\n",
            "commentAuthor": "u/Zealousidealday76",
            "commentReplies": [
                {
                    "commentText": "I’m a chef and I’ve been saying this for years!!  Breakfast imposter, pretending to be healthy. At least a danish is honest with youEdit: Who thought my most upvoted anything would be a pithy throw away about breakfast. Thanks Reddit! 🤓",
                    "commentAuthor": "u/HereForAllThePopcorn",
                    "commentReplies": []
                },
                {
                    "commentText": "People think muffins are healthy?",
                    "commentAuthor": "u/J3musu",
                    "commentReplies": []
                },
                {
                    "commentText": "People eat bran muffins. Allegedly.",
                    "commentAuthor": "u/AltSpRkBunny",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "If I crack an egg on it while reaheating it, it becomes a breakfast food.\n",
            "commentAuthor": "u/ChirpinFromTheBench",
            "commentReplies": [
                {
                    "commentText": "If it’s your first meal of the day, it’s breakfast anyway. Leftover sushi for breakfast is fun.",
                    "commentAuthor": "u/Uncle-Istvan",
                    "commentReplies": []
                },
                {
                    "commentText": "Sushi leftovers has to be the winner of this thread, yet it's just in a reply chain. Sushi leftovers is big NoNo in my house.",
                    "commentAuthor": "u/inspectorlully",
                    "commentReplies": []
                },
                {
                    "commentText": "What is leftover sushi? I did not know it was possible to stop yourself from eating all of it...",
                    "commentAuthor": "u/Scrump_Lover69",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "MSG is awesome. I put that shit in a salt shaker 50/50 with table salt and use it in everything that calls for salt. Pure umami is game changing.\n",
            "commentAuthor": "u/JamesBenjamin76",
            "commentReplies": [
                {
                    "commentText": "Ooh never thought to mix it with table salt! I'll have to try that. I use it straight while I'm cooking.Edit: I'll still use straight MSG/salt while cooking, but might cut my regular salt shaker with MSG.",
                    "commentAuthor": "u/Aledeyis",
                    "commentReplies": []
                },
                {
                    "commentText": "There's a Cajun spice called Magic Swamp Dust that is MSG, granulated garlic, granulated onion, black white and red pepper and oil of lemon. It may have crack in it too.",
                    "commentAuthor": "u/rudderusa",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Orange tic-tacs are not breath mints. They are candy\n",
            "commentAuthor": "u/Significant-Trouble6",
            "commentReplies": [
                {
                    "commentText": "I heard that tic tacs are allowed to be labeled sugar free because they're below the 1g of sugar per serving rule, despite tic tac themselves being basically sugar.",
                    "commentAuthor": "u/VanCanFan75",
                    "commentReplies": []
                },
                {
                    "commentText": "This is easily confirmed by looking at the ingredients label.The rule is actually 0.5g of sugar per serving can put 0g in the nutrition facts. I'm not certain they say can say sugar free, but since each tic tac is less than that, they can say 0g despite being primarily be made of sugar",
                    "commentAuthor": "u/MagnusText",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "People with severe food allergies should eat at home.\n\nAs an actual unpopular opinion I'm sure this will get buried, but I'm 100% serious. I did a decade in culinary and I can guarantee you that eating out with a severe seafood, mushroom, nut or allium allergy is no different than rolling dice with your life. Back of house workers will generally have some degree of training in avoiding cross contamination, but very few will be able to reliably guarantee that you won't be firing epinephrine into your thigh by dessert. I can promise you that Braxxxton the budding garde manger/aspiring Soundcloud rapper with face tattoos and meth pipe burns on his mouth isn't the guy to place your trust in. \n\nEat at home.\n",
            "commentAuthor": "u/curdled_fetus",
            "commentReplies": [
                {
                    "commentText": "I work at a Subway and had a guy order a gluten free for an allergy. He mentions later on that its for his young son who's deathly allergic. I immediately stopped and said that everything is shared equipment and that no one should eat at Subway if they have an extreme gluten allergy. He just kind of went \"eh its fine\" and told me to keep going. Like homie you're okay with gambling your sons life just so he doesnt feel a little left out when you order takeout?? Our entire menu is bread and you're telling me your little kid will drop dead if any bread comes within like a 5 mine radius of him. Please don't put that responsibility on me as a worker, because we cannot guarantee that it is 100% allergen free.",
                    "commentAuthor": "u/gotdamnboottoobig",
                    "commentReplies": []
                },
                {
                    "commentText": "One time I had a customer ask me if something had a certain ingredient, I said \"I can't guarantee it doesn't have it, because part of the ingredient list here is just 'spices' which could include that thing' then she said 'ah it's probably fine' then later called to complain saying I told her it would be fine. Some people are just liars or brain dead or both.",
                    "commentAuthor": "u/Oberon_Swanson",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I have family in the UK. Last time I was there an aunt caused a “hubbub” by putting baked beans with the mince in a shepherds pie.\n",
            "commentAuthor": "u/CircusSeal",
            "commentReplies": [
                {
                    "commentText": "I’m British. That sounds wrong. Beans for on toast or with a full English. Mixed into a shepherds pie? Ugh.",
                    "commentAuthor": "u/BrockStar92",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "No recipe is sacred.  They're all eligible for reinterpretation regardless of your emotional attachment to them.\n",
            "commentAuthor": "u/SevenTheTerrible",
            "commentReplies": [
                {
                    "commentText": "Also, can we stop with the \"family secrets\"?  Every damn time I ask for one of my mother's recipes I get a lecture from someone about not sharing it with anyone.   It's a ragu sauce, not nuclear fucking launch codes, damn!",
                    "commentAuthor": "u/phrantastic",
                    "commentReplies": []
                },
                {
                    "commentText": "Grandma probably got it from the side of a soup can anyways.",
                    "commentAuthor": "u/Spoon_Elemental",
                    "commentReplies": []
                },
                {
                    "commentText": "Neslay Tol-house",
                    "commentAuthor": "u/bearbarebere",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "If I can't safely consume it, keep it the fuck off of my cocktail glass. I'm talking tiny umbrellas, mini clothespins, etc.. Even if a garnish is more decorative than delicious I think it's fine as long as it wouldn't hurt you to consume it (like dehydrated citrus wheels). Basically, I have no interest in little pieces of future garbage as a decorative element.\n",
            "commentAuthor": "u/Ill_Barracuda4929",
            "commentReplies": [
                {
                    "commentText": "A bar in Indianapolis used to have a drink where the garnish was a wax dipped cigarette butt.",
                    "commentAuthor": "u/kedavo",
                    "commentReplies": []
                },
                {
                    "commentText": "Fucking why?",
                    "commentAuthor": "u/Ryoukugan",
                    "commentReplies": []
                },
                {
                    "commentText": "you’re talking about it.-leonard",
                    "commentAuthor": "u/nutzsquirrel",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "broccoli is tasty\n",
            "commentAuthor": "u/kekcuk_13",
            "commentReplies": [
                {
                    "commentText": "LOVE broccoli!  Delicious, cancer-fighting, beautiful little trees",
                    "commentAuthor": "u/ShellySerena",
                    "commentReplies": []
                },
                {
                    "commentText": "Little trees are what nephew used to call brocoli.",
                    "commentAuthor": "u/Scribb74",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Frozen blueberries (forzen when freshly picked) are better than just fresh blueberries. When we used to go blueberry picking, I would freeze them before I ate them. (And I'd eat them half frozen) Sweeter that way it seemed\n",
            "commentAuthor": "u/Altruistic_Yam1178",
            "commentReplies": [
                {
                    "commentText": "Frozen red grapes a sweeter too!",
                    "commentAuthor": "u/Smitti85",
                    "commentReplies": []
                },
                {
                    "commentText": "Frozen grapes are 10000000000% better than regular ones. They are by far the fruit that has that affect above all others for me. I could eat frozen grapes until I'm sick lol",
                    "commentAuthor": "u/ruffsnap",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Pizza is healthy depending on how you cook it and what ingredients are used\n",
            "commentAuthor": "u/msalaska",
            "commentReplies": [
                {
                    "commentText": "And what you define “healthy” relative to. Pizza contains more protein than many breakfast cereals, and is less likely to cause a sugar crash. As such, pizza is a better breakfast than lucky charms.",
                    "commentAuthor": "u/Saith_Cassus",
                    "commentReplies": []
                },
                {
                    "commentText": "I run ultramarathons and I eat pizza while running long distances. When going 50+ miles, you are more speed-hiking than sprinting, so eating on the move is necessary. At 5'0\" 48kg, I still easily burn 5-6,000 calories in a race. Pizza is easy to digest and good fuel for long-haul cardio. It's a good balance of fats, carbs, and protein. It can be calorie dense if you do deep dish, or very light if you do thin crust. Adjust your recipe for your caloric needs. Pizza for the win.",
                    "commentAuthor": "u/I_am_Jo_Pitt",
                    "commentReplies": []
                },
                {
                    "commentText": "If you are running ultras then basically no calorie issues apply to you…",
                    "commentAuthor": "u/Mordikhan",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I’m in Milwaukee and this is controversial around here, maybe elsewhere too. \n\nDon’t simmer/parboil/boil/whatever bratwurst in beer. Just take them straight from the fridge to the grill and throw them on low or indirect heat.  Simmering in beer is a waste of time, waste of beer, and it causes fat and spices to leach out of the brats, lessening the flavor and texture of the brat.\n",
            "commentAuthor": "u/Thirty_Helens_Agree",
            "commentReplies": [
                {
                    "commentText": "As a German I feel offended. Why would one do something so barbarian?",
                    "commentAuthor": "u/PvtPill",
                    "commentReplies": []
                },
                {
                    "commentText": "As 17 year olds we were up at the Up Michigan and had no access to getting more beer so what we brought was what we had. The last morning of camping before leaving we had 10 beers left and 4 guys. 3 of us went for a boat ride around a creek for 45 to smoke weed and came back to someone delighted to tell us he’s making the final brats. Nice, we are high and foods being made. Look for the beer, and nope. Used ALL 10 beers to make like 12 brats…. Never been camping with that man again many years later.",
                    "commentAuthor": "u/_suburbanrhythm",
                    "commentReplies": []
                },
                {
                    "commentText": "…because someone killed him?",
                    "commentAuthor": "u/giggity_0_0",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "That excessive pickiness about food is worth breaking up over.\n",
            "commentAuthor": "u/DonQOnIce",
            "commentReplies": [
                {
                    "commentText": "I did NOT want to spend my life with someone who ordered hamburgers at every single restaurant ever- whether it was a Chinese place, Mexican, Italian, or even a just a pizza joint- it was the fucking hamburger. Eventually I just blew my top.This dude had the audacity to bitch about not finding anything to eat in KOREA- because nobody apparently had his basic-ass hamburger. He was not even interested in trying anything else, ever.",
                    "commentAuthor": "u/Lady_DreadStar",
                    "commentReplies": []
                },
                {
                    "commentText": "I knew a guy whose diet was essentially 80% ritz crackers.He was short, skinny, and all his joints ached. Gee, I wonder if it has to do with your shitty diet man?",
                    "commentAuthor": "u/dcman00000",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "We have too many restaurants and can shed like 80% of them. \n\nToo much fast food, mid/lowtier chains (Chili's), and future bankruptcies where like somebody gets an inheritance and the only thing they can think is opening a diner.\n",
            "commentAuthor": "u/Permanganic_acid",
            "commentReplies": [
                {
                    "commentText": "We have too many chain restaurants and not enough small ones.",
                    "commentAuthor": "u/PM_ME_YOUR_ATM_PIN",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Lots of good food takes time. I can't spend 10 hours every day smoking meat or 4 hours prepping shawarma. Sure get rid of all the frozen pre-prepped garbage restaurants which is more then 80% of them but real homemade food and mom/pop restaurants are a boon for society.",
                    "commentAuthor": "u/bkydx",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Taco Bell is good. And the reason you shit your brains out is likely because you drank too much alcohol and then ate too much food before passing out at 3am.\n",
            "commentAuthor": "u/fcdftw",
            "commentReplies": [
                {
                    "commentText": "Redditors complaining about Taco Bell giving them the shits is because their body can't handle all the fiber since their main diet consists of doritos and mountain dew. I have seen Redditors arguing that fruit is just as unhealthy as candy because of \"all the sugar\" in it.",
                    "commentAuthor": "u/Whobeon",
                    "commentReplies": []
                },
                {
                    "commentText": "THIS DRIVES ME CRAZY!I,  at one point, lost a lot of weight in a year, and of course people ask \"how did you do it?!\" The answer is of course eat less and move more, but often a specific I gave was I limited my intake except when it came to fruits and vegetables, which I allowed myself to eat whenever. People would always come back with \"you know how much sugar is in fruit?\" You know what else has a lot of sugar in it? A ton of processed crap I ate before losing weight. You know what that food didn't have? Any other nutritious value.  People really tried to dissuade me from eating fruit, of all things.",
                    "commentAuthor": "u/fersure4",
                    "commentReplies": []
                },
                {
                    "commentText": "It's wild to me how many people will genuinely argue that an apple is as bad for you as a snickers bar.",
                    "commentAuthor": "u/ask-me-about-my-cats",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Not many foods on earth no matter the price can top fresh warm bread with butter.\n",
            "commentAuthor": "u/magnus91",
            "commentReplies": [
                {
                    "commentText": "My first stab at home baking was the day I discovered I could eat a whole loaf of bread without much difficulty",
                    "commentAuthor": "u/SirCoughAGuy",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The fuck is wrong with pineapple on pizza - even if you don’t like it? All the crusaders against it have something wrong in the head.\n",
            "commentAuthor": "u/crazyrich",
            "commentReplies": [
                {
                    "commentText": "I used to work at a pizza place. A customer ordered pineapple jalapeño pizza and never came to get it so we employees got to keep it, but nobody else wanted it so I took the whole thing home, just because I wasn’t turning down a whole free pizza. It was a brilliant, top-tier pizza combination. Just awesome. I’d never had pineapple on pizza before but after that I understood.",
                    "commentAuthor": "u/IAmNotRyan",
                    "commentReplies": []
                },
                {
                    "commentText": "Pineapple, pepperoni, jalapeno is the best pizza that exists",
                    "commentAuthor": "u/Persimmon_Lover",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Fresh garlic and dried garlic are not the same ingredient.\n\nFor some recipes dried is better for some fresh is better.\n",
            "commentAuthor": "u/3Fatboy3",
            "commentReplies": [
                {
                    "commentText": "And sometimes both in the same recipe lol I may just love garlic",
                    "commentAuthor": "u/givemethezoppety",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Isn't this just cooking advice?",
                    "commentAuthor": "u/DiegoMurtagh",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "eating the same thing every day is fine\n",
            "commentAuthor": "u/bee-sting",
            "commentReplies": [
                {
                    "commentText": "Specialy if it's Rice.",
                    "commentAuthor": "u/severalpillarsoflava",
                    "commentReplies": []
                },
                {
                    "commentText": "That's a weird way to spell tacos",
                    "commentAuthor": "u/thakurtis",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I like brownies and ice cream separately, but i don’t like brownies IN ice cream. However, ice cream on top of a brownie is ok\n",
            "commentAuthor": "u/Key-Ad1084",
            "commentReplies": [
                {
                    "commentText": "The brownie being warm is key to ice cream on top",
                    "commentAuthor": "u/CHUNKY_BLOODY_QUEEFS",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I love flavored sparkling water, LaCroix/Waterloo etc. People always have to make some comment about how it barely tastes like anything. For a zero calorie beverage, it tastes a hell of a lot better than diet soda, and yeah, regular soda or sweet tea or lemonade do taste better than sparking water, but they have like 150 calories in a can and rot your teeth. I'm sure smoking crack feels even better than drinking a soda, but you're gotta draw the line somewhere.\n",
            "commentAuthor": "u/ElToberino",
            "commentReplies": [
                {
                    "commentText": "I tell people to just add a little bit of their fav juice to sparkling water. You get sweetness and flavor without as much calories band sugar. It helped me beat my soda habit",
                    "commentAuthor": "u/Taxed_concerns",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Most people who think vegetables taste bad don't know how to cook them properly.\n",
            "commentAuthor": "u/Yesberry",
            "commentReplies": [
                {
                    "commentText": "True, but I hear this all the time. Not really controversial",
                    "commentAuthor": "u/howe_to_win",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Dandelions and other edible weeds are tastier than most salads sold in markets.\n\n​\n\nEdit: Holy hand grenades. This is my most upvoted comment ever. Thanks everyone! Ya'll a bunch of weed eaters. I love it!\n\nEdit2: Since many of you asked, I found dandelions are best with a little oil and vinegar. Also they are less bitter in the spring.\n",
            "commentAuthor": "u/MagicBlueberry",
            "commentReplies": [
                {
                    "commentText": "dandelion (sid voice)",
                    "commentAuthor": "u/poopooweewee79",
                    "commentReplies": []
                },
                {
                    "commentText": "Musht be the lasht one of the sheashun",
                    "commentAuthor": "u/Showmeyourteats",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Cooked fruit is inferior to fresh fruit.\n",
            "commentAuthor": "u/cursebrealer1776",
            "commentReplies": [
                {
                    "commentText": "I don't understand, is this an actual controversial opinion? I can't believe the responses to your comment! Who prefers cooked fruit over juicy, refreshing fresh fruit?",
                    "commentAuthor": "u/ADONI55",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Not if it's in a pie.",
                    "commentAuthor": "u/flash17k",
                    "commentReplies": []
                }
            ]
        }
    ]
}