{
    "postText": "My (25F) father married my step-sister's (23F) mother when I was 4 and she was 3. We've lived together most of our lives and are a family. She and I were extremely close.\n\nShe developed cancer when she was 14 and was sick for about 2 years. She's since made a full recovery. During that time, my parents became understandably over-protective. They also asked a lot of me. I quit my extracurriculars so I could get a job (the money went towards her medical bills) and so I could drive her to appointments. I didn't go to dances and any fun activities I did needed to include her. I did almost all of this willingly, the exception being having to quit my high school volleyball team - I did throw a bit of a tantrum about that, but was swiftly punished. And I think having one emotional breakdown was pretty chill given the circumstances.\n\nAnyhow, I go to college and meet my ex, we'll call him Ben, when I'm a junior. We fall in love, blah blah blah. He and I move in together when we graduate, so we've been living together for about 3 years. We were serious until July when I walked into my bedroom and saw him fucking my sister.\n\nI broke it off, tears were shed, he moved out, etc. My sister apologized at first but then backed off. I thought she was giving me space but last week she called and asked if we could meet up. She told me that she and Ben were in love and were just telling me as a courtesy before they started posting photos online. Distraught,  I left her in the restaurant by herself and did not pay my portion of the bill. She later venmo'ed me asking for the money.\n\nShe told my parents who then called me to their house, telling me how disappointed in me they are for not supporting my sister's relationship with Ben. They brought up the fact that because she had cancer as a teenager, she never learned proper social etiquette, and has a hard time meeting people. I don't buy this, in part because I've seen her socialize just fine and since we spent a good chunk of the time she was sick together, that would also mean that I should have bad social skills as well, by that logic. They then told me that if I don't accept my sister and Ben's relationship, they may have to go no contact with me. I reminded them that I'm also their daughter and they should understand my point of view, but they are adamant that this is about me being jealous of her.\n\nFor the record: I'm not jealous of her. I'm not upset that Ben picked her over me. I'm sad about the end of the relationship and do feel betrayed, but lord knows that I don't want to be with a cheater. What I'm upset about is the fact that my sister chose Ben over me. That she slept with Ben knowing he and I were in a long-term, committed relationship, and continues to be with him knowing how much it hurts me.\n\nNow no one in my immediate family is talking to me and I'm getting messages from aunts and uncles and cousins telling me that I'm an asshole and a selfish bitch.\n\n​\n\n​\n\nEdit: Thank you everyone so much for your comments. This has gotten more attention than I expected and am having trouble keeping up, so if I don't say thank you, then thank you. I've been given a lot of food for thought. TBH, while I've had moments where I've been resentful or upset about my teenage years, I've always thought that I did the right thing for my sister and for my family. And that time wasn't all miserable; I was very close to my sister and we made things as fun as we could. But I didn't think of it as an abdication of my parent's responsibilities or that they were doing wrong by me, which many of you pointed out. I definitely have a lot to think about.\n\nThank you again for making me feel less crazy about all of this!\n\n​\n\n​\n\nUPDATE: Sometimes you can only laugh. Just got off of the phone with my cousin who saw this post and said he could explain a few things. I asked him why he was on Reddit instead of school, he asked me why I was on Reddit instead of work, and I said touché. He told me that after my conversation with my mom, she went to his house and talked to my aunt. And here's the deal:\n\nTurns out my sister is not only in a relationship with Ben but FOUR MONTHS PREGNANT. Which means she and Ben were fucking for longer than I had even guessed. Apparently my parents are so adamant that I forgive her because I'm already ruining their experience of their first grandchild. That's right, I'm less important than my stepmom posting ultrasounds to Facebook. This is where we're at.\n\nAnyhow, I called out of work sick the rest of the day and am going to drink a lot of alcohol. Like, a lot of alcohol. And then start thinking about what the fuck I'm going to do.\n",
    "postAuthor": "Lost_Papaya9278",
    "postTitle": "AITA for not accepting my sister's relationship with my ex despite her having cancer as a teenager?"
}