{
    "postText": "I'm a father of a 16 years old daughter. I own a one bathroom middle sized house where me, my wife, her widow sister and her two kids (13/16) live. My daughter had issues with her mother and requested to live with me permanently. I had the legal stuff finalized and my daughter moved in with us a month ago. She and her step mom get along. So far everything was going well.\n\nMy daughter had her period days ago. Nothing new, nothing strange except, my SIL came to me complaining about my daughter leaving used pads in the bathroom causing her sons to see them. I asked where exactly and she said in the trashcan. I laughed in her face asking if she thought this was abnormal or strange. She got upset that I didn't understand her point and wanted me to listen carefully as she explained that her boys are pretty young and shouldn't be subjected to witness stuff like that. I said I'll see what I can do. I talked to my daughter and made sure she wasn't just leaving her used pads in full display inside the trashcan. Turns out she wraps them in toilet paper which is enough in my opinion. I told my SIL there was no problem then and she should quit being too sensitive over her boys. She got mad saying I was dismissing her concerns and reminded me her oldest has blood pohobia and my daughter, even though doing it unintentionally, keeps leaving her pads exposed. I welcomed any ideas to fix this and she suggested my daughter throw her used pads outside the house. I stopped arguing at the point because of how ridiculous she was being. She threatened to change the bathroom door lock if I don't do something but I laughed her off.\n\nMy daughter called me the next day after getting back from school saying her step aunt refused to let her use the bathroom and was keeping it locked. She had to used her new friend's (neighbor) bathroom but called to let me know. I was fucking livid I went home and blkew up at my SIL. She apologetically said the lock was only for when my daughter tries to leave her pads inside and she would've allowed her if she agreed to put her used pads elsewhere but my daughter was stubborn. I told her she was out of her mind to get a new lock for my door in my own house and keep my daughter from accessing the bathroom. I removed it quickly and she kept lashing then called my wife. My wife came to calm us down but I told her and SIL that I have no problem kicking her out. My SIL started crying my wife said her sister is a widow and will be homeless without us I said I stopped giving a shit the minute she tried to keep my daughter out the bathroom. I demanded she leaves but my wife said I was unfair to those kids. I bluntly said not my problem she has 6 days to move out.\n",
    "postAuthor": "Saturday-Night1139",
    "postTitle": "AITA - For demanding my widow SIL and her kids to leave after she put a lock on the bathroom door and denied my daughter access to it?"
}