{
    "postText": "My brother (17M) lives with me (25F) and my husband (26M) full since both our parents passed away in an accident last Feb. He's a great kid, but losing our parents made him a quiet, sad young boy. I've tried to encourage him to attend therapy so he can work on his grief, but he has refused every single time telling me that he's not ready yet. I get it, everyone works at their own peace and as longs as he's not deliberately hurting himself, I won't pressure him. I try to be as involve in his life as I can be without it being overwhelming, we both enjoy movie nights or binge watch shows on the weekends and he also helps my husband with his old car.\n\nBefore our parents passing my brother had a gf (16), she seemed like a good kid too, but after the funeral my brother decided that being in a relationship wasn't what he needed at that time and broke up with her. Totally valid. But she didn't take it good and was sure that my brother only needed ''some love'' to heal.\n\nLast month she began to drop letters and gifts to our door and my brother refused to open them every single time, she used to message and call him too and I could see the distress on my brother's face. The worst thing happened last friday, it was my brother's birthday and my husband and I decided to take him out, when we got back he went to his room and as soon as he did it, eh came down running.\n\nNow, his ex found her own way into my house, arranged his room with photos of him with her, their friends and our family, put some balloons and was waiting for him with a cake, mind you, this is creepy as fuck, so while my husband entertained her I called the police and they took her for trespassing private property. My brother is thankful, but my husband and the kid's parents are sure I'm overreacting and that I should drop the charges because she's trying to do something nice.\n\nLittle update: I just talked to my brother and we agreed on getting a restraining order no matter what, he'll be switching rooms since he told me that he can't sleep there anymore, our guest room is a bit smaller bus he says that he doesn't care! That's it for now, he hasn't said anything about therapy or dropping the charges.\n",
    "postAuthor": "ThrowRA_danglovesick",
    "postTitle": "AITA for refusing to drop charges against a 16 yo?"
}