{
    "postText": "My family are hardcore Christians and my brother Ross and I had always been on bad terms. It extended to our adulthood and I stooped talking to him after he mistreated my fiance Adam and I uninvited him to our wedding.\n\nAdam and I got engaged in 2019. We set a date for our wedding which's on Oct 9. Tim announced his girlfriend was pregnant days ago and our parents went crazy and demanded they get married next month. Tim agreed under the condition that he choose which day the wedding will be. My parents agreed even though they're funding the entire thing. I got a call from my uncle saying Tim is getting married on Oct 9. I was shocked because this date is my wedding date. I knew he did it deliberately after I uninvited him from my wedding and I had no intentions on attending his but I went to see what the deal was. Adam refused to meet me at my parents house saying \"you take care of it and get back to me\".\n\nI found most my family there including Tim and his girlfriend. I brought up the date and asked who chose it. Tim's girlfriend lied saying my parents did but my dad pointed saying Tim did. I asked Tim why he chose the date to be the exact same date as my wedding. he made a face and said to him this is a free day since he never planned on attending my wedding so he thought that date fits. I explained I worked for 2 years to be able to afford inviting and including everyone and that I chose this date first and want my whole family there. He shrugged saying it's not his problem if people choose to attend his wedding over mine. I spoke to mom and she said I needed to move the date since Tim has to get married fast as he's girlfriend is in her 3rd month and they have no time. I explained how much I'll lose since I already paid for the venue, invitations with original dates and spent money on menu/flowers/\n\nI pointed out that Tim chose this date to spite me and to divid the family and suggested they change his wedding date since they are having it at their house and paying for everything. Mom said she can't since they wanted the wedding on Oct and Tim and his girlfriend find it fair to choose the day. Tim said I should quit making this a competition of who gets married first but I said this wasn't the case and I just wanted all my family at my wedding. Mom said \"if you want the whole family at your wedding then you'll agree to move the date, you waited 2 years can't you wait a little longer?\". My aunt agreed but I thought it's illogical to expect me to move my wedding date and then threaten to not come if I don't.  I got into a fight with Tim and left.\n\nMy parents said if I want them at my wedding I should postpone the date and shouldn't blame them for not attending if I stick to my original date.\n",
    "postAuthor": "Date2021_Oct",
    "postTitle": "AITA for refusing to move my wedding date because my brother's getting married the same day?"
}