{
    "postText": "My husband travels for work every few months. He's irresponsible with time and counts on others to do stuff for him using the \"I'm tired\" excuse. He's the breadwinner by the way!.\n\nHe had a business trip and the day of the trip he saw me carrying the laundry basket and said \"hey can you pack my bag?\" I asked why he didn't do it the night before and he said he was up all night playing fortnite. I asked why can't he pack now and he replied \"I gotta go catch up with the boys before I leave the country\". I said no and that he should do it himself. He asked why not and I told him that I had to do the laundry then cook for the kids then help them with homework then wash the rugs then clean the messy bathroom then the playing room then work on my garden project. He stood there with his eyebrow lifted up as I went on. I suggested he stays home, pack his own bag and help around til it was time for his trip. He didn't like my suggestion and complained about missing the boys and wanting to see them one last time and say goodbye before he leaves. He begged but I said no. He then suddenly went inside the bedroom (I thought he was packing*??), grabbed his phone, keys and jacket and rushed out. I just went about my day.\n\nIt was 5 o'clock and he hadn't returned yet. I was concerned thinking he had little time and still hadn't packed yet.\nHe returned home at 6 walked into the bedroom and started panicking asking why his bag wasn't packed and ready yet. I told him he should ask himself since he stayed gone for hours. He said he was counting on me to pack his bag and even sent me a text hoping I'd eventually do it. I didn't see the text and even if I did. I never agreed so he shouldn't have assumed I was going to pack his bag for him. He got upset and started packing. his stuff was all over the place and he couldn't even find his papers. He was finally done and left.\n\nI then got an angry call from him asking if I was happy. I said why what happened and he said he missed his flight...just like \"I wanted\". He came home and lost it saying I cost him his business trip which supposed to earn him money and made him look unreliable/unprofessional and compromised his work after I refused to do him this small favor and pack his Goddamn bag. I responded that he shouldn't have hung out with his buddies literally hours before his flight but he said he believed this was done spitefully to get him to sit home with me. I was shocked. No words just shocked face. He called his friend saying his trip didn't happen..then turned to me and said thanks to ME then proceeded to ask where they were going to meet for dinner.\n\nHe told me \"no trip meaning I'll be home for the next couple of weeks, isn't that what you wanted?, Great we'll both now stay home and wallow in misery, God bless!\" Then walked out.\n\nAITA? He said I just caused him issues at work. Should I have packed his bag anyway?.\n\n\nwhy he couldn't be on the next flight?.\n\n\nBecause since he missed his flight that the company was paying  for, he was required to pay for the other flight or not go. He refused to pay saying it wasn't his fault anyway and decided to not go.\n",
    "postAuthor": "LydiaBlue____",
    "postTitle": "AITA for causing my husband to miss his trip by not packing his bag despite him repeatedly asking?"
}