{
    "postText": "Hi there, sorry for the shit grammar. English is my first language I just suck at it.\n\nMy(28F) brother Mike (33M) was married to Lisa (31F) for 4 years until last year when he was caught cheating with Penny(29F).\n\nMy ex-SIL was reserved, sweet and was straight edge (no alcohol/drugs). Mike loves to party and went to court ordered rehab before he was even 21. When Mike met Lisa he sobered up, got an apprenticeship and really turned his life around.  He also threw that all away on Penny. Penny knew he was married, she got him shit faced and that is how the affair started. Penny is loud, disgusting, obnoxious and encourages my brother to drink, he thinks she is just soooo fun and 'the life of the party'.\n\nWe were at a family party this past weekend and Mike and Penny were there. Some cousins we hadn't seen in years were there and were introduced to Penny. Mike introduced her as his \"upgrade\". Cue major side eye from me, my brother noticed and pulled me aside later.\n\nHe asked why the attitude-Penny was clearly an 'upgrade'.  I asked him to explain that comment, She's blonde, curvy and fun whereas Lisa \"looked like a librarian with no tits\". I decided to clear things up for him. Penny is obnoxious, rude, slovenly, her hair is poorly bleached and she smells like fungus.  No one looks at her like a prize to be won. No one is jealous of him (which he thinks they are? His best friend won't even talk to him any more because Penny made a dead baby joke to his wife after a miscarriage)\n\nI let him know that he actually chose alcohol over his ex, Penny just encouraged him to do it because she had a crush on him for years.\n\nHe called me a bitch, I told him \"samesies\".\n\nPretty sure I am the asshole on this one tbh\n\nEdit.  Pretty disappointed with myself for going after her looks though-felt very immature after the fact. Going to just silently judge my brothers choices  from afar from now on (and to those saying I need to accept my brothers partner...lol no I don't)? I just won't be involved. I really did love my SIL and I really don't like how she was treated. And to those who followed me, lol why? \n",
    "postAuthor": "nouchooseausername6",
    "postTitle": "AITA for telling my brother he downgraded?"
}