{
    "postText": "So i am 37 weeks pregnant. Due to several health complications during my pregnancy ive been told multiple times, by multiple doctors, that i might have to give birth next week as supposed to two weeks from now. Furthermore that i may actually go into labor this weekend or anytime leading up to it. Due to these same health complications im having a c-section and my doctors do not want me laboring. So should i go into labor they are most likely pushing me through as an emergency c-section.\n\nMy husband knows all of this. However he is holding on to the 2% chance they gave him that the baby could last the two weeks. His sister is also pregnant (4 weeks behind me) and her baby shower is this weekend. It will be over an hour away and that’s without traffic. So weeks ago I declined for both of us because it didn’t seem like a good idea. Well despite having a long conversation the shower (2 days away) has come up again. It turned into a fight as there are multiple reasons that should i go into labor it’s just a bad situation for him to be that far away (i would list them all but character limit).\n\nHusband wants to go and support his sister and see his family. And says im keeping him on a short lease for something that probably isn’t going to happen.\n\nI told him maybe he’s right and nothing happens. But said should he CHOOSE to go and CHOOSE to take that risk. That should i go into labor he would most likely miss the birth or be extremely late. And if he makes that choice then i would give the baby my last name (my maiden name) vs his family name. \n\nHusband said i was an AH for keeping him hostage and im always planning for worse case. And that my thoughts are going to trigger labor more than anything. I said if he chooses to not be apart of this (should i go into labor) why should the baby bare his name when he would fail on his duty as a father.\n\nHe has been silent and moody since. Only talking when absolutely necessary and saying that im trying to take everything from him.\n\nSo AITA?\n\nEdit: okay so this blew up! Im trying to get through everything. I hear y’all on the red flags. And also the feedback on my own behavior in this.\n\nUpdate: had a long doctors appointment. Husband will not be going to the shower as not only has it been confirmed I HAVE to deliver next week, but i have also been put on bedrest. So that made the decision for him. \n\nHe did apologize. We had to have a long conversation. His mother was pressuring a ton of this and guilt tripping him, primarily about coming down to the shower to see his grandma. Who is very old and it’s constantly a question as to how long she has. But we had a long conversation to which it became clear we need to be LC with MIL for the time being. She has been starting other drama lately and this was my breaking point.\n",
    "postAuthor": "Possiblethrowaway81",
    "postTitle": "AITA for telling my husband i’ll use my maiden name for our baby if he misses the birth?"
}