{
    "question": "What is something you did once and never again?",
    "questionAuthor": "u/CameToDefeatYou",
    "arrayAnswer": [
        {
            "commentText": "Tried to intervene during a street fight. Got shot for my troubles.\n",
            "commentAuthor": "u/Matts3sons",
            "commentReplies": [
                {
                    "commentText": "Bless us with more story, friend. Were you out getting a coffee? Walking your gator? Where were you shot? Glad you're here to write any of this stuff in the first place.",
                    "commentAuthor": "u/TheCantrip",
                    "commentReplies": []
                },
                {
                    "commentText": "Was at the bar with my ex wife. Two regulars(one of which I considered a friend) started arguing. My friend went outside to go home and end the problem. Asshat decides hes gonna continue the fight in the parking lot. There was a group of us that followed and when he went to pull A gun my drunk ass thought it would be a good idea to step in and try to stop it all. Fucker shot at me three times. One of then hit my leg.",
                    "commentAuthor": "u/Matts3sons",
                    "commentReplies": []
                },
                {
                    "commentText": "To be fair, it sounds like you might have saved your friend's life.",
                    "commentAuthor": "u/DoomsdayRabbit",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Went to Times Square for New Years Eve in New York City. I live in NYC and I figured it was the kinda thing I wanted to see but didn’t need to see again. Went in 2000 when I was 18. Got there 11am and stayed for 13 hours in the freezing cold but with close spots to the ball drop and screen. I’m glad I did it. I’m also glad I’ve never done it again.\n\nEdit: Thanks for the awards. Cool seeing others who had a similar experience or who were there that day themselves or even at the exact same age. Got more karma and awards then I’ve gotten in 4 years and it actually kinda made my day so thanks again.\n",
            "commentAuthor": "u/dubbznyc",
            "commentReplies": [
                {
                    "commentText": "i used to live right next to where the ball would drop so i would go out on the fire escape and watch it from there every year, got some booing from the crowd but it was nice to see the event, wouldn’t go out of my way to see it again though",
                    "commentAuthor": "u/weebtrash100",
                    "commentReplies": []
                },
                {
                    "commentText": "They boo'd you for being able to watch it from the fire escape? People are stupid man wth",
                    "commentAuthor": "u/kiwidog8",
                    "commentReplies": []
                },
                {
                    "commentText": "Maybe it's just because I'm British and taking the piss is part of our DNA, but that sounds hilarious. You boo them, but not seriously, more like \"Look at this cunt with his free vantage point\"Then they do a wanker sign back at the crowd and everyone has a laugh. Just good hearted banter.",
                    "commentAuthor": "u/Model_Maj_General",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Ran out of toilet paper when i was 11, saw alcohol wipe cloths and thought that would work just fine... nope, as soon as I did that first wipe it was as if the sun teleported into my asshole and i was hopping around the bathroom trying not to squeal. Mom opened the door to check on the noise and saw me jumping around with an alcohol pad between my cheeks. \n\nKeep alcohol away from your anus.\n",
            "commentAuthor": "u/Radatouy",
            "commentReplies": [
                {
                    "commentText": "Well that's not something you hear every day.",
                    "commentAuthor": "u/Insert_Bad_Joke",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Omg, this reminds me of my nephew.   I heard from my sister that thier Clorox wipes disappeared and they found them in nephew's bathroom.  He was using them for a week to wipe!   Omg, the family had a good laugh at that, his dad was telling me secretly \" Man, I'm kinda proud at how much he can take, cuz that couldn't feel good\".",
                    "commentAuthor": "u/cgoodsky",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "A marathon in the desert.\n\nEdit: i just woke up in my time zone and BOOM this exploded. thank you for the awards and the upvotes I'm gonna try and reply as much as possible.\n",
            "commentAuthor": "u/yettidiareah",
            "commentReplies": [
                {
                    "commentText": "Do you try to find new ways to die every day?",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "Well I'm an epileptic with brain cancer who still cooks.",
                    "commentAuthor": "u/yettidiareah",
                    "commentReplies": []
                },
                {
                    "commentText": "Man I ask the dumbest shit sometimes. I’m sorry. Good on you for being active though. Some of the best self help is remaining active even with said conditions.",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Bought a $20 lottery ticket. \n\nLost $20.\n\nNever again.\n",
            "commentAuthor": "u/sugarhighsince2015",
            "commentReplies": [
                {
                    "commentText": "Used to travel a lot for work and my team decided they wanted to hit a casino on the way back home.  So I figured I'd hit the penny slots. I only had a couple of dollars to burn, so I wanted to make it last.   In 200 spins, I didn't win even a tiny amount a single time.At least with a lottery ticket you get the enjoyment of sitting back and imagining what you'd do with the money if you won!  I might as well have just dropped a few rolls of pennies down a storm drain.",
                    "commentAuthor": "u/ppardee",
                    "commentReplies": []
                },
                {
                    "commentText": "I hit a penny slot once with 20p, won approximately £70. I haven't hit a slot machine since, right now I'm beating the gambling company!",
                    "commentAuthor": "u/TheSmallclanger",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I stole a tester eyeliner from the makeup section at a store when I was 17. The security guy took me aside in a small room and \"questioned\" me, asked for my information, and to scare me, he said this would always be in my record and companies won't want to hire me anymore and I burst into tears and had a panic attack. He said he'll let me off if I pay double the price of the eyeliner, so I did and he let me go.\n\nNow, I don't know how much of what he told me was real and if the resolve was legitimate, but if he tried to just scare me into not becoming a serial swiper, it worked.\n",
            "commentAuthor": "u/Te-hole",
            "commentReplies": [
                {
                    "commentText": "Pretty sure he just pocketed the cash after.",
                    "commentAuthor": "u/Loverboy21",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah. That’s definitely a shakedown lol",
                    "commentAuthor": "u/AyeMyHippie",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Grabbed the hot grill as a 5 year old. Learned my lesson.\n\nEDIT: Wow, this blew up overnight! Thanks for the awards! And sorry to everyone injuring themselves!\n",
            "commentAuthor": "u/Red_Christmas_Lights",
            "commentReplies": [
                {
                    "commentText": "As a naive yet curious kids kid, I didn't know what the razor in the bathroom was for and decided to test it out my rubbing it over my thumb with the shower running. Despite being just a cut, here was so much blood coming out it was like a murder scene. My mom made me a cute little thumb cast to wear for a few days and explained it too me afterwards though\n.\nEDIT: Man, I didn't think this would explode over night with upvotes and my first ever award. Thanks y'all! Nice to know everyone was a stupid kid at some point and I wasn't alone! XD",
                    "commentAuthor": "u/Gamer-Logic",
                    "commentReplies": []
                },
                {
                    "commentText": "Actually I was not paying attention and fucked up my thumb big time on a razor, didn’t hurt that bad, but it went down like 3 layers of skin, shit bled a fuck tone, and honestly the worst part is that because i had killed so much skin, the fucking smell sometimes if dead skin that was still to attached to pull off, not fucking good bro, wore a bandage ( changed it regularly of course) on my thumb for like a week because occasionally it would bleed a bit",
                    "commentAuthor": "u/Big_Priority_9329",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Removing paint from a table. I still need to finish sanding the thing but that was a nightmare, who paints a table with like 30 coats??\n\nEdit: Used Citristrip Safer Paint Remover, then scraped the flat surfaces with a scraper, then used steel wool on the other parts, rinsing the chunks of paint off in between as it gunked up the steel wool real quick. Then repeated the process a few weeks later, then used a belt sander on the flat surfaces, now just need to hand sand the other surfaces.... It's like you want to quit but you are too invested at that point.\n",
            "commentAuthor": "u/Dtoodle",
            "commentReplies": [
                {
                    "commentText": "29 different owners",
                    "commentAuthor": "u/StillAsTheSnowFalls",
                    "commentReplies": []
                },
                {
                    "commentText": "All of whom were smart enough to just paint over the last one rather than spend a week sanding off the 28 coats before them",
                    "commentAuthor": "u/HandyMan131",
                    "commentReplies": []
                },
                {
                    "commentText": "But how else do you get a \"reclaimed\" wooden table?",
                    "commentAuthor": "u/LivingAgency8",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Cocaine. I remember feeling alive, feeling like myself for the first time, feeling like I was bursting at the seams with creative ideas... I was finally the person I wished I was, as creative as I wished I was, and as motivated as I wished I was. I felt like I had found the secret holy grail of success and happiness.\n\nThen I thought \"oh... Fuck. This is why people get addicted to it.\" so I vowed not to do it again and went back to being depressed and unmotivated.\n",
            "commentAuthor": "u/DILF_MANSERVICE",
            "commentReplies": [
                {
                    "commentText": "A friend of mine in college did some cocaine, and sat down and wrote a poem. He actually got it published.  He never did cocaine again. He never wrote anything for publication ever again. He was fine with both of those things.Edit. People keep asking questions about the poem and so on.  This was over thirty years ago.  I have no idea.",
                    "commentAuthor": "u/fd1Jeff",
                    "commentReplies": []
                },
                {
                    "commentText": "Man, some people just have so much more self restraint than I do",
                    "commentAuthor": "u/SenatorFuck",
                    "commentReplies": []
                },
                {
                    "commentText": "Right? I did coke and I too felt alive, and happy, and creative and like I finally had the energy to do everything I wanted to do..So I did! I did lots of cocaine and became addicted LOL I'm clean now but I don't get how anyone can resist it",
                    "commentAuthor": "u/RusticTroglodyte",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "When i was 14, i accidentally mistook bike chain lube for sex lube. At first, i wondered why it was blue, but that thought was almost immediately overpowered by an intense burning sensation.\n",
            "commentAuthor": "u/youjustgotzinged",
            "commentReplies": [
                {
                    "commentText": "yikes 😂",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "Bikes",
                    "commentAuthor": "u/FuzzyPossession2",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Spelunking / cave exploring.  For starters, it begins and ends with going through a million bats.  And the journey in between is just too dangerous, in the last place in the world you'd want to get hurt.  And super tight squeezes are freaky.\n",
            "commentAuthor": "u/Scrappy_Larue",
            "commentReplies": [
                {
                    "commentText": "the story of the guy who got stuck upside down in the Nutty Putty cave system will have me never ever getting into spelunking. his body is still stuck there because it was too unsafe and difficult to get him out. it’s so disturbing and sad.",
                    "commentAuthor": "u/censorkip",
                    "commentReplies": []
                },
                {
                    "commentText": "Every single time cave exploration or spelunking is mentioned on Reddit, the Nutty Putty cave gets mentioned. And for good reason. Hard pass. Not a fan of being eaten by the planet.",
                    "commentAuthor": "u/aarondigruccio",
                    "commentReplies": []
                },
                {
                    "commentText": "No matter how you go, you will eventually be eaten by the planet, in one way or another",
                    "commentAuthor": "u/idothingsheren",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Sky dive.  Nope- didn’t help with my fear of heights\n",
            "commentAuthor": "u/Whiskypirate61",
            "commentReplies": [
                {
                    "commentText": "I just went to an open sea scuba diving course. We had a woman that was with us that was afraid of the ocean, and being submerged in water. She said this is what she wanted to do to get over her fear. She got in the gear, got to the end of the boat, jumped in, then immediately and calmly said, “get me back on the boat”.  Back on the boat, cool as a cucumber she took off her gear and was like “nope, not doing it, top 3 scariest moments of my life right there” she grabbed a water and a power bar and calmly waited for the course to finish and for the boat to take us all back. Respect to her.",
                    "commentAuthor": "u/Cereal_Poster-",
                    "commentReplies": []
                },
                {
                    "commentText": "Always nice to see a person confront their limits and then respect them",
                    "commentAuthor": "u/GameShill",
                    "commentReplies": []
                },
                {
                    "commentText": "\"I can do this, I can do this, it's just water I'll be fine\"\"Fuck\"",
                    "commentAuthor": "u/kierantheking",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Asume the green stuff on the sushi tray was avocado...\n",
            "commentAuthor": "u/Cat-aclism",
            "commentReplies": [
                {
                    "commentText": "I’m sure several first time sushi eaters thought the same. I know I did.",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "This is hilarious and also, im sorry.",
                    "commentAuthor": "u/Hallucinature",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Stayed at a bed and breakfast. I’m not social enough to socialize with people during breakfast.\n",
            "commentAuthor": "u/AllDressedKetchup",
            "commentReplies": [
                {
                    "commentText": "Same.  Came downstairs at 9:15 because they said breakfast was served until 9:30.  The owner said, \"there you are!\" and showed me to a table with a little card that said Mrs. Whinecube (in fancy script) and then proceeded to scold me that all the other guests were already done eating.  Never. Again.",
                    "commentAuthor": "u/whinecube",
                    "commentReplies": []
                },
                {
                    "commentText": "I've never stayed at a B&B and after reading this I don't think I want to.",
                    "commentAuthor": "u/Sgt_Smitty",
                    "commentReplies": []
                },
                {
                    "commentText": "They can actually be quite charming, and for many of the ones I've stayed at on road trips where we don't have time to stay for breakfast they often surprise us with delicious breakfast and coffee to go.Good ones won't belittle you for skipping breakfast, they'll still try and make you feel taken care of.",
                    "commentAuthor": "u/vilos5099",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Carolina Reaper infused gummy bear. I almost called for an ambulance. Legitimately thought I was going to die covered in sweat, shit and vomit.\n",
            "commentAuthor": "u/Sure-Iwillbethatguy",
            "commentReplies": [
                {
                    "commentText": "Take us through the timeline here. Was the mass exodus of bodily fluids instantaneous or delayed over time?",
                    "commentAuthor": "u/toklea",
                    "commentReplies": []
                },
                {
                    "commentText": "The moment it hit my tongue I knew I was in deep. It was extremely hot and nothing relieved it. I was sweating from every skin cell. My ears were sweating. My soul was sweating. I had to chew it very quickly but once I swallowed it the real fear set in. As soon as it was down I realized there was only one of two ways it was coming back out and I chose poorly. If you've never felt your body digest something in real-time it is a little unnerving. I could physically feel it travel to my stomach. Once there everything was kind of a blur. Side note: do NOT pound water to relieve the heat because you will turn into a geyser of Carolina Reaper water from your mouth and nose. I staggered to the restroom on the verge of tears, not because it was so hot but because I knew I made a big fucking mistake. My body temp was so high I was stripping clothes off me as I made it to the stall. Mind you, I was at work. So there was this pile of clothes like someone struck down a Jedi outside of the stall. I have to wear boots with my work clothes so there I am sweating like a warthog weeping, shitting and moaning on the toilet in nothing but socks and boots. I was delirious. Time lost all meaning. I was hearing colors. Seeing sounds. I was leaning on all the walls soaking them with sweat and fear. I was so sweaty I slid around the seat smearing shit all over my ass cheeks and the seat making it even more slippery. At the peak of vomiting through my legs and crapping and sliding around in a mixture of sweat, shit and shame I was preparing to scream for someone  to call 911 and it just...stopped. Like my body was just shutting down nerve endings because it knew my time was up. I started to cool down. Eventually all my body fluids stopped coming out. I composed myself, washed my ass out in the sink (like a fucking animal) and went to lay down. Some Tums really helped me recover but holy shit was that an experience. It was almost cathartic like a near death experience. If I'm ever in that position again I would make myself puke to keep it from digesting.Edit: wordsEdit \"Number 2\": In true Reddit fashion my top anything is about me puking and pooping...Edit 3: Thank you all for the gifts! I'm glad a lot of you found the humor in this as I did once it was over haha.Edit 4: Yup, once I get some time I'll fill in some more details and answer some questions.Let's set the stage. Middle of COVID lock downs. There are 60 \"employees\" tops where I worked at the time. About 40 of them were actually the hands on workers. To mitigate the chances of killing the no-fail job we had to perform (job was needed done every other day) we split our workers into two teams. This way if one teammate popped hot we could still get it done with that team on quarantine. Those two teams were then split into two shifts (12 hours a piece). So at max with appointments and such we had about 7 people a shift including myself.  On the off days we were required to show face, knock out any administrative tasks, sanitize the  work space and leave. This was one of those days. My office was separated from the rest of my guys (I was the lead). So, bored, I walked down the hall to see what they were up too. Making sure they weren't just dicking around. They were watching TV and doing admin work. I see a black bag that looked like a beef jerky bag on the community table, pick it up and look inside. I see a single gummy bear. I like gummy bears. I pull the thing out and thought 'This is an odd gummy bear...why is it so sticky and gooey?'. Curious, I ask one of the guys in there what it was. \"Just a gummy bear...a natural one so it's made with, like, real fruit and stuff\". Ah, explains the sticky. I scoff at these new age 'natural' gummy bears and put it back in the bag. Buddy says, \"Whoa dude...you touched it, you gotta eat it. COVID bro.\" That's when I noticed the other folks in there were no longer watching the TV. They are all looking at me. Immediately my Peter-tingle goes off. \"Alright, what's up with this gummy\". Guy says, in a painfully obvious attempt at a straight face, \"It's a fancy gummy, spicy and all that\". I ask how hot. \"Like an extra spicy jalapeño\". I shrug and pop it in. How bad can it be right? Wrong. Game-fucking-over. Yahtzee. \"Hahahahaha! It's Carolina Reap- DON'T SPIT IT OUT! HAHAHAHA YOU GOTTA EAT IT!\"At that point my legacy was at stake. I had cultivated a bit of a Father figure role for the young guys. I couldn't spit it out...I felt (foolishly) obligated to eat it...be a man. I chew. I swallow. Immediately start sweating but I tried to play it cool. \"Wooooooah yeah its hot! Hahaha you got me you fucks. Now I'll make you stay longer! Hahahahaha I'm just kidding. We'll be leaving soon ya rascals\" (paraphrasing, can't entirely be sure it came out that coherently because it felt like I swallowed a charcoal briquette at this point).Walked back to my office and started pounding the water and the rest is as explained earlier.Now for washing my ass in the sink...I've now barricaded my self in my office crawling around on all fours drooling and regretting everything ever. I finally am able to get to the toilet because the show was about to hit the fucking road and I didn't want to ruin the carpet. I'm stripping as I'm walking (maybe 6 feet from my office to the bathroom door). I get in, lock it, finish stripping and blammo I'm juicing like an orange. Fast forward to the breakthrough and I'm trying to figure out how I'm gonna get cleaned up and get home maintaining any dignity I have. I hear a knock and a voice asks if they were good to go home \"YEAH SOUNDS GREAT! SEE YOU IN TWO DAYS MAN THAT GUMMY BEAR WAS SOMETHING ELSE HAHAHAHA DON'TWORRYABOUTLOCKINGTHEDOORSILLGETITHAHAHhahahahaaaaaa...\"So now I'm alone and was able to clean my ass (and no I didn't submerge my burny butthole in the sink water I laddled it by hand onto my ass cheeks), clean up after myself, eat twice the recommended dose of Tums, change into my gym clothes and go home with no one around to see me. Tell the wife and being the loving supporting person she is says, \"You're an idiot. Do you know embarrassing it would have been for you to go the hospital, during COVID lock down, because you ate...a gummy bear?\".Coworkers get a biiiiiig laugh outta me almost dying but it was all in good fun. Also, I get it. It's not the hottest of all time anymore and there are some of you that apparently eat Carolina Reapers with your cereal and cut it and do lines with it but it messed me up. It's crazy right? Humans react differently than each other when introduced to a severe chemical reaction. Fuck me for being a wimp I guess. Lastly, to be fair, offer me enough money and I'd jam one up each nostril while eating another for the right price. $1M outta do it.",
                    "commentAuthor": "u/Sure-Iwillbethatguy",
                    "commentReplies": []
                },
                {
                    "commentText": "Dude. You have my respect and admiration for surviving that in a god damn workplace bathroom.EDIT: please accept a Buff Doge for your troubles.",
                    "commentAuthor": "u/toklea",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "One time (I was aroung 12 or 13?)  I suddenly took interest on my sharpener, since my pinky finger was small enough I decided why don't I sharpen my finger? Like why the fuck not?? So I plunged it in and twisted (hard). Took nearly a week to heal.\n\nOne of the most stupidest things I ever done\n",
            "commentAuthor": "u/Human-Finding-6887",
            "commentReplies": [
                {
                    "commentText": "I did this as a kid too, it’s like some sort of whack childhood intrusive thought that you actually act on.",
                    "commentAuthor": "u/squidwardeho",
                    "commentReplies": []
                },
                {
                    "commentText": "I did it with a stapler as a kid. At least that only left 2 small holes since my finger was too thick to cause the staples to bend around like they do on paper.But it's weird. I didn't even understand exactly why I did it, it just came to me while I was looking at it.",
                    "commentAuthor": "u/Explosivo666",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Salvia. I experimented with lots of drugs, and especially psychedelics when I was younger but man… Take the most intense part of an acid trip but without any lead up to ease you in. So you go from stone cold sober to tripping balls in seconds. The trip only lasts for 5 minutes but you spend the next couple of hours playing catch-up with your brain trying to make sense of things. And you’d better make sure you’re with people you trust because I could have easily walked right off my balcony without thinking twice about it.\n",
            "commentAuthor": "u/Rustrobot",
            "commentReplies": [
                {
                    "commentText": "For anyone who is thinking \"I can handle 5 minutes of a potentially bad trip...\"  those 5 mins can seem like an eternity and depending on the dosage, the concept of time might completely go out the window",
                    "commentAuthor": "u/Purzeltier",
                    "commentReplies": []
                },
                {
                    "commentText": "Been there (different substance), never again. I took a large dose of LSD once after experimenting at more regular/moderate doses. The funny thing is that what triggered the start of the panic is that I had to shit but the synesthesia was overwhelming and I was starting to slip away and I was scared to death I was going to shit myself because I couldn’t differentiate between my urge to shit and all of the other weird  sensations. Ended up panicking and interpreting ego death as literal death.. basically watched my body rot into nothing. Last thing I remember thinking was “well, guess I can never come back” as all semblance of conventional reality fell apart. I had no idea what was going on, that I was on drugs, who or what I was, or anything else. Time lost its meaning, space lost its meaning, language lost its meaning, and although I can describe it as though it happened to me there wasn’t really a “me”, just the experience itself. I don’t really remember much after that point except bright, bright light and pure bliss. Was absolutely divine once I got to that point. Not doing it again though.",
                    "commentAuthor": "u/lainonz",
                    "commentReplies": []
                },
                {
                    "commentText": "The real question is, did you shit your pants?",
                    "commentAuthor": "u/bitchcatsandtequila",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Spray deodorant on my arse to cover up the smell of my farting.....I was 6, once that spray hit my bullet hole, the burning began\n",
            "commentAuthor": "u/TheNorthernBaron",
            "commentReplies": [
                {
                    "commentText": "The 6 y/o logic behind your decision is honestly the funniest part.Edit: This is by far the most likes I've gotten on any post, comment, or reply. Never imagined it'd be for someone spraying deodorant up their ass, but then again I guess I shouldn't be surprised. Anyway, thanks guys!",
                    "commentAuthor": "u/xXTacocubesXx",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "This year I tried to use spray deodorant on my head to keep my scalp from sweating… I’m 26. It didn’t work, and it just made my hair grungy and water-resistant. I showered multiple times a day and it still took a week to get back to normal.",
                    "commentAuthor": "u/boxtort",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Buy cheap toilet paper. That 1 ply crap, which was a cross between either using sand paper on your crack or accidentally ripping through it and fingering your self\n",
            "commentAuthor": "u/pepsiisnotcoke",
            "commentReplies": [
                {
                    "commentText": "We call that John Wayne toilet paper. Rough, tough, and don't take shit off of anybody.",
                    "commentAuthor": "u/Fuckareyoulookinat",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Not paying attention to currents when swimming in the sea (and going anyway when there’s a red flag and no guard).\n\nDumbest shit ever. I was with my two brothers and my father, happily splashing around. Suddenly we turn around and the shore just got very far away. So we start swimming back but the sea is stronger than you. If you stop 5 seconds to catch your breath you lose the progress you did during the last minute, and that’s precious.\n\nI was young so I don’t remember it as a legit life threatening situation, but my bros and dad still got chills when talking about it\n",
            "commentAuthor": "u/DonMendelo",
            "commentReplies": [
                {
                    "commentText": "For anyone that doesn’t know, always make sure you swim parallel to the shore, not towards ithttps://scijinks.gov/rip-currents/",
                    "commentAuthor": "u/RoboRich444",
                    "commentReplies": []
                },
                {
                    "commentText": "Unfortunate that people get so scared they swim against it, get tired, and eventually drown. If they swim parallel, they would swim out of the current and be able to swim back into shore :/",
                    "commentAuthor": "u/anonymousafterall",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Climbed the stairs up the CN Tower.  It's a twice a year thing for charity.  My friends and husband were all like \"Yeah, come join us!  It's so fun!!\"\n\nNo, 249 144 flights of stairs is not fun.  I've done it once.  It's crossed off.  Never again.\n\nEdit: okay, it's \"only\" 144 flights of stairs, and 1776 steps.  Sure felt like a billion, but this post has gotten some traction and I feel guilty.\n",
            "commentAuthor": "u/Lexilogical",
            "commentReplies": [
                {
                    "commentText": "I get tired climbing stairs in Warzone sometimes. I can’t imagine this. Nope…",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "It's shockingly faster than you'd think, I think my time was 45 minutes and my husband/friends did it in 25-ish.But then, the other friend I dragged along took an hour and a half.  And then we had to dash across town for a 5k race that was ACTUALLY what I wanted to do....It was a day.  It will never be repeated.  It was bad decisions all around.",
                    "commentAuthor": "u/Lexilogical",
                    "commentReplies": []
                },
                {
                    "commentText": "Stairs and a 5k?! How is that fun? 😂 I kid. Props to you. My fatass wouldn’t make it a block.",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Cheat on a partner.. learned the hard way as a dumb teen that this is one of worst things you can do and only ever leads to everyone involved getting seriously hurt\n",
            "commentAuthor": "u/Ok-Ad-2605",
            "commentReplies": [
                {
                    "commentText": "100% the truth.",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Absolutely this. I cheated on my first girlfriend at 17, I'm 28 now and I still think about it a couple times a month and harvest some guilt.\nDon't get me wrong, I would never go back to that girlfriend as we absolutely weren't right for each other, that much is evident - but I'm yet to forgive myself for the unnecessary cruelty. I learned how not to treat women in that first relationship, I just went about learning through experience and wish so badly that I hadn't, she didn't deserve to feel like that.Karma got me real good with my fiancé that came after. Never again.",
                    "commentAuthor": "u/oovis",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Opening a link in Reddit when someone else in the comments said not to.\n",
            "commentAuthor": "u/sharkychan",
            "commentReplies": [
                {
                    "commentText": "Yup. And on one of those \"what's the most disturbing photo on the Internet\" threads that I hated myself for even venturing into. Saw two images that haunted me for weeks, and now I just avoid those sorts of threads. I'm not even going to describe them, because I'm sure they're high up already on numerous AskReddit threads like them. Just don't click it. They're not worth it. You will gain nothing from seeing those things.",
                    "commentAuthor": "u/given2fly_",
                    "commentReplies": []
                },
                {
                    "commentText": "There is still one image from my earliest Reddit days that I can't get out of my head and it was probably from /r/natureisfuckinglit or something stupid like that because it was Nature being just fucking disgusting and sad. Then I learned about adding filters, not showing NSFW pics until I want to see them, and not clicking on the links that I'm warned about. I have to curate what I show myself and that's a good thing.",
                    "commentAuthor": "u/BirdieKate58",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Meth\n",
            "commentAuthor": "u/playboy1shawty",
            "commentReplies": [
                {
                    "commentText": "Not sure if you’re Mike Tyson or not, but I hate cleaning up after people’s mess all the time too.",
                    "commentAuthor": "u/CameToDefeatYou",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Hey, me too. I was awake for a day and started seeing shadow people. Not to mention I spent the day with legitimate meth heads and meth dealers, it was pretty scary. Still remember everything even though it’s been almost 15 years, it makes me nauseous that I let myself do that. I was a raging alcoholic, so I didn’t have many inhibitions.",
                    "commentAuthor": "u/sackia",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Hiking through jungles. They look so beautiful in movies. In reality they are some of the most brutal hikes I've been on.\n\nLet's start with the humidity. It's so bad it drenches you to the bone, and there's no escaping it. Being under a jungle canopy is like being in a pressure cooker. The heat and humidity beats you down harder than any environment I've been in. \n\nThen there's the swarms of biting bugs. From never-ending mosquitoes, giant spiders on everything, ticks jumpung on you from everywhere and colonies of aggressive fire ants criss-crossing the trails, you can expect to have more bug bites than you've thought possible to survive.\n",
            "commentAuthor": "u/Ghost-Writer",
            "commentReplies": [
                {
                    "commentText": "Yeah, fuck everything about that.  I'll take my temperate forests, thanks.",
                    "commentAuthor": "u/fireduck",
                    "commentReplies": []
                },
                {
                    "commentText": "Of all the mentioned above rainforest ticks are the worst by far.They are not your friendly  regular dog ticks, these jungle cousins are as small as a grain of sand (like half a milimeter) and they love human blood, so they hop on you  when passing by tall grass or ground plants.......generally  don't biting on your arm or leg, but crawling to your most inner parts like groin, ass or armpit and \"nest\" there. You can't see them and by the time you notice is way too late.After the fuckers got their way into you, you got to clean yourself with gasoline to remove them and wait weeks for the bite to heal.Oh, and they also carry diseases.Edit: hey, this blew up and not even mentioned that I got bit in the ballsack.",
                    "commentAuthor": "u/LeylandTiger",
                    "commentReplies": []
                },
                {
                    "commentText": "FUCK ALL OF THAT.",
                    "commentAuthor": "u/EvaB999",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Put pizza wrapped in foil in the microwave when I was 10 thinking it will warm up quicker. It surely did by lighting on fire 3 seconds after I turned it on\n",
            "commentAuthor": "u/steamedpotatoezz_",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}