{
    "question": "What feels like a cult, and is in fact a cult?",
    "questionAuthor": "u/AshDarkana",
    "arrayAnswer": [
        {
            "commentText": "Scientology.\n",
            "commentAuthor": "u/-null",
            "commentReplies": [
                {
                    "commentText": "Throwaway account: My child's mother is a Scientologist. In deep. Posters, books, pamphlets, etc. Frequents church quite a lot. Believes LRH is a great man. I've tried to have convos with her (and her husband) about it but they are excruciating. It always leads to having to watch a video about it. I've been to one of the churches. It's literally an infomercial inside a building. Books for sale all over (shocking) and all written by L. Ron even though he's been dead for decades. They'll spend HOURS in an auditing session while my child sits in the lobby watching YouTube (which they don't monitor). I know way more about Scientology than I ever wanted to know and I still don't know enough. And I'm very wary about my child growing up with it as an influence.Edited to correct 'weary' to 'wary'",
                    "commentAuthor": "u/Ok_Wishbone6710",
                    "commentReplies": []
                },
                {
                    "commentText": "Obviously I don’t know your situation or country, but I dealt with my child’s father being heavy-handed with religion, to the point I had to have a family court mediator order him to limit her time in prayer (he was having her pray for 2 hours a night; they told him 1 minute for every year of age so at 6yo, 6 minutes was appropriate). Anyway my long point is if you have hesitations about your child’s religion (and I think you should be hesitant because Scientology is so divisive; they could actually alienate your child from you if you’re considered “suppressive” or some bullshit). I just want you to know you have options and rights!",
                    "commentAuthor": "u/neon-green-eyes",
                    "commentReplies": []
                },
                {
                    "commentText": "Thank you! Yeah I've def looked into it. Was not sure how much I could protect her with the whole Freedom of Religion thing. But I talk to her about it a little bit and am def keeping an eye on the situation.",
                    "commentAuthor": "u/Ok_Wishbone6710",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "All of these \"nutrition\" places with their loaded teas, are just a front for Herbalife.\n",
            "commentAuthor": "u/NO_Cheeto_in_Chief",
            "commentReplies": [
                {
                    "commentText": "Most MLMs have the cult vibe. The LuLaRich documentary talks about the major cult vibes they were using to work their \"retailers\" into a frenzy and not realize they were being conned.",
                    "commentAuthor": "u/jaydubbles",
                    "commentReplies": []
                },
                {
                    "commentText": "The LuLaRich documentary is fantastic!!",
                    "commentAuthor": "u/Neverthelilacqueen",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "MLMs but especially Mary Kay. I went to a convention once as the guest of a consultant because she was trying to get me to join. It was very stepford. Also, she didn't tell me you were expected to dress up so I showed up in jeans and a hoodie.\n",
            "commentAuthor": "u/Hollywood899",
            "commentReplies": [
                {
                    "commentText": "I watched some documentary or something about this or a similar MLM and you’re not supposed to know you’re supposed to dress up because the point is to make you feel crappy and like everyone else is “successful.”",
                    "commentAuthor": "u/ObjectiveBike8",
                    "commentReplies": []
                },
                {
                    "commentText": "Now that I know this and I ever get the chance to go I will put on underwear just for the occasion and nothing else.",
                    "commentAuthor": "u/TransformerTanooki",
                    "commentReplies": []
                },
                {
                    "commentText": "I feel like you show up in a Chanel power suit while everyone is in their Kohls and act totally disinterested. Become the queen, start your own mlm.",
                    "commentAuthor": "u/ObjectiveBike8",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Boarding schools for “troubled teens”\n",
            "commentAuthor": "u/_Tal",
            "commentReplies": [
                {
                    "commentText": "For anyone interested, check out this comic about Elan. It is insane and beyond all imagination. Kids kidnapped in their sleep, forced to stare at blank walls for months on end, beating up each other etc etc.",
                    "commentAuthor": "u/shadowstrlke",
                    "commentReplies": []
                },
                {
                    "commentText": "Can't recommend this enough. Clear your day and read this comic. You won't be able to put it down.",
                    "commentAuthor": "u/queenofthera",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "NutriBoom\n",
            "commentAuthor": "u/Stephenburnett98",
            "commentReplies": [
                {
                    "commentText": "You sound like someone who needs go raise, then lower their amino acids. You’ll feel much better",
                    "commentAuthor": "u/SAOkirito1",
                    "commentReplies": []
                },
                {
                    "commentText": "Why would you want to raise your cholesterol?",
                    "commentAuthor": "u/iBooYourBadPuns",
                    "commentReplies": []
                },
                {
                    "commentText": "So I can lower it.",
                    "commentAuthor": "u/graceodymium",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The troubled teen industry\n",
            "commentAuthor": "u/LawAlternative6437",
            "commentReplies": [
                {
                    "commentText": "I was sent to a wilderness program for being a \"troubled teen\" and I can say with 100% confidence that my issues only worsened because of it. I am still working with a therapist to deal with the trauma that program caused me. The feeling of being stripped out of your bed at 2am and being put on a plane, not being told where I was going, with 2 large security guards keeping me hostage is something I will never forget. And that isn't even the tip of the iceberg compared to the things they did to me and other kids once I got  there. Shit needs to be illegal, it goes against fundamental rights.",
                    "commentAuthor": "u/ItsDaddyDelta",
                    "commentReplies": []
                },
                {
                    "commentText": "How the hell is that even legal to begin with? Holy crap.",
                    "commentAuthor": "u/West-Cardiologist180",
                    "commentReplies": []
                },
                {
                    "commentText": "Parents have a lot of leeway when dealing with their children. Even horrible parents can pretty easily avoid CPS. Know a teacher who was working for months to try and get a kid away from an abusive household. (Like, locked in the attic without bathroom privileges abuse. Like the kid would come to school as a 6 year old with a diaper, and the parents would talk about how he wasn't potty trained. The kid knew how to use a toilet just fine).Anyway, the parent would just leave the county if a teacher started to get evidence, because (and I'll get the exact reason wrong, but something like) you have to have 6 months of observation of borderline abusive behavior to take action or something. CPS is understaffed, underfunded and frankly, even if the succeed getting them out of a broken or abusive home, often they aren't any better off.A lot of foster homes are abusive and a lot of kids suffer irreparable mental trauma from being ripped from their home and made to live somewhere else.And CPS knows this, so I assume it's tempting to let small things like \"wilderness training\" slide, because families that can afford to send their kid on a wilderness scared straight mission probably are at least putting food on the table, and probably aren't actively abusing drugs. And that's kindof the bar if you aren't sexually or physically assaulting people.EDIT: I feel I should note, the teacher I know did get said kid into the custody of his grandmother. So, things are going as well as they can be. I still think there is a pending trial.",
                    "commentAuthor": "u/fauxpenguin",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Jehovah’s Witnesses.\n",
            "commentAuthor": "u/AstroEngineer3145",
            "commentReplies": [
                {
                    "commentText": "Came here for this comment. They send mail to my house addressed with my government name, not just “Our Neighbor 123 Any Street” asking me to visit their church.  I send all the mailers I get for pest control and landscaping back to them.",
                    "commentAuthor": "u/ansirwal",
                    "commentReplies": []
                },
                {
                    "commentText": "I was raised as one. They look up addresses online, and using sites like WhitePages they can get the names of every person that lives at an address. They won’t stop writing to you, I recommend you respond. There might be a phone number in the letter, there might not. If so, call it. If not, write a letter back. Say that you were raised as a JW, but found the truth with the help of Satan. You’re one of the 144,000 but have rejected your heavenly calling for a life of service to Satan. Then tell them to please stop writing letters or you’ll be forced to summon some demons to possess their homes. They’ll believe every word of it, they actually believe in this shit. I guarantee you’ll be left alone after that.EDIT: some people think I’m being a bit harsh, which is understandable. This comment explains why I’m so harsh towards a religion that seems mostly harmless, if annoying. https://www.reddit.com/r/AskReddit/comments/pwriov/what_feels_like_a_cult_and_is_in_fact_a_cult/hejcx2u/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3",
                    "commentAuthor": "u/DJDarwin93",
                    "commentReplies": []
                },
                {
                    "commentText": "I didn't go quite this far but I DID tell them my mother was a witch and I would be passing along any further letters from them, to her.    I never received another shred of paper with their information on it nor anyone knocking on my door for the next 2 years I lived in that apartment.  They stopped leaving door hangers on my neighbors doors in my building even.",
                    "commentAuthor": "u/IGotNoStringsOnMe",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Whatever the Duggers are. Creepiest bunch I’ve ever seen.\n",
            "commentAuthor": "u/MackeralSky",
            "commentReplies": [
                {
                    "commentText": "Quiverfull. Absolutely a thing.",
                    "commentAuthor": "u/thethriftstorian",
                    "commentReplies": []
                },
                {
                    "commentText": "Technically their church is the IBLP, Quiverfull is like a DLC. Quite a few churches have quiverfull followers, mostly Baptists afaik. The name is from this bible verse Lo, children are an heritage of the LORD:and the fruit of the womb is his reward.As arrows are in the hand of a mighty man;so are children of the youth.Happy is the man that hath his quiver full of them:they shall not be ashamed,but they shall speak with the enemies in the gate.They refuse to use any birth control, even tracking cycles. The only method that they are allowed to use is breastfeeding, which only works for 6 months or so. Many of them have kids 1-2 yrs apart.",
                    "commentAuthor": "u/FBWSRD",
                    "commentReplies": []
                },
                {
                    "commentText": "Yep. Grew up Baptist alongside some Quiverfull kids. I was too young to really realize how weird it was but all 16 (!) of their kids wore identical long braids and handmade paisley dresses with big lace bib collars. I have to think, statistically, like 5 of those kids are gay now.",
                    "commentAuthor": "u/lilsmudge",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I don't quite know how to explain in, but once a fandom reaches a certain point, it's almost embarrassing to admit that you like the show/movie/book/etc because you automatically get lumped in with the super cringe and toxic portion.\n",
            "commentAuthor": "u/BillyeBro",
            "commentReplies": [
                {
                    "commentText": "Yeah not to mention those people who are weirdly obsessed with certain YouTubers, sometimes even after they have been off the internet for a long while.",
                    "commentAuthor": "u/JennaMarblesFanClub",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Rick and morty",
                    "commentAuthor": "u/YaronL16",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The “Entrepreneur” Lifestyle. Many people are encouraged to put aside pleasures of life in the tiniest hope that if they just “grind” hard enough they’ll be billionaires.\n\nOh also, while caring a lot about your money and how you spend it, buy my $500 plan to help you make money faster.\n",
            "commentAuthor": "u/Gmony5100",
            "commentReplies": [
                {
                    "commentText": "I've found out that if anyone advertises they are an \"entrepreneur\" they are more likely to be a scammer/faker than an actual business owner.Like I know a guy that owns a excavating company. When he meets people and they ask what he does, he doesn't say \"I'm an entrepreneur\" he says \"I work in excavation\" or says he owns an excavation company. Only people saying they are \"entrepreneurs\" are wannabes in my experience.",
                    "commentAuthor": "u/16semesters",
                    "commentReplies": []
                },
                {
                    "commentText": "Whenever people say \"I've founded 50 companies\" they never say what those companies actually do.",
                    "commentAuthor": "u/mdp300",
                    "commentReplies": []
                },
                {
                    "commentText": "Or if the companies are still around 🙄",
                    "commentAuthor": "u/RED_DEAD_REVENANT",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The Prosperity Gospel\n",
            "commentAuthor": "u/purplelikeme",
            "commentReplies": [
                {
                    "commentText": "All hail Joel Osteen! (imagine Martin Short channeling Tim Allen, you can’t unsee it after that)",
                    "commentAuthor": "u/Purpleasure34",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Silicon Valley tech companies are not a cult.\n\nHowever, there is a subculture within Silicon Valley tech companies that is a cult.\n\nHere are some things to watch out for:\n\n\nSleep deprivation. If your team wants you to do overnight oncall, and overnight pages happen more often than once every seven oncall shifts, your team is a cult.\nTraining vs. guilt. If your team assumes that you already know all the details of the tech you work with, and dumps weird guilt on you when you don't know an obscure fact, your team is a cult.\nRich lifestyle vs. actual returns. If your team encourage you to pick up expensive hobbies (sports cars, piloting, ski trips), but the company doesn't actually pay enough to afford them without skimping on your regular expenses, your team is a cult.\n\n",
            "commentAuthor": "u/fubo",
            "commentReplies": [
                {
                    "commentText": "Also if you've planned a vacation in advance, and it's known, don't let people drag you back to work. You are more important than anything else, fuck work. If you told them well in advance and had it planned out don't let anyone stop you from taking it.",
                    "commentAuthor": "u/MisterSnippy",
                    "commentReplies": []
                },
                {
                    "commentText": "I don’t work in tech, but this is exactly how I knew my current job was finally where I wanted to stay. During my interview I told them I wanted just two days off in November for a short trip. They agreed. I leave on the 21st and back on the 22ndJust a couple weeks ago a client I am scheduled to work with for two weeks called the owner to ask/complain that they wanted to push their appointment a few days later. Normally this is no huge deal at all, we have some flexibility. The issue was he was supposed to finish up on the 20th, so even a day later would cut into my time off. Without even asking me, with zero hesitation, she told him no, hard no. “Sorry my employee won’t be here, you have to keep your scheduled time or reschedule a couple months from now.” He brought up excuses and all that but she just kept saying no. She told me she wouldn’t let it happen because my personal time is important and everyone needs breaks. I have never worked in an environment where in such a short time with the company the ownership group was very quickly supportive of personal time. Every other job I have ever worked has asked to come in on weekends, change vacation plans, work remotely while on vacation etc etc etc. with the exception of one other job that was good about this too, but just simply not the career I wanted. This spoke volumes to their values as bosses.",
                    "commentAuthor": "u/Olbaidon",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Qanon\n",
            "commentAuthor": "u/heathers1",
            "commentReplies": [
                {
                    "commentText": "These crazies, Jesus Christ. One man killed his kids cause he thought they were going to turn into lizard monsters.Edit: here's the link. https://www.nbcnews.com/news/us-news/california-dad-killed-his-kids-over-qanon-serpent-dna-conspiracy-n1276611",
                    "commentAuthor": "u/kenxzero",
                    "commentReplies": []
                },
                {
                    "commentText": "It’s sad that this isn’t very hard to believe",
                    "commentAuthor": "u/taylortherod",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Scientology - look up Xenu.  Hawaii did not even exist 75M years ago.  L Ron Hubbard was nuts.  Yet Scientologists believe this shit.  I can't believe Tom fucking Cruise believes this shit.  Anyone says they are a scientologist, avoid them like the plague...Bat Shit Crazy.\n",
            "commentAuthor": "u/DigitalR3x",
            "commentReplies": [
                {
                    "commentText": "I wondered if they've just got some shit on Tom Cruise and he can't leave.",
                    "commentAuthor": "u/batt3ryac1d1",
                    "commentReplies": []
                },
                {
                    "commentText": "According to Leah Remini, Tom Cruise is a true believer. It's John Travolta that I really wonder about.",
                    "commentAuthor": "u/SouthOfOz",
                    "commentReplies": []
                },
                {
                    "commentText": "Tom Cruise is only a true believer because he's only had the 'celebrity' experience and since it benefits him, he doesn't care about anyone else's experiences.  With everything that I've read and seen about Scientology it looks like Tom and David are in a total bromance of functional psychopathy.Where is Shelley Miscavige!!",
                    "commentAuthor": "u/TwirlyShirley8",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Within the cancer community there’s a political group who have all read (probably) Chris Beat Cancer and it’s a bullshit book telling you you can cure cancer by changing your diet. Sugar is the main villain. You can fight me all you want but SUGAR DOES NOT CAUSE CANCER. Listen to your oncology approved dietician and get the fuck off Facebook.\n\nJust this past weekend I had lunch with my friend’s dad who is also terminal and his wife has banned him from sugar because of this bullshit. The dude is dying and he’s not even allowed to enjoy himself in moderation. Because she heard about it on Facebook.\n\nEDIT: chemo brain often forgets the huge difference between nutritionist and dietitian. Sorry, my bad.\n\nAND FINALLY: I’m done arguing! Thanks everybody! Please listen to the cancer patient in your life and what they want. Do they want to change their diet? Absolutely go for it but make sure they’re getting the right nutrition from a qualified professional. Do what they want. You actually have no idea. We really need to shift our current state of cancer care to a more palliative (NOT hospice, big distinction) model. A cancer patient that is as relatively happy as can be has the potential to increase their outcome. And finally DONATE BLOOD and sign up for bethematch.org WE NEED YOU!!\n",
            "commentAuthor": "u/Ghostytoastboast",
            "commentReplies": [
                {
                    "commentText": "When I had cancer people gave me a LOT of unsolicited advice. I was told to do a number of bullshit diets, and to not use western medicine. I had no tact at that time, I was so exhausted and sick. I would just remind people that I was a single mother who did not have fuck around and find out money for alternative healthcare, and it would be cruel to deny my children their mother because some idiot told her to change her diet and she died. I asked a few people if they were volunteering to pay for my funeral.Edit: you guys gave me treasure!!!! Thank you.",
                    "commentAuthor": "u/kittididnt",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "We had this fight with my grandma.  I (out of state) happen to be visiting her in hospice when they did a team conference so I sat in on it on my mom’s (medical power of attorney and also out of state) behalf.  My aunt was the one doing a lot of the day-to-day since she lived in town.  She was having them deny my dying 94 year old grandma cookies because she wanted her to be gluten-free (no kind of gluten intolerance/allergy/celiac and no reason to suspect it).  So my mom had to tell them to give her all the cookies she wanted.",
                    "commentAuthor": "u/angelerulastiel",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Westboro Baptist Church\n",
            "commentAuthor": "u/itslandonb",
            "commentReplies": [
                {
                    "commentText": "A few years ago they decided to come all the way to Montana and protest the Catholic Church (iirc because we're too friendly towards gay people).Thing is, they were protesting outside a cathedral with several tons of church bells.  The bells (electronically controlled) were set to \"crackhead in the tower pulling all the ropes\".  You couldn't hear a word of what the Westboro nuts were chanting over the constant chiming.Then it started randomly snowing on them so they packed up and went home.",
                    "commentAuthor": "u/skylarmt",
                    "commentReplies": []
                },
                {
                    "commentText": "Snow fell on them and they left. What a picturesque sight, like peace was being restored by God Himself.",
                    "commentAuthor": "u/pimpmastahanhduece",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Workplaces that tout \"we are a family\"\n\ni seen too many people fall into that and get ostracized by the \"family\"\n",
            "commentAuthor": "u/landob",
            "commentReplies": [
                {
                    "commentText": "They let you go at the first sign of financial trouble",
                    "commentAuthor": "u/el8v",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "People who are way too invested in the college they attended.\n",
            "commentAuthor": "u/Luluco15",
            "commentReplies": [
                {
                    "commentText": "Yeah. I remember one time I was working in a call center and I said to a customer on the phone: “…alright, how can I help you with your Ohio University card?”A silence…“Ohio STATE.” He said sternly. Me to myself: “Not one single soul on earth before or after today will give a solitary fuck about which Ohio college you attended, you ass napkin.”It’s strange how obsessed people get with…school…shudder",
                    "commentAuthor": "u/GlumMathematician884",
                    "commentReplies": []
                },
                {
                    "commentText": "\"THE Ohio State\" /s",
                    "commentAuthor": "u/Booze-brain",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Mormonism. I grew up as a young girl in the Mormon faith. Not only is that brand of Christianity completely brainwashing, I grew up with strict rules and the understanding that God designed men and women different and because men are visually stimulated, that modesty and my sexual purity was a god ordained gift to protect through modesty. If you commit a sexual sin, like masturbation for example, you must confess to a bishop who is generally a middle aged man. I confessed to my Bishop that I masturbated. He asked for disturbing details. Being ashamed as I was taught to do, I answered every question he asked, hoping God would forgive me if I was just honest. I met with him, week after week updating him on when I had sinned this way, and he asked too many detailed questions Everytime. I was uncomfortable but thought I needed to confess everything he asked for God to forgive me. I was fucking 14 years old and didn't realize until my mid twenties that no one else (specifically males) were ever asked questions like I was when confessing to masturbation. So basically my cult allowed a closet pedophile to violate my privacy and my comfort for the sake of his sick pleasure. Those questions should never have been asked. Even if God was in the Mormon church, that man made me unwilling to ever trust that creepy cult again.\n",
            "commentAuthor": "u/Dense-Slice4984",
            "commentReplies": [
                {
                    "commentText": "Bishops interviews are horrific. What’s even worse is the Mormon religion excommunicated the bishop that tried to stop this. Sam young should have gotten way more respect than he should have.",
                    "commentAuthor": "u/notasheeeep",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Former Mormon here too. My uncle sexually assaulted many children, including me. My mom didn’t care. Just told me “that’s how it is.” Turned out the whole family knew about him, but since he was a bishop, it was ok??? He was moved around to different wards for years. They wouldn’t excommunicate him for harming CHILDREN. They just pawned him off onto different wards to victimize more people. My aunt divorced him a couple years ago, which was a big deal in the church. Why? Infidelity. Not because he had been assaulting their own children for years. That wasn’t a dealbreaker for her. But cheating was. My mom and most of my aunts/uncles support him. She even tries to convince me he’s a man of God once in a while. Screw that and screw that cult.I hope you’re doing well and that you’re away from that garbage.",
                    "commentAuthor": "u/NinjaHermit",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Primerica. Worst cult vibes ever.\n",
            "commentAuthor": "u/AssMuffins69",
            "commentReplies": [
                {
                    "commentText": "I almost got suckered into that. After going to an interview, I realized what it was, and decided to back out. A year later, I saw they had charged my card $30. It took me way too long and more arguing than should have been necessary to get a refund",
                    "commentAuthor": "u/taylortherod",
                    "commentReplies": []
                },
                {
                    "commentText": "My exact experience. I had worked for Kirby 2-3 years before this, a \"friend\" invited me to a \"meeting\" and it was Kirby all over again. The over-excited enthusiasm and friendliness that has horror movie vibes, which, is accurate because the real horror is you getting drained financially while they string along promising riches.",
                    "commentAuthor": "u/akeating6388",
                    "commentReplies": []
                },
                {
                    "commentText": "Man when I was about 18 I got sucked into both Primerica AND Kirby.. I was young and dumb and wasn't aware of MLM and pyramid schemes and shit. What can I say, I was a sucker.. Now that I'm older and wiser, now have a solid career as an entrepreneur getting my Herbalife business going.",
                    "commentAuthor": "u/DeadUncle",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Those Shen Yun performances that are overly advertised every year. Turns out they're directly tied to Falun Gong.\n",
            "commentAuthor": "u/greyghost5000",
            "commentReplies": [
                {
                    "commentText": "I was gonna comment this if no one else did.Falun Gong: What if Scientology but East Asian and kinda racist?",
                    "commentAuthor": "u/Draconiou5",
                    "commentReplies": []
                },
                {
                    "commentText": "Yup. They get a lot of western sympathy because what the PRC does to them is NOT OK. They are still a cult, though.",
                    "commentAuthor": "u/ACaffeinatedWandress",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "People who buy Twix candy bars based on the Left Twix vs Right Twix.\n",
            "commentAuthor": "u/JohnBlazeAADTC",
            "commentReplies": [
                {
                    "commentText": "I am a bitwixual.",
                    "commentAuthor": "u/NateShaw92",
                    "commentReplies": []
                },
                {
                    "commentText": "great, now you made me want a Twix.But I'm not sure if I want to eat the left one, or jam the right one up my ass.",
                    "commentAuthor": "u/alexjaness",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "NXIVM. All hail Vanguard, and pass the branding iron!\n\nScrolled through and didn't see it.....\n",
            "commentAuthor": "u/SybianOwner",
            "commentReplies": [
                {
                    "commentText": "Oh shit, at first I thought you were talking about Vanguard index funds and I was about to get real defensive",
                    "commentAuthor": "u/michaeldeerwood",
                    "commentReplies": []
                },
                {
                    "commentText": "Motherfucker if low cost passive investing is a cult, pass me the Kool Aid.",
                    "commentAuthor": "u/ReplaceSelect",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Pentecostalism.  They tell everyone they are the true original Christian church, but in reality they just control people.  \n\nMost of their churches have tons of rules, women can't cut their hair at all, or wear pants or jewelry.\n\nWatching TV or movies is either discouraged or outright forbidden.  Any type of alcohol consumption is forbidden.\n\nThat's just the beginning of it, highly recommend doing some research into the movement, crazy bunch of people.\n\nEdit:  obligatory RIP my inbox, I'll try to respond as I'm able, guys.\n\nEdit 2:  For those that were a part of this denomination and have since left, check out /r/Expentecostal\n\nEdit 3:  Holy shit, it just keeps coming.  Come over to /r/Nakedpentecostalism I can't respond to every comment here.\n",
            "commentAuthor": "u/slayer1am",
            "commentReplies": [
                {
                    "commentText": "Meanwhile, Jesus himself: holds up wine \"take this cup and drink from it\"",
                    "commentAuthor": "u/eletricsaberman",
                    "commentReplies": []
                },
                {
                    "commentText": "I can tell you from personal experience that Christian sects that believe in total abstention form alcohol will bend over backwards to say that pretty much any inconvenient mention of wine on the Bible is just talking about grape juice.",
                    "commentAuthor": "u/arnoldrew",
                    "commentReplies": []
                },
                {
                    "commentText": "Yes, because \"oinos,\" which means wine, a fermented drink, in every other context, means grape juice in the Bible, despite the fact they had a whole different word for juice (khumós/khūlós).And yes, when the dude told Jesus that wine as good as his should be served first before people's tongues go numb, he was totally talking about grape juice. You know, how you drink a lot of juice and then start feeling tingly, and your senses kind of go a little numb, and you kind of start having memory problems (or will in a little while.) Yeah, totally juice.",
                    "commentAuthor": "u/datjellybeantho",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Chief's Mess in the US Navy, which comes complete with \"initiation\", something no other branch (enlisted or officer) has and that this somehow forms an eternal bond of \"blood by family\", that includes eating food out of trash cans and sabotaging uniforms for the \"greater lesson\". \n\nThen \"private\" meetings that have grey areas/secrets of what happens in those meetings. Specifically anything related to punishments or review boards.\n\nThe fact that it takes two chiefs talking behind closed doors to get anything accomplished is also proof. People notice, though it's implied that it's not noticed.\n",
            "commentAuthor": "u/DarkJester89",
            "commentReplies": [
                {
                    "commentText": "No other branch treats E7 the way the Navy does. All those fucking goat locker shirts at the NEX, and stickers on every single Chief's truck. Miss me with that bullshit. I got out. 2nd class for life.",
                    "commentAuthor": "u/TitsClitsTaylorSwift",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Mom run community Facebook pages.\nEdit: I didn’t realize this would blow up like it did. Some of these moms gotta be stopped on the real. Lmao\nThank you for the awards as well!\n",
            "commentAuthor": "u/geraldcubed",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}