{
    "question": "What do you do to escape reality?",
    "questionAuthor": "u/Lego8945",
    "arrayAnswer": [
        {
            "commentText": "stay up awfully late\n",
            "commentAuthor": "u/astroturbo1",
            "commentReplies": [
                {
                    "commentText": "Tomorrow can’t come if I never go to sleep, right?",
                    "commentAuthor": "u/Mason-Derulo",
                    "commentReplies": []
                },
                {
                    "commentText": "Night last longer...",
                    "commentAuthor": "u/FuggyGlasses",
                    "commentReplies": []
                },
                {
                    "commentText": "The worst feeling is the point in an all nighter when the sun starts to come up and you come to terms with the notion that no, you won't be getting even a couple of hours before your day starts.",
                    "commentAuthor": "u/crunchypuddle",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "daydream\n",
            "commentAuthor": "u/damnoice",
            "commentReplies": [
                {
                    "commentText": "Anyone else “daydream” by thinking about buying things for hobbies… aka I spend my entire shift online shopping. Sometimes I research a new hobby, and for weeks try to find the best gear, but I never start that new hobby. Rinse and repeat the next week. Last week I got really into Gravel bicycles. Researched all the different bars, clips vs flats, which bike packs to go overnighting with, which cassettes are good for the terrain I planned to ride, tire size, shoes, how to convert to tubeless, I mean I could go on about it, and I’ll never even buy the damn bike.",
                    "commentAuthor": "u/nosfusion",
                    "commentReplies": []
                },
                {
                    "commentText": "I worry a lot that I like the fantasy of being a guy with real interests or passions a lot more than any of my actual hobbies. Like, even things I enjoy doing still basically feel like a chore. Part of me wonders if the part of my brain that does fun is just broken. For the life of me I can't find a single video game I actually like. Aren't games supposed to be like, Distilled Fun?I think some of it comes from reading a very Scientific Article I read on Cracked as a kid. It was about how the anticipation of a thing is better than the thing itself. So why bother with getting the thing? Seems a little like eating the wrapper and throwing away the candy. Nothing I ever do is going to give me enough pleasure to actually feel like it's worth doing. At best it's just trying to find ways to maintain myself emotionally.Like I think I'm at this point where I'm consciously thinking about how life is just finding ways to numb and distract yourself while we slowly wait to die. I don't drink anymore but the best parts of my free time include sleep, staying up late, masturbation, aimlessly browsing the internet, and occasionally edibles. And like, I'm fairly happy -- like my job is fine, I have a partner I'm just crazy about but it still feels like all I'm doing is self-medicating. But maybe that's just what being alive is, right? Maybe all pleasure is relief. I'm just too stubborn and arrogant for my own good so I refuse to delude myself into thinking that life's anything but what it is.Or maybe I'm a manchild stuck in his mid-adolescence. That's also very possible lmao.Idk, like, I don't want to die but I would love to be put down. My life is fine but also the idea of doing this for another 40-60 years is so exhausting. I just want this to be over with already. At least when you die young it's a tragedy, when you're like, eighty or whatever it's kind of just expected. TBH maybe it's better to die real young, like, period. That way you had a whole life to look forward to without having to deal with the stress and disappointment.Sorry this is like my least favorite flavor of internet comment, the like, Unprompted Therapist Info Dump I guess I just needed a public void to shout into",
                    "commentAuthor": "u/WiseauIsAuteurAF",
                    "commentReplies": []
                },
                {
                    "commentText": "Try eliminating sources of immediate gratification, especially time consuming ones like browsing the internet, video games, being high. The goal is to be bored. Create a void of entertainment. It’ll force you to explore new hobbies. All of the sudden that guitar you never played looks enjoyable. The library looks like a vast source of entertainment. Now you’re that guy calling up your friends to grab pizza, go to the gym, and you’re full of interesting stories because you’re finally living.",
                    "commentAuthor": "u/eddieguy",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Listen to music, game\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "Same Music and Games calms me",
                    "commentAuthor": "u/Actual_Face_164",
                    "commentReplies": []
                },
                {
                    "commentText": "Whenever I read “Games calm me” I wonder if it’s the same person who yells at their diamond teammates for dropping the shield a little early on that DVA ult.",
                    "commentAuthor": "u/Gernafax",
                    "commentReplies": []
                },
                {
                    "commentText": "Getting mad at Overwatch does help me redirect all of my irl anger onto a harmless outlet. And no, I don’t yell on comms at other people. I stay off mic and occasionally yell “you motherfucker” at my poor tv. Yelling at other people wouldn’t make it a harmless outlet.",
                    "commentAuthor": "u/geometricvampire",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Write fiction. Read fiction. Gaming.\n",
            "commentAuthor": "u/Metatron_Fallen",
            "commentReplies": [
                {
                    "commentText": "Writing is such a relief! On nights when I am too tired (and want to avoid screen time), I either imagine my way through plot and dialogue or make small notes on paper. There are times when I am writing that I truly zone out for hours at a time and I'm just *there* with my characters.",
                    "commentAuthor": "u/Spasay",
                    "commentReplies": []
                },
                {
                    "commentText": "Yep. When it's like that, it's the best thing in the world.",
                    "commentAuthor": "u/Metatron_Fallen",
                    "commentReplies": []
                },
                {
                    "commentText": "I used to work with writers (one ghost wrote the Tec Wars series). They often spoke about knowing the character’s personality so well that all they had to do was “set the stage” and the characters would write the story themselves. The other writers would chime in and agree. Some would say how they often thought a scene would play out one way because they wanted to push a specific plot point and their characters wouldn’t cooperate. I always found that fascinating.",
                    "commentAuthor": "u/checker280",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Sleep. Too depressed and broke to even try anything else\n",
            "commentAuthor": "u/Relative_Economics17",
            "commentReplies": [
                {
                    "commentText": "When in doubt, nap it out",
                    "commentAuthor": "u/chillresponsibly",
                    "commentReplies": []
                },
                {
                    "commentText": "FTFY",
                    "commentAuthor": "u/Urbanviking1",
                    "commentReplies": []
                },
                {
                    "commentText": "¿Porque no los dos?",
                    "commentAuthor": "u/xaanthar",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Repetitive medium labor.\n\nRaking/leaf blower\n\nSplitting logs\n\nYard word, a light jog.\n\nSomething about working until your muscles get that numbness to it.\n\nThe rest of the world aside from what you’re doing just melts away and you reach a point where it doesn’t matter.\n\nAnd hey it’s good exercise.\n",
            "commentAuthor": "u/lowbreadth39",
            "commentReplies": [
                {
                    "commentText": "Yes!!! I call it \"Thinkin' Work\". The world just fades away and you can actually think clearly.",
                    "commentAuthor": "u/hunterman55",
                    "commentReplies": []
                },
                {
                    "commentText": "My painting professor used to describe painting like chopping wood. Just keep at the work steadily and the rest will take care of itself.",
                    "commentAuthor": "u/Poison-Song",
                    "commentReplies": []
                },
                {
                    "commentText": "I do mini painting as well as manual work to clear my head from time to time. Works wonders with both methods!",
                    "commentAuthor": "u/Only_OneCannoli",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Shower....time flows slow in there for some reason\n",
            "commentAuthor": "u/GT_334",
            "commentReplies": [
                {
                    "commentText": "It helps anxiety attacks. Water on your face slows heartrate and oxygen consumption. So i hear.",
                    "commentAuthor": "u/shancanned",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah it can activate the dive reflex when you do that. Running cold water on wrists/forearms can also be pretty magical",
                    "commentAuthor": "u/bees_knees5628",
                    "commentReplies": []
                },
                {
                    "commentText": "it is a vagal manuever. In emergency medicine if your heart rate is staying in the 150s or higher while resting we sometimes have patients dunk their heads in bucket of ice water. Some patients have repeat episodes of SVT and prefer it over being medicated or electric cardioversion (being shocked)(not medical advice if you're having a racing heartrate with shortness of breath, chestpain,and feeling weak you should call 911 or other emergency service)",
                    "commentAuthor": "u/YamahaRN",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Walk my dog early in the morning. We pretend we are navigating an apocalyptic landscape in the search for treats.\n",
            "commentAuthor": "u/virtigex",
            "commentReplies": [
                {
                    "commentText": "I used to do this with my kid! We'd jump on our bikes, circle the block, \"find\" a care package (backpack with water, snacks, etc) and ride to \"far away places\".. sometimes we'd hit up the elementary school about a mile away and have to fight off the horde of zombies then sneak back on our bikes and ride. I personally, have died many a times, according to him. LolEventually, we planned on doing a nighttime ride too but I wanted to set up the bikes for that- reflectors, headlamps, etc but it kept getting shoved off for other bills, or he'd rather do something else instead... until finally, he completely outgrew hanging out with mom. Sometimes, I'll get a few COD zombie sessions in, and we'll grab chipotle and try to catch up on flash but that's a very rare treat for me now.",
                    "commentAuthor": "u/freedom_oh",
                    "commentReplies": []
                },
                {
                    "commentText": "You're an awesome parent!",
                    "commentAuthor": "u/Olympiano",
                    "commentReplies": []
                },
                {
                    "commentText": "Seriously, the kid will remember this when he's older... talking from personal experience.",
                    "commentAuthor": "u/SilentMapper",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Stargazing sets me straight.\n",
            "commentAuthor": "u/wertyuio234",
            "commentReplies": [
                {
                    "commentText": "I have to do some stargazing for this astronomy class but I'm still gay",
                    "commentAuthor": "u/Jay_Max",
                    "commentReplies": []
                },
                {
                    "commentText": "You mean Jay*",
                    "commentAuthor": "u/YrPrblmsArntMyPrblms",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Run, and not in some fitness guru way where “it really brings me into a meditative headspace”\n\nWhen I’m running I just can’t think about anything but running\n",
            "commentAuthor": "u/Quietcat55",
            "commentReplies": [
                {
                    "commentText": "Funny, I have to listen to some music I'm really into when running, because I can't be thinking about running or else I'll want to stop running.",
                    "commentAuthor": "u/TinctureOfBadass",
                    "commentReplies": []
                },
                {
                    "commentText": "I just do math, trying to calculate my pace or convert it to metric and so on.  I'm great at math except when running, it takes SO LONG and several attempts to do that kind of basic shit when you're really going hard.  A great distraction.",
                    "commentAuthor": "u/dfgkjnsdkfjbs",
                    "commentReplies": []
                },
                {
                    "commentText": "ya lets combine the worst two things in life into one activity",
                    "commentAuthor": "u/halyun",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Read fantasy fiction.\n",
            "commentAuthor": "u/misstaken69",
            "commentReplies": [
                {
                    "commentText": "Any cool recommendations?  I’ve been digging Unsouled: Cradle series by Wil Wight which is very Kung Fu/ last airbender type of series",
                    "commentAuthor": "u/jkhendog",
                    "commentReplies": []
                },
                {
                    "commentText": "Stormlight Archive by Brandon Sanderson is always a great recommendation if you want to disappear for a month. The lightbringer series by Brent Weeks kind of follows the last airbender vibe, since it has multiple magic/figthing systems.",
                    "commentAuthor": "u/Jarl_Walnut",
                    "commentReplies": []
                },
                {
                    "commentText": "Man, I love Brandon Sanderson. I read his Reckoners series and I'm currently waiting for the last book of Skyward (Cytonic) to be available at the library.",
                    "commentAuthor": "u/RabidRabbitCabbage",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Video games\n",
            "commentAuthor": "u/dontjustexists",
            "commentReplies": [
                {
                    "commentText": "When my mom was diagnosed with terminal cancer I hid in video games, notably World of Warcraft.  It was the only thing that kept me sane.  I mean, I still worked and interacted with people and took her to appointments and spent time with my dad, but when I found myself alone with my thoughts I would log into the game and spend hours there.The beautiful thing about video games is that the problems have solutions. You can generally solve every dilemma and even get a reward. That's not the case in real life.",
                    "commentAuthor": "u/donquixote235",
                    "commentReplies": []
                },
                {
                    "commentText": "Shit I never thought about it like that (your last paragraph).  That’s a cool perspective I had never considered.",
                    "commentAuthor": "u/mortarnpistol",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Not today narc\n",
            "commentAuthor": "u/northsideindian",
            "commentReplies": [
                {
                    "commentText": "Fuck i laughed and now all my coke blew behind the toilet",
                    "commentAuthor": "u/t00oldforthis",
                    "commentReplies": []
                },
                {
                    "commentText": "Do you want ants?Because that’s how you get ants",
                    "commentAuthor": "u/JimmyAllnighter",
                    "commentReplies": []
                },
                {
                    "commentText": "Those ants are gonna be pretty fuckin lit",
                    "commentAuthor": "u/BioloItz",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Drugs\n",
            "commentAuthor": "u/nobody671",
            "commentReplies": [
                {
                    "commentText": "I literally came here to say \"substances\" and there's all these wholesome and healthy answers.",
                    "commentAuthor": "u/WhosJoeMayo",
                    "commentReplies": []
                },
                {
                    "commentText": "Lmao I have those healthy answers like video games, guitar, birding but the real answer is going out and getting drunk",
                    "commentAuthor": "u/king_booker",
                    "commentReplies": []
                },
                {
                    "commentText": "Or staying in and drinking alone lololol",
                    "commentAuthor": "u/Aromatic-Box-592",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Come here, and read.\n\nEdit: just got back from school and saw this.\n",
            "commentAuthor": "u/MinnestoanPerson",
            "commentReplies": [
                {
                    "commentText": "Shockingly low is this. I'd have thought \"Reddit\" would be in top 5",
                    "commentAuthor": "u/duckies_wild",
                    "commentReplies": []
                },
                {
                    "commentText": "ITT: People who distract themselves with Reddit trying to distract from that with tales of other distractions.",
                    "commentAuthor": "u/ThisAltDoesNotExist",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Exercise and if I have more time go for a longer hike and enjoy nature. I don't  care how old I am I will always enjoy walking around forest, fallen leaves up to your knees, kicking them around, listening to rustling. And walking on freshly fallen snow.\n",
            "commentAuthor": "u/purpleowlie",
            "commentReplies": [
                {
                    "commentText": "This almost sounds like the opposite of escaping reality. You’re truly diving into it and experiencing the best of what reality has to offer.",
                    "commentAuthor": "u/sullensquirrel",
                    "commentReplies": []
                },
                {
                    "commentText": "My day to day reality is tiny apartment in city, with loud neighbours, dogs barking, constant sounds of traffic, looking at computer most of the day, sitting behind desk ... so when I  need a change I go to nature, to the mountains, where I can find peace, forget about problems and try to enjoy things I enjoyed when I was kid. Really listen to nature, observe shapes, colors and daydream.",
                    "commentAuthor": "u/purpleowlie",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Garden. Saved me from depression. No meds ever worked.\n",
            "commentAuthor": "u/Unhappy_Mongoose_778",
            "commentReplies": [
                {
                    "commentText": "I swear, physical activity seems more often than not to be the #1 help for depression.",
                    "commentAuthor": "u/marcvanh",
                    "commentReplies": []
                },
                {
                    "commentText": "When someone is venting, really down and sad and the other says \"let's walk and talk\" or \"let's just go for a walk\" is because it actually works. \nI was in a place of super dark depression. I had planned out how I was gonna kill myself when my parents came to visit me. And the reason I was gonna wait for them is because I thought, well someone will be there to take care of my kids. I obviously didn't do it, but I remember crying in the corner of the bathroom floor because I felt selfish that I wanted to see them grow up. I thought they deserved better than me and being gone would be better for them. Still brings tears to my eyes thinking about it.",
                    "commentAuthor": "u/Unhappy_Mongoose_778",
                    "commentReplies": []
                },
                {
                    "commentText": "I’m sorry you experienced these feelings about yourself. I hope you are doing much better. From reading your story about gardening, it seems like you are. In case you need reminding, you have your own special place here. Keep your chin up 😊 thanks for your courage to keep going and for sharing your story.",
                    "commentAuthor": "u/Tuneful_Wench9",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Late at night, I take my bike and ride to my old elementary school that's now a public park. I sit down on the same bench I've always sat at, and I start recording.\n\nI've found that talking my problems out, or talking about  anything, just helps me to escape. Some of those audio logs I've listened to countless times. I catch myself thinking \"wow, I actually said that.\"\n\nMaybe someday I'll post them online, or preserve them as a memento to the times I've lived through.\n\nI can tell you right now, if I never started making those logs I wouldn't be half the person I am now.\n",
            "commentAuthor": "u/D3SYNK",
            "commentReplies": [
                {
                    "commentText": "I think it's called Meta thinking? By recording your thoughts (or even if you wrote those down) your now 'thinking about thinking'. Your basically removing the emotional connection to whatever is troubling you and your giving yourself a chance to objectively look at those thoughts. It's why you catch yourself thinking 'wow I actually thought that'. It's a really useful tool for helping to clear away the gunk, to help you find the SOURCE of problems. It's something I think everyone should do, it's such a huge help.",
                    "commentAuthor": "u/SkyOsiras",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I create fantasy worlds and build 'em up, complete with languages, culture, people, history, etc. It's fun.\n",
            "commentAuthor": "u/Nyarro",
            "commentReplies": [
                {
                    "commentText": "Is that you, J.R.R Tolkien?",
                    "commentAuthor": "u/InstantShiningWizard",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Masturbate😩\n",
            "commentAuthor": "u/Sensitive-Fox6567",
            "commentReplies": [
                {
                    "commentText": "I fuck a hole in my bed. Get on my level virgin.",
                    "commentAuthor": "u/Numerous_Quality2249",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Hmm isn’t that why we’re all here on Reddit?\n",
            "commentAuthor": "u/e-rekt-ion",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "youtube\n",
            "commentAuthor": "u/katzgar",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "If I'm escaping something like someone talking about something I don't want to hear, I just stop listening and start thinking about my to-do-list of the day.\n",
            "commentAuthor": "u/Head_Maintenance_323",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Smoke weed\n",
            "commentAuthor": "u/Fbg_dello",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Either escape into my own mind, or go into vr.\n\nFor me they are kinda simmilar\n",
            "commentAuthor": "u/Casperios",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "read a book\n",
            "commentAuthor": "u/Maleficent_Ad_7617",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}