{
    "question": "What things probably won't exist in 25 years?",
    "questionAuthor": "u/Iapoties",
    "arrayAnswer": [
        {
            "commentText": "Trustworthy video evidence\n",
            "commentAuthor": "u/georgepordgie",
            "commentReplies": [
                {
                    "commentText": "This is a great one. I just recently saw a video on deep fakes. It’s scary to think how fast that technology is advancing Also great name btwEdit: Thanks for the love guys. I was not expecting this to get the attention it did.",
                    "commentAuthor": "u/canal_banal",
                    "commentReplies": []
                },
                {
                    "commentText": "For awhile, yes. It will give rise to demand for countermeasures, and countermeasures they will deliver. Humans have always been best at selling solutions to problems they themselves created",
                    "commentAuthor": "u/Arrasor",
                    "commentReplies": []
                },
                {
                    "commentText": "That is the worst ...thing that has to always happen with everything. All of our technology has to keep being retooled and recreated and upgraded and reinforced, for pretty much no other reason than to combat society's assholes. Every conceivable thing that we do needs to be redone, over and over, to prevent scumbags from abusing and manipulating it. You can't just have a password! You need it to contain at least eight characters, and they must include upper and lowercase letters and numbers and special characters, and then you need to prove you're not a robot, and then you need to click on all the pictures of trains, and then you need to have your authenticator code, and then you need to enter the code we sent via email. But then your password was exposed on the dark web so you need to do all of that 47 times for all of your accounts because someone used your bank account to get an Uber into NYC. POS humans have turned all of our modern conveniences into chores.",
                    "commentAuthor": "u/ultranothing",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Human cashiers at grocery stores.\n",
            "commentAuthor": "u/brenlilac88",
            "commentReplies": [
                {
                    "commentText": "It'll all be mice",
                    "commentAuthor": "u/spiderbabyinapram",
                    "commentReplies": []
                },
                {
                    "commentText": "Instead of sighing at the 90th “it doesn’t scan, so it must be free, right? har har” joke like their human counterparts, they’re gonna sigh at the 90th “Hello! Mice to see you!” joke.",
                    "commentAuthor": "u/trigonated",
                    "commentReplies": []
                },
                {
                    "commentText": "So cheesy.",
                    "commentAuthor": "u/imaquack",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "GTA6\n",
            "commentAuthor": "u/couchpotato9099",
            "commentReplies": [
                {
                    "commentText": "To go along with this.. The 25th iteration of the Xbox without a GTA5 Remaster.",
                    "commentAuthor": "u/matts1",
                    "commentReplies": []
                },
                {
                    "commentText": "Don't forget Platinum Golden Anniversary Remastered Ultra-Graphic VR Smell-a-Vision Skyrim.",
                    "commentAuthor": "u/gelatomancer",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Me!\n\nBy way of explanation: I’m 64 now. No male on either side of my family tree has ever made it to 89. Ergo, I have reason to believe I won’t either.\n\nHmmmmm…sounds like I’d better take up skydiving while I still can! 🪂😁\n",
            "commentAuthor": "u/OldBob10",
            "commentReplies": [
                {
                    "commentText": "Wish you well bob! Hope the years are good to ya",
                    "commentAuthor": "u/Rough_Engineering_29",
                    "commentReplies": []
                },
                {
                    "commentText": "This reply really made me smile.  Nice job Rough_Engineering_29.  Honestly made my night.\n·",
                    "commentAuthor": "u/AldoRaineClone",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Cable television\n",
            "commentAuthor": "u/SharkCrenshaw",
            "commentReplies": [
                {
                    "commentText": "It’s being replaced by internet television and the shitty ads will come back:( And the price will skyrocket and the bundles will bundle.",
                    "commentAuthor": "u/flekkzo",
                    "commentReplies": []
                },
                {
                    "commentText": "We already have multiple paid streaming services with ads, and I continue to refuse to fund them, but people evidently don't care, way too many people willing to pay for 6 streaming services, and 3 of them have ads.",
                    "commentAuthor": "u/Zargawi",
                    "commentReplies": []
                },
                {
                    "commentText": "Seriously it’s just come full circle and we are basically back to how it was with cable lol. “History doesn’t repeat but it often rhymes” I think Mark Twain said that if I’m not mistaken",
                    "commentAuthor": "u/13pts35sec",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Same question in 1996, answers?\n",
            "commentAuthor": "u/Puzzled_Reference_76",
            "commentReplies": [
                {
                    "commentText": "A positive one: the hole in the ozone layer.  In 1996 it was just starting to stabilize and has since become smaller than it was when we first discovered it in 1982.",
                    "commentAuthor": "u/NS8VN",
                    "commentReplies": []
                },
                {
                    "commentText": "it's growing again now",
                    "commentAuthor": "u/Scaulbielausis_Jim",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Apple's fancy charging adapters\n",
            "commentAuthor": "u/Visible-Field2311",
            "commentReplies": [
                {
                    "commentText": "It might happen sooner than you think.  The EU just mandated a single standardized Smart Phone Charger.  Android already changed to the industry neutral USB-C adapter, but it looks like Apple will have to do this too, now.",
                    "commentAuthor": "u/WatchingInSilence",
                    "commentReplies": []
                },
                {
                    "commentText": "My wife has a new ipad air, it came with a USB-C charger. Pleasantly surprised.",
                    "commentAuthor": "u/Oswaldofuss6",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah, my 2019 MacBook Pro only comes with a USB-C charger. It's standard for Apple now, except their phones.",
                    "commentAuthor": "u/Ya-Dikobraz",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The Rolling Stones.\n",
            "commentAuthor": "u/CubaGoodingIII",
            "commentReplies": [
                {
                    "commentText": "I don’t think Keith Richards has been really alive for quite some time. Just a walking guitar playing zombie",
                    "commentAuthor": "u/comicsemporium",
                    "commentReplies": []
                },
                {
                    "commentText": "No, Keith is going to outlive all of us. When the Aliens show up in a thousand years to investigate what's left of a world devastated by nuclear apocalypse, he'll be the one who tells them our tale",
                    "commentAuthor": "u/TheChainsawVigilante",
                    "commentReplies": []
                },
                {
                    "commentText": "incoherently, though, and with a rheumy cough",
                    "commentAuthor": "u/OnSiteTardisRepair",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Large Swaths of the internet.  Archive while you can folks.\n\nEdit 1: To explain a bit since so many are asking. This has already happened before and continues to happen. Many old websites do no longer exist from the web of old. Whether it be corporations that shut things down, people who no longer run their little own websites,  or the consolidation of the web which has led to smaller sites being killed in some manner over the past 25 years.\n\nThink of all the things that have been removed or changed over the past 25 years of the internet. How much do you currently use that you think is going to survive the next 25? You can't guarantee most things are going to still be around.\n\nSome corporations and things that were once popular aren't anymore and get shut down entirely. Think about how popular Vine was for a time and now everything that wasn't saved and no one has direct access to is effectively gone.\n\nMega-Corporations such as Google shut down their less profitable aspects all the time. There are numerous discontinued services and programs that they once ran.\n\nThink of the millions of websites, games, animations that weren't converted to anything, that weren't saved by anyone else, and are just gone or have portions unusable when Adobe Flash shuttered its doors for good in 2020. Things such as Flashpoint, which saved a great many thousands of things, certainly most of the popular works, ultimately saved so little comparably to what was out there.\n\nThings that were once popular don't last forever and since it's not profitable for any corporation to want to archive this sort of material for any lengthy period of time it's up to the users of the internet to do it themselves. If you don't save the thing you love, there's no guarantee anyone else will.\n\nAnother thing: YOUR HOME TAPES. Tapes degrade and you probably aren't storing them the best. They will and have been losing quality over the years. Some day they simply won't work at all.\n\nIf you got any you haven't transferred to another platform, do it.  The best time to transfer your tape has always been Right Now for quite some time and that's how it will continue to be in the foreseeable future. If you have older relatives with tapes offer to do it for them. Odds are they don't know this is going to happen to their tapes, a lot of people don't.\n\nYou don't want records of your family's past to be gone forever, memories recorded that can no longer exist.\n\nThere are fairly cheap capture cards you can buy so you can hook up your VCR to your computer then record it directly onto your PC. Some come with their own software you can use, but you can always just use OBS (Open Broadcasting Software) or something similar as well. It's not that super complicated but if you struggle online guides exist and are fairly easy to find.\n\nOr you go the route of copying it to a DVD disc should you have the materials and technology on hand. Which you can then store/also put on your PC or an external drive somewhere. You can even make multiple copies if you're worried about losing such things, in fact, I recommend it if you can.\n\nIf you find yourself struggling to do so, there are always professionals you can pay to do it for you, though it will cost you quite a bit depending on how many tapes you have and what you need to preserve.\n",
            "commentAuthor": "u/Rhea_33",
            "commentReplies": [
                {
                    "commentText": "Whoever once said the internet was forever never really cared about niche content.",
                    "commentAuthor": "u/fish312",
                    "commentReplies": []
                },
                {
                    "commentText": "now my uncle with a basement full of array of hard disks makes sense in a wayi really hope he isn't hoarding some kind of weird porn.",
                    "commentAuthor": "u/ArchieAII",
                    "commentReplies": []
                },
                {
                    "commentText": "I hate to break it to you... But he's definitely hoarding some weird porn.",
                    "commentAuthor": "u/I_FAP_TO_TURKEYS",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "WWII vets/Holocaust survivors. Which will probably make it that much easier for deniers. History repeats itself 😕\n\nedit: I didn’t say history will repeat itself, I said history repeats itself. As in present tense. As in right now. See the comments by myself and others.\n",
            "commentAuthor": "u/Ambitious-Bear1382",
            "commentReplies": [
                {
                    "commentText": "My great uncle is 99. He was shot down in a B17, parachuted into a Dutch beet field and hid there until the Germans gave up looking. Dutch underground kept him safe for three weeks, handed him off to the Belgians, who got him to England for repatriation. He was sea kayaking until about 5 years ago. He's still mentally sharp but is starting to have health issues. He says thank God he can drink wine with thickener added.",
                    "commentAuthor": "u/Draano",
                    "commentReplies": []
                },
                {
                    "commentText": "My grandma is 97 and he was a medic. His second wife just passed away but luckily he is still pretty sharp too!Edit: grandpa not grandma",
                    "commentAuthor": "u/Ambitious-Bear1382",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My stamina\n",
            "commentAuthor": "u/istubbedallmymytoes",
            "commentReplies": [
                {
                    "commentText": "Must be nice having stamina",
                    "commentAuthor": "u/ButterPuppets",
                    "commentReplies": []
                },
                {
                    "commentText": "i hate having low constitution/vitality. made a bad build early on by dumping everything into spirit and now i cant afford a respec.",
                    "commentAuthor": "u/Illidariislove",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Australians,  I feel like the emus are about to strike you guys again.\n",
            "commentAuthor": "u/whatnameisnttaken098",
            "commentReplies": [
                {
                    "commentText": "Who says we're only going to strike Australians?",
                    "commentAuthor": "u/SeeYouEmu",
                    "commentReplies": []
                },
                {
                    "commentText": "You fiendish bastards",
                    "commentAuthor": "u/LeeNorthbrook",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Telephones\n\nPayphones\n",
            "commentAuthor": "u/PopRevolutionary1475",
            "commentReplies": [
                {
                    "commentText": "Don’t even remember the last time I saw a payphone",
                    "commentAuthor": "u/comicsemporium",
                    "commentReplies": []
                },
                {
                    "commentText": "I had to take a picture of a derelict payphone box, it was atmospheric.",
                    "commentAuthor": "u/Downstream03",
                    "commentReplies": []
                },
                {
                    "commentText": "I assume you took the picture on your smart phone, which is poetic in a way",
                    "commentAuthor": "u/SolidBones",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Well someone has probably said this already but,newspapers,not many people buy them these days\n",
            "commentAuthor": "u/lemonfrog__",
            "commentReplies": [
                {
                    "commentText": "Strange thing; My last company has a wealthy client buying up newspapers.  Think he owns 8 now?  Kept them in business and kept them profitable.  No idea how he does that.",
                    "commentAuthor": "u/shalafi71",
                    "commentReplies": []
                },
                {
                    "commentText": "Targeted ad revenue and creative accounting to conceal the real income stream.",
                    "commentAuthor": "u/TheTalentedAmateur",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "WWII veterans and Holocaust survivors\n",
            "commentAuthor": "u/Ranger176",
            "commentReplies": [
                {
                    "commentText": "I remember, as a kid in like 1990 or 91 I knew a WWI get. There are none of them left now.",
                    "commentAuthor": "u/JacobDCRoss",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah, I definitely remember meeting some WWI vets at random family functions in the 80s. Not many though, maybe two I think.",
                    "commentAuthor": "u/redditor_since_1977",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "privacy in our digital life\n",
            "commentAuthor": "u/mixedeyes12",
            "commentReplies": [
                {
                    "commentText": "This has been way gone.",
                    "commentAuthor": "u/darthspacecakes",
                    "commentReplies": []
                },
                {
                    "commentText": "It's the most concerning one. The prevealnce of digital ID and shadow profiles is so concerning with how lax privacy is.",
                    "commentAuthor": "u/LunaMunaLagoona",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Toilet paper. We will figure out how to use the three shells.\n",
            "commentAuthor": "u/Mr_Jack_Flack",
            "commentReplies": [
                {
                    "commentText": "He doesn't know how to use the three sea shells.",
                    "commentAuthor": "u/gibson6594",
                    "commentReplies": []
                },
                {
                    "commentText": "What if “3 seashells” is just the winning company in the bidet wars",
                    "commentAuthor": "u/broadwayallday",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Clint Eastwood\n",
            "commentAuthor": "u/LaccusBacchus",
            "commentReplies": [
                {
                    "commentText": "Ironically he's always played Old Man Eastwood since the late 80's.",
                    "commentAuthor": "u/Randym1982",
                    "commentReplies": []
                },
                {
                    "commentText": "He's been Old for longer than he was young",
                    "commentAuthor": "u/jleonardbc",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Your youth and most likely your parents...  dont take either for granted today.  I'm 49 and I know things.\n",
            "commentAuthor": "u/volt1102",
            "commentReplies": [
                {
                    "commentText": "As a millennial with parents who had me pretty late, I felt this. They weren’t perfect parents, but losing either one of them would be a somber experience. Thanks for the reminder.",
                    "commentAuthor": "u/TheWalkingDead91",
                    "commentReplies": []
                },
                {
                    "commentText": "I'm a millennial and my dad was born in 1941.  He died about 2 years ago from Parkinson's.  I'm not ready to lose my mom quite yet.",
                    "commentAuthor": "u/alblaster",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Reddit. All websites like this die eventually.\n",
            "commentAuthor": "u/Beginning-Gift8421",
            "commentReplies": [
                {
                    "commentText": "We’ll shit how am I gonna be able to check this post for accuracy",
                    "commentAuthor": "u/byproduct0",
                    "commentReplies": []
                },
                {
                    "commentText": "Grab some popcorn and sit and scroll reddit til it doesnt work",
                    "commentAuthor": "u/399men",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I have this working theory that as of 2021 the singer Elvis is just starting to be culturally forgotten. \n\nWhen I was younger I used to see Elvis references every now and again. He was pretty huge I guess, even though he was way before my time. Now I swear it has been years since I’ve heard or seen him referenced. \n\nTo test this theory I ask people if they ‘remember’ Elvis, and I get the total ‘ ohhh yea , Elvis’ that you might get from some obscure show from the 90’s.\n",
            "commentAuthor": "u/canal_banal",
            "commentReplies": [
                {
                    "commentText": "I think it's from the Silent Generation dying out. The Beatles, Led Zeppelin, Queen, etc. are still culturally relevant because of the large number of Boomers still alive. Elvis is fading due to silent generation dying out.The last major Elvis reference I can think of was Fallout New Vegas and they didn't even use his music.",
                    "commentAuthor": "u/NYRangers1313",
                    "commentReplies": []
                },
                {
                    "commentText": "College kids right now are cycling through the zeppelin, stones, Floyd, Ramones, king crimson, etc album art shirts. It's finally become grandpa music. Even the classic rock stations have transitioned nearly entirely to 80s hair metal instead of the older stuff. I guess the next generation is gonna be wearing Ratt tees.",
                    "commentAuthor": "u/Sad_Lengthiness_6700",
                    "commentReplies": []
                },
                {
                    "commentText": "Man classic rock stations are playing Green Day and other 90s rock constantly these days 😭",
                    "commentAuthor": "u/OmgItsDaMexi",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "A couple billion people.\n",
            "commentAuthor": "u/fishyeye",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Queen Elizabeth\n",
            "commentAuthor": "u/aroach1995",
            "commentReplies": [
                {
                    "commentText": "You'll gonna be cursed for this",
                    "commentAuthor": "u/Shynlord-",
                    "commentReplies": []
                },
                {
                    "commentText": "It’s treason to plan or imagine the death of the monarch. Off with your head !",
                    "commentAuthor": "u/elizabeththeworst",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "DVds\n",
            "commentAuthor": "u/ObviouslyaKelly",
            "commentReplies": [
                {
                    "commentText": "People will still collect them, there are people who still collect VHS tapes.",
                    "commentAuthor": "u/Wisconsinmann",
                    "commentReplies": []
                },
                {
                    "commentText": "And cassettes",
                    "commentAuthor": "u/agiro1086",
                    "commentReplies": []
                },
                {
                    "commentText": "Cassettes are actually widely used in prisons",
                    "commentAuthor": "u/canal_banal",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The Amazon rainforest\n",
            "commentAuthor": "u/Usual_Nothing4058",
            "commentReplies": [
                {
                    "commentText": "Don't worry it's going to be replaced by the \"Amazon\" rainforest.",
                    "commentAuthor": "u/coryhill66",
                    "commentReplies": []
                },
                {
                    "commentText": "Amazon DRAIN forest",
                    "commentAuthor": "u/Bebe_Bleau",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The Maldives\n",
            "commentAuthor": "u/zipmygoose",
            "commentReplies": [
                {
                    "commentText": "Why is this?",
                    "commentAuthor": "u/TDoubs",
                    "commentReplies": []
                },
                {
                    "commentText": "The Maldives are a small independent island chain off the coast of India. Their average elevation is 1.6 meters (5 feet) above sea level.With rising sea levels - while the islands will certainly still exist in 25 years - in 50 years the islands will face crisis as the seas truly begin to encroach upon the coasts, and in 100 years, half the country will be underwater. Lots of people will be forced to move and may become climatic refugees.",
                    "commentAuthor": "u/Venboven",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}