{
    "question": "What’s one unsolved mystery you’d like to see solved before you die?",
    "questionAuthor": "u/bennnnnnieandthejets",
    "arrayAnswer": [
        {
            "commentText": "Are we alone in the universe?\n",
            "commentAuthor": "u/Rylof",
            "commentReplies": [
                {
                    "commentText": "I can’t believe more people didn’t want to know this. This would be one of my top questions. But the question I want the answer to the most is how the universe came to be and why there is something rather than nothing.Edit: I stand corrected, lots of people want to know this, the original comment was pretty far down when I saw it and I was shocked that I hadn’t seen more comments asking questions like that. I was expecting for everyone to ask existential type questions when I first saw this post. Also I forgot to mention that I really want an answer to the mind-body problem.",
                    "commentAuthor": "u/fish_penis",
                    "commentReplies": []
                },
                {
                    "commentText": "Same, like existence itself does not make sense at all.Like why does the universe exist in the first place?So interesting. This is the question that I want its answer the most, too.",
                    "commentAuthor": "u/ArtificialThinker",
                    "commentReplies": []
                },
                {
                    "commentText": "The Big Bang makes perfect sense until you start wondering, ok…. But where did the stuff that caused the Big Bang come from, and where did the stuff that made the Big Bang possible. The question goes on forever. Nothing explains how the most simple foundations of existence just came to be and eventually pooped us out.",
                    "commentAuthor": "u/redbull21369",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Antimatter. Why is the universe almost entirely matter, when equal amounts of matter and antimatter should've annihilated each other? Where is the missing antimatter? Is there a slight difference between matter & antimatter particles that causes matter to last longer? Are there places in the universe primarily made of antimatter instead of matter, well outside the observable universe?\n",
            "commentAuthor": "u/andret14",
            "commentReplies": [
                {
                    "commentText": "Of all the open problems in Physics, this is the most pressing and deceptive one. We don't think about it much, we just take it for granted. Astronomers are looking at galaxies millions of lightyears away, and we just know it's made of usual matter.Personally, I think Alan Guth camp might have it right in the most realistic sense: there might be \"domains\" within the really huge Universe, where one form of matter dominates over other, each domain separated by a high-energy barrier of some sort. We have so far only gone as far as to observe things within our \"domain\". These barriers could've expanded to cosmic size during inflation era (which is a very reasonable theory at this point).",
                    "commentAuthor": "u/attofreak",
                    "commentReplies": []
                },
                {
                    "commentText": "Is there a specific reason that these domains would be separated by some kind of high-energy barrier, specifically?  Could they not just be separated by, well, empty space?  I get that space itself isn't exactly empty but I'm curious what the mechanism is for a barrier being needed.  Just to avoid accidental collision and annihilation?  At that point it almost feels artificial to have what amounts to electric fences ringing different parts of the cosmos, but I may be misunderstanding your point.",
                    "commentAuthor": "u/JMW007",
                    "commentReplies": []
                },
                {
                    "commentText": "Matter and antimatter annihilate when they meet, and release energy (light) equivalent to their mass. These hypothetical barrier would form in the junction of matter and antimatter domain because of this phenomenon.",
                    "commentAuthor": "u/galaxie18",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "[removed]\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "I've never had anyone I know disappear that way.I did have a sister who played a principal role in a reenactment on Unsolved Mysteries, and I recall how terribly heartbroken the family of the missing person was when I met them, and I'm truly, honestly sorry that you're having to go through that kind of pain.",
                    "commentAuthor": "u/FearGunner",
                    "commentReplies": []
                },
                {
                    "commentText": "Thank you. I am the least affected having only known him about 2 months (yet was someone I connected with instantly). The hardest part has been watching my wife and her family cope with his disappearance.I feel for anyone that doesn't have an answer to a trauma in their life. Its hard to describe the desperation for answers when someone in your life goes missing or worse, without any clue or hint as to what happened, or where they could be.",
                    "commentAuthor": "u/nothingwascool",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "MH 370.  I'm sure they'll eventually find the wreckage and have a better idea exactly what happened but even today they're still finding old WWII ships and even ships older than that.  So I hope that it's found before I leave because I do wonder what happened to that plane.  I just hope it's a matter of years or decades, and not  centuries.\n",
            "commentAuthor": "u/llcucf80",
            "commentReplies": [
                {
                    "commentText": "Let me introduce you to u/Admiral_Cloudbergr/AdmiralCloudberghttps://admiralcloudberg.medium.com/call-of-the-void-seven-years-on-what-do-we-know-about-the-disappearance-of-malaysia-airlines-77fa5244bf99EDIT: Fixed links. My apologies.",
                    "commentAuthor": "u/Inle-rah",
                    "commentReplies": []
                },
                {
                    "commentText": "7 years already? I remember being on the couch with the flu, checking for updates between fever dreams like it was yesterday.",
                    "commentAuthor": "u/xofeatherxo",
                    "commentReplies": []
                },
                {
                    "commentText": "You're still on the couch. The fever is worse than we thought.",
                    "commentAuthor": "u/DoctorStumppuppet",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I just want to know who DB Cooper is. I know it's lame but I'm curious\n",
            "commentAuthor": "u/dcsmith707",
            "commentReplies": [
                {
                    "commentText": "This was posted by u/sanctii in another thread. I did not write it but I think it’s a very compelling theory. I’ll link the og comment down below. My money is on Ted Braden. If you could invent a DB Cooper suspect you'd invent Ted Braden. Check it out:\n- Braden was a paratrooper in WWII (jumped on D-Day with the 101st at age 16), Korea, and Vietnam.\n- He won multiple international skydiving competitions while a member of the Army.\n- 911 logged jumps with the military and was a pioneer of HALO jumping\n- Was recruited to be a team leader in the MACV-SOG's. This was the predecessor to Delta Force and was a multi-service covert military special force run by the CIA.\n- Led squads on covert jumps into Laos, Cambodia, and Northern Vietnam from 64-67.\n- Did many of these jumps into enemy territory off the aft stairs of....that's right...Boeing 727's. At the time of the skyjacking, the only people who knew this could be done were those involved in these MACV-SOG missions and some employees at Boeing.\n- Was always bitching about how he and his fellow soldiers weren't paid enough. Was always coming up with schemes to make/extort/steal money while in the service.\n- In 1967, he heard about how people were looking for mercenaries to fight in the Congolese Civil War and how well they would be paying, so he went AWOL from Vietnam and made his way to the Congo. The CIA went after him and eventually found and arrested him in the Congo.\n- Was imprisoned at Fort Dix for a very brief time and mysteriously was never convicted of anything, nor tried, and was merely given an honorable discharge and told that he couldn't re-enlist in the military.\n- Once released he tried to go overseas to be a mercenary again and found out that his name had been blacklisted by the CIA and so he wasn't allowed to leave the country to be a mercenary.\n- Not knowing how to make a living other than by being a soldier, he resorted to being a truck driver. His trucking company was stationed out of Vancouver (interesting).\n- When the Cooper hijacking happened, several members of the military contacted the FBI and essentially said \"this can only be Ted Braden\"\n- Braden had no family, so there wasn't anyone around to in retrospect said \"hey, Dad wasn't around during Thanksgiving 1971\".\n- His alibi was that he was driving his truck.\nOn the plane:\n- Cooper was by everyone who remembered him as being \"middle-aged\" or \"mid-40's\". Braden was 44.\n- Cooper was described as being 5'8-5'10 and slight. Braden was 5'9 and 150lbs.\n- Cooper was described as being somewhat olive skinned and swarthy. Braden's mother's side were Sicilian.\n- Cooper was extremely calm the entire time. The only time he showed any emotion was when he was arguing with the pilots because he wanted to take off from Seattle with the stairs down. They didn't think it could be done. Cooper told them it absolutely could be done and he demanded it be done. The pilots simply refused to do so, thinking it would cause the plane to crash, and Cooper eventually relented. Braden was described by many of his military colleagues and commanding officers as one of the calmest people under fire you could imagine.\n- Cooper smoked Raleigh cigarettes and so did Braden.\n- Cooper was described by both flight attendants who spoke with him as having either a midwestern accent or no accent. Brayden was from Ohio.\n- Cooper chose the military parachute over the more modern sport parachute.\n- When asked by the flight attendant why he was doing this, he replied \"I don't have a grudge against your airline, Miss, I just have a grudge.\" Braden certainly had a grudge against the government for blacklisting him from the only work for which he was skilled at: being a soldier.\n- The alias \"Dan Cooper\". \"Dan Cooper\" was the name of a popular 50's and 60's French language comic book series. The hero, Dan Cooper, skydived into areas to fight the bad guys. What is a country whose official language is French? The Congo. If Braden was Cooper, then it's extremely plausible that he was exposed to this comic series while serving in the Congo.\nFollowing the hijacking:\n- Recent investigation shows that in 1972, despite being a truck driver, he bought his mother a new car as well as a new car for himself, and that he was living in a freaking penthouse in Manhattan.\n- Was arrested in the mid-70's for a major racketeering job in the trucking industry, but like his mysterious release from going AWOL, he was once again given a slap on the wrist and the charges were dropped.\nHis personality:\n- He was always a loner and never had close friends in his life. Men he served with would later say that when they would go to the bars, Braden would sit at the end of the bar by himself just seeming to sulk.\n- A Green Beret who served with him stated \"Braden is among those professionals who appear to have a secret death wish coupled with well-trained instincts for survival. He continually placed himself in unnecessary danger but always managed to get away with it.\"\n- Another Special Forces member stated \"he was the perfect combination of high intelligence and criminality\"\n- Military tests that he took for entrance into the MACV-SOG's indicated that he likely possessed a genius level IQ.\nCouple things to consider:\n- Jumping out of a freaking jumbo jet is no small potatoes. Many of the famous Cooper suspects had been static-line paratroopers in WWII or even had no known skydiving experience at all. You'd need to have mega balls to jump out of a jet and also have the skill set to do it. Perhaps most critically, you'd need to know that it could even be freaking done in the first place! There were several Cooper copycats who successfully pulled off similar skyjackings of 727's in the months after Cooper, but to be the guy who first did it? That takes someone special.\n- The suitcase bomb. While this is a common trope you see in movies these days, it wasn't so in 1971. The whole concept of a suitcase bomb required some ingenuity.\n- His calmness is especially noteworthy when you consider that the subsequent copycats were nervous wrecks during their skyjackings, despite being badasses in their own right. Richard McCoy won a Distinguished Flying Cross and a Silver Star in Vietnam as a chopper pilot. He literally flew hundreds of sorties as a chopper pilot. Yet during his skyjacking he was noted (even before he started the skyjacking) for being fidgety and sweating and breathing heavy. Robb Heady also successfully pulled of a 727 skyjacking. He was a 21 year old Vietnam paratrooper who served two tours in the thickest fighting in Vietnam and yet he later described himself as being barely able to breath during his skyjacking. Cooper, on the other hand, sat calmly for five hours, smoking cigarettes and drinking his bourbon and coke, with one hand on the detonator (the flight attendant lit his cigarettes for him). It's also worth noting that none of the copycats gave any specific instructions to the pilots on how to fly the 727. They just jumped out with the jet going full speed and it nearly killed two of them. What Cooper told the pilots wasn't public knowledge at the time. Cooper told them to fly at 180 knots, wheels down, with flaps at 15 degrees, and at 10,000 feet. That's mighty specific and strongly indicates that Cooper had knowledge of how best to safely parachute out of a 727. Cooper was also the only one to not be caught. Getting caught on his missions with Spec Ops meant certain death. This is a man who knew how to escape situations and blend into his environment.\nOccam's Razor would point toward Ted Braden being DB Cooper: One of the military's most experienced skydivers is kicked out of the service and isn't allowed to pursue a lucrative career as a mercenary so he uses the skills that the military taught him to ransom $200k from the government.OG comment",
                    "commentAuthor": "u/Derpicusss",
                    "commentReplies": []
                },
                {
                    "commentText": "Not doubting op but just found this funny.",
                    "commentAuthor": "u/All_hail_Korrok",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah I took it to mean wife and kids, people that would see him daily and notice an absence",
                    "commentAuthor": "u/HewchyAV",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I'd like to know what happened to Andrew Gosden.\n\nA 14 year old boy left home in Yorkshire one morning in 2007 dressed in his school uniform, and then withdrew all his money from his bank account. He went back home after his parents had gone to work and changed out of his uniform, then went to the train station and bought a one way ticket to London (about two hours away by train). There is CCTV footage of him leaving King's Cross station, but that's the last time he was seen.\n\nHe didn't tell his parents he was planning to go to London, and it's never been established why he went there. I'd love to find out he's actually ok, or even if not for his parents to finally find out what happened to him.\n",
            "commentAuthor": "u/kank84",
            "commentReplies": [
                {
                    "commentText": "It broke my heart reading his parents refuse to change the locks of their house in case he comes back home.",
                    "commentAuthor": "u/IrritatedMango",
                    "commentReplies": []
                },
                {
                    "commentText": "I remember watching a true crime show where parents kept their porch light on for years for their missing daughter, so she's not scared when she comes back. Years later they found out she was murdered. The end scene was them finally turning off the light, I sobbed like a baby",
                    "commentAuthor": "u/phallicist",
                    "commentReplies": []
                },
                {
                    "commentText": "Oh my god, I'd ask you for a source so I can go watch that but I'm not sure my heart could take it.",
                    "commentAuthor": "u/LittleRitzo",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The disappearance of Willian Tyrell, basically a 3 yr old kid was kidnapped in his front yard after the foster grandma went inside for a glass of water and she heard screaming from the sister and when she ran out he was gone. This happens around 2014 and I still remember his face on the news in his Spider-Man costume.\n",
            "commentAuthor": "u/blazeforever1234",
            "commentReplies": [
                {
                    "commentText": "This one still gets me. I often think of William Tyrell and what his family--foster and biological--must go through every waking moment. Especially now I'm a mother of a toddler.",
                    "commentAuthor": "u/TastesKindofLikeSad",
                    "commentReplies": []
                },
                {
                    "commentText": "I live with my sister, brother-in-law, and my niblings. When he was about 3 my nephew went missing for like 15 minutes, and my sister woke me up screaming that they couldn't find him. Still the worst way I've ever woken up, and he was only \"missing\" for a short time (he was hiding in the house because he had gotten a popsicle when he shouldn't, and didn't want to get in trouble)",
                    "commentAuthor": "u/LovesToTango",
                    "commentReplies": []
                },
                {
                    "commentText": "My kid did the same thing and I nearly had a stroke. I ran around the house screaming his name, I went outside and called for him (our yard is wooded so it's very possible that he could have gone into the woods even though he knows he's not allowed to go without a parent). I opened closets, checked bathtubs, the whole nine yards.I was on the verge of calling 9-1-1 when he popped out from under a blanket and with the biggest grin on his face told me that I couldn't find him.We had a very serious conversation about how if the other person doesn't know you're hiding then they are going to assume you're MISSING. Which is way worse and to please tell me going forward when he's going to hide so I don't worry.",
                    "commentAuthor": "u/Liapocalypse1",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My best friend's little brother disappeared from an army base last July. Good or bad, I'd like to know what happened to Pvt. Richard Halliday.\n",
            "commentAuthor": "u/bgkh20",
            "commentReplies": [
                {
                    "commentText": "I was born and raised in that area. I hate to say it, but I would put money on him being dead and buried somewhere on Ft. Bliss. That’s also the location where the young asylum-seeking kids have been detained/disappeared from govt custody. There’s a lot of sketch shit going on at Ft. Bliss.",
                    "commentAuthor": "u/throwawaywahwahwah",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Dude, the most dangerous part about the army is being on base. Seriously. Today I was near Fort Drum at a gas station, and I watched this army guy stare at two women like steaks or something. And then he was FOLLOWING them. I pulled them aside and told them how sketchy he was being. He was so obvious, they had already noticed.",
                    "commentAuthor": "u/EhndlessSl0th",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The Alps Murders as they’re known in the UK. \n\nAn English family on holiday in France are assassinated with an old pistol with accuracy that points towards a professional hit. \n\nA cyclist is found murdered in the same lay by too by the same weapon. \n\nThe assassin thought they had tied up all loose ends until after 8 hours on the scene the French police found their 4 year old daughter hiding under her dead mothers legs. \n\n9 years later there’s still no clue over who or why they were all murdered. \n\nGQ did the best article about it \n",
            "commentAuthor": "u/Shystakovich",
            "commentReplies": [
                {
                    "commentText": "This year, the investigation of the alp murders, or \"la tuerie de Chevaline\" as we call it, was re opened after some searches in a different case that sounds like the plot of a polar. A CEO, Murielle Millet, ordered a hit on a syndicalist. Members of the Free Mason lodge called Athanor actually organised the hit (they confessed and are incarcerated), using as hitmen two agents from the DGSE, the French secret services. It revealed a few other successful and unsuccessful hits, all having this Athanor lodge as a common denominator.After the searches, they reopened the alp murders case, so I guess its safe to speculate that it was most probably an organised hit gone wrong since a cyclist saw it and subsequently got shot.",
                    "commentAuthor": "u/rpty18",
                    "commentReplies": []
                },
                {
                    "commentText": "This is random but I will never forget arguing with an old business associate after threatening to go public with some info. Some situations call for a little leverage. He looked at me very seriously and reminded me he was a freemason. I found it hilarious at the time. We did however work it all out. Reading this, was the guy trying to tell me I was about to get myself assassinated? Lol",
                    "commentAuthor": "u/Smokey71321",
                    "commentReplies": []
                },
                {
                    "commentText": "Probably reminding you that he has a special relationship with other people who you yourself may unbeknownst have business relationships with. A former Mason friend of mine described a 'chain of whispers' by which members may discredit people.Had you not worked things out, you may suddenly have found your lead supplier was taking his contract elsewhere, or contractors you wished to hire would inexplicably refuse your business.",
                    "commentAuthor": "u/lalozzydog",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "What are the Mormons keeping in their vault that’s surrounded in granite and heavily guarded?\n",
            "commentAuthor": "u/klein_gang19",
            "commentReplies": [
                {
                    "commentText": "50/50 money or some Radom thing they think is magic.I’m really not trying to shit on the Mormons (too much) but you start reading up on Joseph Smith and it’s rather fucking amazing Mormonism ever caught on.",
                    "commentAuthor": "u/little_gnora",
                    "commentReplies": []
                },
                {
                    "commentText": "Mormonism is just the Scientology of the 1800s and I cannot be convinced otherwise.",
                    "commentAuthor": "u/Ryoukugan",
                    "commentReplies": []
                },
                {
                    "commentText": "Mormonism is steampunk Scientology but exponentially less cool than that sounds",
                    "commentAuthor": "u/VivecsSplitDick",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "What happened to the Beaumont Children. Changed the way parents in my home town thought about letting their kids out on a weekend forever.\n",
            "commentAuthor": "u/Naerose_Eiren",
            "commentReplies": [
                {
                    "commentText": "Ugh I can’t imagine the feeling they had when the kids didn’t show up at 12…then at 2….then they couldn’t find them at the beach. That crescendo of panic is absolutely miserable. So sorry for them.Edit;Oh man, if those letters weren’t a hoax I don’t know how the parents could live with themselves ",
                    "commentAuthor": "u/AtomicTanAndBlack",
                    "commentReplies": []
                },
                {
                    "commentText": "They were confirmed to be a hoax by a teenager",
                    "commentAuthor": "u/NichoBesty",
                    "commentReplies": []
                },
                {
                    "commentText": "Damn that kid earned his place in hell early...",
                    "commentAuthor": "u/DownvoteEvangelist",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I would love to see how a blackhole works before I die. We know it sucks in all the matter to the singularity, but we don't know where it goes from there. Finding how a black hole works will change the understanding of the univerese itself. I hope it happens during my life time\n",
            "commentAuthor": "u/throawaybitch",
            "commentReplies": [
                {
                    "commentText": "I imagine they're creating new universes. Sort of how the idea behind the big bang suggests our universe came from a speck the size of an atom.. perhaps that speck was the outlet of another universes black hole.Signed,\nA stoned redditor",
                    "commentAuthor": "u/nothingwascool",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "These were the kind of answers I was hoping for lol. Not who was x murderer.",
                    "commentAuthor": "u/russellzerotohero",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Where did the Nazis stach the entire amber room from St Petersburg palace\n",
            "commentAuthor": "u/2thNurse",
            "commentReplies": [
                {
                    "commentText": "I used to work as a guide at a castle, where it was believed to have been hidden. Every once in a while, a tourist would ask about it. One day, a small group even managed to sneak away from the tour and hide for the night at the castle, searching for it. No success though.",
                    "commentAuthor": "u/lidskemasicko",
                    "commentReplies": []
                },
                {
                    "commentText": "Hilarious. Sneaky fuckers. Must have been fun",
                    "commentAuthor": "u/RestaurantIntrepid81",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Who the hell killed Jeffrey Epstein, and who were his clients. How we don't know the answer to this, and how no justice has been served truly boggles my mind.\n\nEdit: to clarify I mean justice served to his clients were a part of the whole scheme, There's clearly some big players involved that have the power to cover up all their tracks. This just goes to show how corrupt the U.S. system is.\n\nEdit: First off, thank you the awards, this is my first post that has blown up.\n\nSecondly to those of you saying there is no conspiracy here and that he killed himself, well maybe so.... but we know that he was involved it a sex trafficking ring. We even know several people who were on his flight logs yet the public hasn't gotten any closure on a thorough investigation into any of these people. Ghislaine Maxwell said she has names of royalty, and politicians. Everything I see points to a catacomb of misdirection and corruption.\n",
            "commentAuthor": "u/Old_Jellyfish3643",
            "commentReplies": [
                {
                    "commentText": "There are two parties that control America. And key figures from both would have been implicated. No way in hell the truth will be heard for a generation or two.",
                    "commentAuthor": "u/MikeLeRoi",
                    "commentReplies": []
                },
                {
                    "commentText": "Ever. The Kennedy assassination information is still not released. Maybe someday, in a few more generations.",
                    "commentAuthor": "u/Canadian_Infidel",
                    "commentReplies": []
                },
                {
                    "commentText": "And they'll be disappointed at how mundane it all is.  The problem with conspiracy theories is that they build a better narrative than the truth.The truth is, shit happens.  The powers that be are nothing more than a smokescreen to cover up the fact that the feeling you have every day that you don't know what you're doing is felt by everyone, even those in power.  We're all making it up as we go along and sometimes we screw up.D.B. Cooper likely died in the forest and no one will find his body, or that money.Kennedy was shot by a guy in a book depository.That little girl was killed by someone close to her and the cops bungled the investigation.The plane went down in the ocean and surprise, the ocean is fucking huge.All the people in power are just as dumb as you or I and most often make dumb decisions.  The difference is their dumb decisions ripple in a much bigger pond.  If I forget to pay a bill, my lights get shut off.  If a world leader forgets a bill, people die.We like to make connections to make sense of this chaotic world but the truth is the world is under no obligation to make sense to you.",
                    "commentAuthor": "u/Byrdman216",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Delphi Murders. That video is too compelling for bridge guy to not be found.\n",
            "commentAuthor": "u/MaleficentPicture773",
            "commentReplies": [
                {
                    "commentText": "I agree with you 100% it drives me crazy. I know they keep saying it was someone from Delphi or familiar with the area but as time goes on I really feel like it wasn't. Surely if that was the case someone would have seen something and spoken up due to it being a small town. I've heard that the hardest murders to solve are the ones that are random. Random person goes to a random area and kills a random person(s) for no reason at all. Without history, motive, etc. its near impossible to solve if there aren't any witnesses and that's what this seems like to me.",
                    "commentAuthor": "u/earth_sandwich",
                    "commentReplies": []
                },
                {
                    "commentText": "it reminds me of how every once in awhile someone on reddit will come to the brilliant conclusion that if you want to get away with being a serial killer, all you have to do is get away from your geographic location and kill people you don't know who have nothing in common with each other and you'll basically never get caught. probably some dude who had the same idea who might even still be out there killing people.",
                    "commentAuthor": "u/AaronVanDuyne",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Disappearance of Madeleine McCann\n",
            "commentAuthor": "u/jwjules",
            "commentReplies": [
                {
                    "commentText": "This is one I’d like to see answered. Did she die in the hotel room? Is she somewhere still alive not knowing who she really is? (Or even reading this right now wondering what happened to that little girl with the same eyes as her?) \nDid the parents do it? What, if anything, does the German suspect have to do with it? So many unanswered questions!",
                    "commentAuthor": "u/TerminalStorm",
                    "commentReplies": []
                },
                {
                    "commentText": "last I heard they were searching that German suspect's property and found like a hidden passage way. I thought for sure he did after that but no update on the case happened.",
                    "commentAuthor": "u/MaveInfinite",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "In 1994 I found a cinema ticket stub for Speed in my jacket pocket. I never saw Speed at the cinema, nor did I lend my jacket to anybody that had. I’d like to know where it came from so I can one day sit through the film without wondering about it.\n",
            "commentAuthor": "u/MikkiDisco73",
            "commentReplies": [
                {
                    "commentText": "You in another reality saw the movie, stashed the ticket, and wonders where it went",
                    "commentAuthor": "u/Goatlessly",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Occasionally they give you a ticket for the wrong movie",
                    "commentAuthor": "u/sourcreamus",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Isabella Stewart museum art recovered.\n",
            "commentAuthor": "u/ipelican17",
            "commentReplies": [
                {
                    "commentText": "That's a good one. I saw the documentary. One of the suggestions is that they are in a private collection or the people who stole them are dead and they are stored away some place.",
                    "commentAuthor": "u/MickeyRipple",
                    "commentReplies": []
                },
                {
                    "commentText": "I think the main theory is that the heist was done on the behest of a private collector/s.  Some of what they stole wasn't worth as much as other pieces, and they passed by and didn't steal some incredible pieces.  They had a list, they grabbed what they were hired to steal, and they left.  The works are, hopefully, stored properly with private collectors now, and will, maybe, one day be returned.",
                    "commentAuthor": "u/ClancyHabbard",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The disappearance of Amy Bradley. \n\nWe grew up on the same street and played together as kids. The loss was devastating to her family\n",
            "commentAuthor": "u/ValkyrieSword",
            "commentReplies": [
                {
                    "commentText": "Definitely agree with you on that one. Feel as though the cruise line could have done more to help her family. Also all of those people who reported sightings of her. Can’t imagine how difficult all that is for her family",
                    "commentAuthor": "u/yogagirl54",
                    "commentReplies": []
                },
                {
                    "commentText": "They TOTALLY could have. I think she was alive for a time, but is likely gone now. The what-ifs & near misses make it even harder",
                    "commentAuthor": "u/ValkyrieSword",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "[deleted]\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "It’s obvious it was the family that were in on it. The mother wrote the note. The question is what 100% went down that night.",
                    "commentAuthor": "u/trashcanland",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "I came here to say Jon Benet also...hopefully one day",
                    "commentAuthor": "u/awall89420",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Not all of the Egyptian Pyramids have been full explored, I'd like to know what's in and under those pyramids.\n\nAlso, what is hidden deep in the vaticans archives? I'd like to know that too.\n\nAnd while we're here - What about the mystery of the missing packet whenever you send something over the internet.\n",
            "commentAuthor": "u/HaroerHaktak",
            "commentReplies": [
                {
                    "commentText": "Sorry for my ignorance, what is the mystery of the missing packet? Made a few google searches and got results to amazon books and tales for kids.",
                    "commentAuthor": "u/AlanElPlatano",
                    "commentReplies": []
                },
                {
                    "commentText": "When you  'ping' an internet, you send a small amount of packets. For some reason there's always 1 packet lost during this process, and nobody can figure it out. I can't remember the actual name or terminology for this mystery, but that's basically it.That 1 packet lost isn't enough to cause issues and i'm pretty sure there's not really that much in there to begin with. It just. vanishes!",
                    "commentAuthor": "u/HaroerHaktak",
                    "commentReplies": []
                },
                {
                    "commentText": "It’s Entropy Tax",
                    "commentAuthor": "u/TooBald",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "As someone from Columbus, the disappearance of Brian Shaffer. It kills me that all these years later there still isn't a definitive answer to what happened to him. I really hope the case gets solved in my lifetime.\n",
            "commentAuthor": "u/sleeplessincolumbus7",
            "commentReplies": [
                {
                    "commentText": "There’s been so much construction on High St, I just feel like he must be under concrete somewhere. It’s very sad.",
                    "commentAuthor": "u/fridayfridayjones",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "For those who have never heard about this beforehttps://en.wikipedia.org/wiki/Disappearance_of_Brian_ShafferTbh sounds like a Netflix documentary to come",
                    "commentAuthor": "u/the_421_Rob",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "What is dark matter. Or better put: what about physics do we not understand that is causing the effects we see, that we attribute to dark matter.\n",
            "commentAuthor": "u/Brusion",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "[deleted]\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "When I was 7 or 8, the Zodiac sent a letter to our local newspaper that children were going to die on Halloween. We lived in a cul-de-sac and all the parents decided to barricade the entrance at sundown. We were only allowed to trick or treat around the cul-de-sac (like ten houses?). I think all the neighbors compensated because we ended up with the biggest haul ever. And they threw a big party at a neighbor's house with games and candied apples. Best Halloween ever. Oh, and no children died in our area.",
                    "commentAuthor": "u/susgrigs",
                    "commentReplies": []
                },
                {
                    "commentText": "You got your candy, a party, AND some scares! That's the most Halloweeny thing I've read!",
                    "commentAuthor": "u/TheRealPyroGothNerd",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I would like John Walsh to be able to find the person who murdered his son,  the reason behind CODE ADAM.. Being raised in Florida in the '80's, this story was heard so many times.  Now with what John Walsh has been doing my entire lifetime,  and currently with Gabby Petito's case,  I think he's more than earned it.\n",
            "commentAuthor": "u/MiningNoCry",
            "commentReplies": [
                {
                    "commentText": "John Walsh believes Ottis Toole killed Adam and the case is considered closed. Unfortunately Ottis Toole confessed to a lot of murders he really didn’t commit and though I haven’t read up on it in a long time, I believe he didn’t even have accurate details about the crime. It’s interesting really, I’ve read that John simply wanted it solved because Adam’s head was still in police custody after 25+ years and they just wanted to put him to rest. Absolutely tragic.",
                    "commentAuthor": "u/julieisarockstar",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "John is just such an amazing person. He took a horrific personal nightmare and saved SO MANY and brought so many to justice. I’m in awe of him and his non stop effort to help. Even as a kid I was blown away by him.",
                    "commentAuthor": "u/ZestycloseTomato5015",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The identity of my half-brother's murderer.\n",
            "commentAuthor": "u/Oh-Oh-Ophelia",
            "commentReplies": [
                {
                    "commentText": "I know the man who murdered my mother.  I am not sure it has helped me.  There isn’t a day that goes by where I don’t run through what I want to do to that human.   I hate myself for it as it wouldn’t leave me any different than him.  But it doesn’t stop me thinking it.",
                    "commentAuthor": "u/BarbequedYeti",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "Hope you get your closure friend.",
                    "commentAuthor": "u/TLC_15",
                    "commentReplies": []
                }
            ]
        }
    ]
}