{
    "question": "What is your opinion on a 30 year old dating a 19 year old?",
    "questionAuthor": "u/hazelnutmacchiato1",
    "arrayAnswer": [
        {
            "commentText": "It’s not the age gap, it’s the mind gap\n",
            "commentAuthor": "u/Fogdevil_s",
            "commentReplies": [
                {
                    "commentText": "Yeah a 40 year old dating a 29 year old is way different than a 30 year old dating someone that is 19 in most instances.",
                    "commentAuthor": "u/Actuaryba",
                    "commentReplies": []
                },
                {
                    "commentText": "The years between 18 and 23 are the first time most people have their first taste of freedom and responsibility. Everything is developing so fast and life feels like its flying. Then usually somewhere between 23 and 25 most people find their footing and understand their needs and wants.That isn't to say it cant work out between a 19 and 30 year old but successful relationships between those ages are usually outliers.",
                    "commentAuthor": "u/Keudn883",
                    "commentReplies": []
                },
                {
                    "commentText": "Yeah, that’s a transformative time in people’s lives and that life experience gap is a huge factor. When I was 26/27 I had a girlfriend who was 20/21 and things went well for a couple of years but it eventually broke down because we were just at different places.",
                    "commentAuthor": "u/BrokenArmsFrigidMom",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "This was me. I (18m) met her (30f) when I was moving into the apt she was moving out of. I was going to school and she, into assisted housing. We were together about a year, and were talking about marriage when my parents asked me to come home, alone one weekend. Stepping away helped me to see all of the possibilities. A fiery breakup ensued. Looking back, the age separation was one of the smaller issues. This was when I learned to walk away. She was done having her adventures. I needed to have my own.\n",
            "commentAuthor": "u/Boba-Fret",
            "commentReplies": [
                {
                    "commentText": "My step niece (19) started dating a late 30s doctor a few years ago and her father completely blew up about it and basically put her in chose him or family situation and no one has seen/talked to her in 2 years now. I'm glad your parents figured out a way to get you to see the light without some ultimatum Trainwreck.",
                    "commentAuthor": "u/pw76360",
                    "commentReplies": []
                },
                {
                    "commentText": "This is absolutely one of the worst things they could have done. Her family pushed her further into the relationship and now it will be harder for her to walk away, even if she wants to. Give someone room to make their own mistakes and be their own person, and support them no matter what without condoning whatever you don’t like. If you force a person to choose between being a person that makes their own choices or being a dutiful family member that does what they’re told, even in areas that should absolutely be their choice (who they care about or love), a lot of people will choose being able to live their life on their terms. If her family had told her they don’t approve, but she chooses who she’s in a relationship with, and they’ll be there for her no matter what, she may have found the relationship fizzle and had her support system and life to go back to. Instead they forced her closer to him, so now he is her support system. She’s very young and should be aloud to learn, grow, and make her own choices. I hope the best for her and I hope her father might find a way to reach out to her and ask her to forgive him for trying to control areas he has no right to. He can say he loves her and just wanted to protect her, but he understands he can’t make choices for her.",
                    "commentAuthor": "u/kjsmitty77",
                    "commentReplies": []
                },
                {
                    "commentText": "Yep they screwed up bad.. like a kid loves being obedient and doing exactly what controlling parents say..nope opposite",
                    "commentAuthor": "u/prostateExamination",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I thought it was okay when i was in my 20s but now that im on my 30s its a big no no\n",
            "commentAuthor": "u/timelesscurium",
            "commentReplies": [
                {
                    "commentText": "Agree; at 19 I might’ve thought this was okay, but at 30 I cannot imagine it.",
                    "commentAuthor": "u/papiercollant",
                    "commentReplies": []
                },
                {
                    "commentText": "I dated a 32 year old at 19.  It seemed fine then, but now I wonder what the hell either of us were thinking.",
                    "commentAuthor": "u/eejm",
                    "commentReplies": []
                },
                {
                    "commentText": "At 21 I dated someone who was 32. When we first met I thought he was 27 and he thought I was 26. It was short lived: neither of us could see it being long term. But he taught me a lot about trust and honesty and I’ll always be grateful for that. Seems I was lucky from a lot of other comments on here.",
                    "commentAuthor": "u/ruellera",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I dated someone 20 when I was 25 and even that was like drastically different. Like being an adult, and paying bills, starting a career vs someone living at home and being a full time student. It made a huge difference and even though we both eventually were on the same level. There was always something unbalanced in how we started.\n",
            "commentAuthor": "u/imfatletsprty",
            "commentReplies": [
                {
                    "commentText": "Yep 100%. I’m 30 and if I met my 19 year old self, I would probably be disgusted. The level of maturity between the two ages is so large that I can’t see how it could be a functional and healthy relationship in any way.",
                    "commentAuthor": "u/rben80",
                    "commentReplies": []
                },
                {
                    "commentText": "Oh, Facebook memories are there to remind me how much of a dumbass I was lol.",
                    "commentAuthor": "u/littlemegzz",
                    "commentReplies": []
                },
                {
                    "commentText": "I'm glad that I'm sufficiently old enough that none of the dumb things I did as a kid have been forever enshrined on the internet.",
                    "commentAuthor": "u/CuttingEdgeRetro",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I would not. But if a close friend did, I’d advise caution. Power balances and how well they relate to each other could be issues. \n\nI wouldn’t, but to each his own.\n",
            "commentAuthor": "u/CheckYourLibido",
            "commentReplies": [
                {
                    "commentText": "As a 30 y who has been recently hit on by 22 year olds I agree. I don't even understand their jokes or want to",
                    "commentAuthor": "u/outtsideyerhouse",
                    "commentReplies": []
                },
                {
                    "commentText": "One of my hockey's teammates was in this situation a couple years ago. He was around 30-33 and she was still at University, so around 20-22.It did not last. She thought that he was boring as fuck and she was always on her phone, texting, instagramming. Even when they were Netflix and chill.Would be the same for me.",
                    "commentAuthor": "u/Zemom1971",
                    "commentReplies": []
                },
                {
                    "commentText": "I remember dating someone much younger than me then having to switch to an unlimited data plan because she only replied back via text. Life never went back to people having real phone conversations",
                    "commentAuthor": "u/PharmDinagi",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "As a 29 yr old I don’t date unless people are 24-25+ \nIt’s more so maturity gap and the phase in which most gals are in. 22-24 right outta college, not really settled down yet and still partying like they’re in college etc. and don’t know what they want. I know not the same for everyone but that’s the main reason.\n",
            "commentAuthor": "u/Shiggs13",
            "commentReplies": [
                {
                    "commentText": "Agreed. I'm a 20yo guy in college and I party and chill like I'm immortal. I could not date a 25-30 year old. I would feel like a child and I would feel like getting pressured into living the 'adult life'",
                    "commentAuthor": "u/CreatureWarrior",
                    "commentReplies": []
                },
                {
                    "commentText": "[deleted]",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "I was 21 when I met my future husband wo was 32 at the time.I sold cellphones at a kiosk in the lobby of the department store at which he was store security. We started talking after someone broke into my kiosk and stole phones and I had to report the theft to security.We dated for 2 years, then got engaged for another year while I tried to get my mother to accept my choice. She wanted me to settle down with a nice Korean boy, preferably a doctor or lawyer, and have a couple of kids, and here I was bringing a Polish guy, 11 years older than me, home.When I found out I was pregnant it came down to a choice between my mother or my husband. So we eloped and got married, and last week on September 21 we celebrated our 20th anniversary with our two sons, now 19 and 18.It's not for everyone, and there were raised eyebrows among the people at work, even more raised eyebrows in Hubby's family--who told him bluntly that I was only marrying him to get my citizenship (hint, it doesn't work that way anymore).We've had ups and downs just like any other couple, there have been quite a few arguments, slammed doors, and some things that we just never will see eye to eye on due to age differences, but I can't imagine life without him, and before my mother passed away earlier this year she had made peace with my choice.I'm not saying that a relationship between age gaps will work or won't work, but the feelings of the persons involved should be the only things that matter. Maturity, however should be taken into consideration -- all the people my age  seemed so juvenile. My hubby was actually the first person I was ever able to have a serious conversation with about string theory beside my Dad.",
                    "commentAuthor": "u/Individual_Town8124",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Met my ex husband when I was barely 21 and he was 29. Married for 24 years, most of them miserable for me. I guess the simple reason is that I grew up and changed, and he was already grown and stayed the same. We've since both moved on to much more compatible partners, but he still says, \"I never should have married someone so young!\"\n",
            "commentAuthor": "u/",
            "commentReplies": [
                {
                    "commentText": "24 years! Damn! What kept you from leaving if you were miserable?",
                    "commentAuthor": "u/aurelieus",
                    "commentReplies": []
                },
                {
                    "commentText": "Three sons. We weren't the screaming/fighting type and actually parented well together, so I stayed until the youngest graduated and left for college.",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "I feel like this is my wife and I. Been married 10 years. Great parents but don’t really do much else together. When they’re both off to college we’ll probably call it quits.",
                    "commentAuthor": "u/letstrythisagain5",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "How can a 30yo and a 19yo be at the same point in their life?\n",
            "commentAuthor": "u/beeds",
            "commentReplies": [
                {
                    "commentText": "Well you could be like me and be a 30 year old in college because you grew up in a trailer park in Mississippi and it took years of working and saving to be able to even live near a university, much less attend.",
                    "commentAuthor": "u/VegaSpec",
                    "commentReplies": []
                },
                {
                    "commentText": "There’s a lot more to one’s stage in life than just being in the same institution. I’m sure you’ve already noticed that your life priorities are a bit different from your fellow undergrads who are just out of high school.",
                    "commentAuthor": "u/HutSutRawlson",
                    "commentReplies": []
                },
                {
                    "commentText": "Not saying you aren`t right, but WTF is with people placing their cultures and situations on others, lol.There are 20 y/o out there who already want to marry, have stable jobs and assemble a family, same way there are 30+ people who don`t care for that and want to live the single life and enjoy it.Neither side is wrong as long as they can sustain that lifestyle themselves.With the way, the economy is going this just gets clearer.ust because some(I would say most, lately) don`t follow the traditional view of marrying and having kids in their 30s doesn`t mean they are abnormal, lol.With the way the economy is going this just gets clearer.I think the powergap is much more important than age differences, you can have people with a 10 year age gap that have very similar goals and mindsets.Honestly, it`s just weird reading people saying how people in their 20s think like, or in their 30s or 40s, especially in this day and age.IMHO, as long they are of legal age and no financial power gap shenanigans are occurring, to each their own, let people be happy the way they want to, otherwise your arguments turn into similar to the ones from people that are against gay marriage or gay couples adopting children.",
                    "commentAuthor": "u/Kellar21",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "The younger person should be wary of the kind of person who is in their 30s and is pursuing someone who is still in their teens. Why do they not want someone who is closer to their own age? Is there something that they do that someone who is a bit older would recognize as being a red flag?\n\nI have always been a fan of the old rule \"half your age plus 7\", anything outside of that is a bit weird to me.\n\nThat being said, I am being a bit hypocritical here, I dated a 32yo woman when I was only 19, and the reason why I mentioned the above red flags to watch out for is because I missed a lot of them during that relationship.\n",
            "commentAuthor": "u/Lau_wings",
            "commentReplies": [
                {
                    "commentText": "This. I'm 29 and I can't imagine dating someone who is just starting college. And I certainly don't meet anyone in that age range now. If someone is searching for that age, that is already a lot of red flags that are being presented. I'd definitely be on the lookout for abusive dynamics.",
                    "commentAuthor": "u/TZscribble",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "So when I was 15 I started dating a 25 year old. I thought I was cool AF. I had a terrible mom who thought it was totally fine. She loved him. Wanted me to marry him. I eventually broke up with him for whatever childish teenage reason.\n\nI’m 37 now. I have two kids (17 & 19). I 100% would try very hard to not let it happen. I know now why that guy wanted to date me. He manipulated me. Controlled me. Controlled how I dressed. Verbally and emotionally abused me. Etc. no one his age put up with it. I was a vulnerable kid who was used to abuse at home and he took advantage of that. Huge age gaps like that with barely adult children are for one thing only. Control.\n",
            "commentAuthor": "u/nay2829",
            "commentReplies": [
                {
                    "commentText": "You were victim to a predator, not an equal in a mutually respectful relationship. I don’t know how it’s affected you until today but don’t blame yourself for being manipulated by adults who should have known better and protected you.",
                    "commentAuthor": "u/buon_natale",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "I was 18, graduated three months prior and started seeing a man who was 28. I regret every moment of it. I thought it was super cool, I thought I was mature and ready for it. Early on he stealthed me and gave me an STD, I stayed with him because I was young and stupid. He manipulated me, abused me, to the point I was so depressed I lost almost 30 lbs in six weeks and had to drop out of college. My mom was also terrible, she was an addict most of my childhood and my parents didn't have the sense to try to stop me from seeing him. 100% with you - I was a fun little hobby to him, and he took advantage of that. While it is perfectly legal, four years later I understand I was NOWHERE near as mature as I thought I was, and would never recommend that experience to anyone.",
                    "commentAuthor": "u/clemonade17",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My first boyfriend was 32.  I was 19.  We were “together” for 3 years.  He fucked me up.  He did the “we’re close, but I don’t want a commitment.” And I was like “OK!”  He must really like me since he’s so much older and wiser.  This is what adults do.  They don’t commit to each other and everyone just always keep their options open.  Plus I was so young and he told me that I wasn’t ready to settle down.  He said I was really smart for my age.  All of his other girlfriends always went psycho and it was so nice that I was so young and wise and understands things that other girls don’t.  And he said he’d pay for my belly button piercing when I lost the weight.  So generous.  And I was a virgin and he said he always wanted to be someone’s first.  Such a fucking creep.\n",
            "commentAuthor": "u/JamalPancakes",
            "commentReplies": [
                {
                    "commentText": "I relate to so much of this. \"You're so smart and mature! You're gorgeous!\" Etc. I had just graduated high school, he asked me to move in with him but wasn't ready to \"commit\" to dating me. I walked in on him fucking his ex in the bed he and I shared and all he had to say was \"I told you we weren't dating.\" A lot of people will blame me, I blame myself sometimes. I was young and stupid. Casual sex might be a fun short term thing with that kind of age gap, but anything more is manipulative and predatory 9/10 times",
                    "commentAuthor": "u/clemonade17",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "You've just articulated something I've never been able to articulate before. That feeling of \"oh but I'm special. He likes me and not anyone else, so I'm happy to do what he wants because if I don't then I won't be special anymore\"Except I wasn't 19. I was 15, and he was 28. And he fucked me up. And I'm so God damn angry about that. Almost 15 years later and I'm still having to rage at the fact that there was no justice for me. Thank you for finding the words that I couldn't for so long.",
                    "commentAuthor": "u/briochefaces",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Define dating. Going on a date or two, casual consensual fun? Sure. Go for it, make sure both of you enjoy the heck out of it.\n\nAttempt at a long term relationship? Iffy. Very iffy. Possible it works out but unlikely.\n\nFirst challenge. Both parties have to come to terms that the other will age. The older person likely is into young people (whether it’s their looks, energy, or something or other) which can shake up to end up anywhere from “my [insert attractive young quality] stays like this for a long time” to “ch-ch-ch-changes.” The older person has to be willing to make sacrifices to not rob someone of their youth. The younger person has to learn to accept the older person will likely die first and may have to make sacrifices to make the relationship work. They also have to be emotionally mature and shit.\n\nSecond challenge. You will be judged. Fairly or unfairly. Friends and family will judge for a decade or so. Strangers will judge for as long as the age difference looks jarring. You gotta both be able to deal with it.\n\nThird challenge. Aligning the goals. Sometimes it works out that both people have similar short and long term goals. I’d bargain that’s pretty rare. If you don’t fulfill yourself in life, you can’t fulfill a partner and you will resent them eventually. You will also stunt your emotional growth.\n\nFourth challenge. Respect. You’re at different stages in life. The experience imbalance is real. Getting snarky, disrespectful or whatever about someone else’s perspective is not love, it’s a power trip, condescension, and supreme lack of empathy. Don’t be that person.\n",
            "commentAuthor": "u/Free_Dimension1459",
            "commentReplies": [
                {
                    "commentText": "Probably the best answer on this post.",
                    "commentAuthor": "u/Archangel_ARCA",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Personally I think it’s weird. A 19 year old is basically fresh outta highschool, barely an adult mentally. A 30 year old is a full grown adult who is way older mentally and physically.\n\nEdit: some of the comments seem to thing the 19 year old is the woman. That’s not how it works, its just a 19 year old, gender does not matter here. It could be a 19 year old guy and a 30 year old girl, vise versa, or anything. That shouldn’t change anything\n",
            "commentAuthor": "u/Shadowfire786",
            "commentReplies": [
                {
                    "commentText": "“Fresh out of highschool” is the appeal for a 30 year old man with a 19 year old girl.",
                    "commentAuthor": "u/QandeelH",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Hey nineteen\n\nThat's 'Retha Franklin\n\nShe don't remember the Queen of Soul\n\nIt's hard times befallen\n\nThe sole survivors\n\nShe thinks I'm crazy\n\nBut I'm just growing old\n\nHey nineteen\n\nNo we got nothing in common\n\nNo we can't talk at all\n\n— Steely Dan\n",
            "commentAuthor": "u/wallyballou55",
            "commentReplies": [
                {
                    "commentText": "love the dan, and their songs have become more relatable. too relatable.a few years ago I asked out a woman from my gym. she didn't so much as glance at the wine menu at the restaurant, didn't think too much of it because she drove. we eventually got into the stories of our lives up until that point, then it dawned on me that she was fairly young. I asked her age outright, and she told me she was about to turn 20. I was 33 or 34 at the time. no wonder she didn't look at the wine menu -- she can't order any. a holy shit moment. I was beyond shocked, and I think she was too since I look young for my age. did not go out with her again.",
                    "commentAuthor": "u/black-kramer",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "The Cuervo gold",
                    "commentAuthor": "u/Johnwickwascool",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "\"Why is a grown ass man interested in dating a teenager?\"\n\nUsually when one of the parties is significantly younger than the other (especially teens or very early 20's) there is a big risk of exploitation. Lots of manipulation and power play can happen.\n\nThe very young person usually doesn't know how to handle romantic or sexual relationships as well as somebody much older than them, hence it's easy to take advantage of them.\n\nEdit: here comes the whataboutisms. \"What about women that do it?\", \"What about teenagers who exploit adults?\"\n\nYou all know damn well those are the minority of cases. Nobody is saying the opposite doesn't happen, but it definitely isn't as common.\n",
            "commentAuthor": "u/Coolio86",
            "commentReplies": [
                {
                    "commentText": "Even financially it is bound to be a mess. Someone with not even enough age to finish a degree is not as able to step away later. If you move in with them, the older person is likely the homeowner and the person with more capital, at least the first years. This makes breaking up a harder desicion for the younger one, and a way of the older to threaten.",
                    "commentAuthor": "u/Rtheguy",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "When we were 18, my ex left me for a 36 year old. There's definitely a point where you have to stop saying \"age is just a number\" and you must realize that both people are fucked in the head in their own way\n",
            "commentAuthor": "u/LordOfWubs",
            "commentReplies": [
                {
                    "commentText": "\"Age is just a number\" until you stop to think about how your brain doesn't even stop growing until you're about 25. People in their 30s have half a decade of that under their belts; people in their teens have none.",
                    "commentAuthor": "u/obviousbean",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I'm a 30 year old.\n\nAnd I wouldn't trust another 30 year old who would WANT to date a 19 year old because it is doubtful there are good motives. I'm sure there is some variation from person to person. But in general, I think back to when I was 19, and all the people who were around me when I was 19, and the thought of a romantic relationship with them at this point in my life makes me want to pull my hair out. \n\nNo beef to 19 year olds just in general expect when you get older to look back and refer to your 20s the exact same as you refer to your teens now.\n",
            "commentAuthor": "u/kpsdarlin",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Gosh I had a really old man hit on me today. He looked older than my father in law. I mean it's 30 and 19 is only 11 year ago buuut 19 is just too young. 30 seems to be an age where you settle down and start looking into marriage. Depends on the personal priorities I suppose. If they have same views, get along etc. Not being manipulated is the main thing.\n",
            "commentAuthor": "u/__Wasabi__",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I disapprove. There is almost always going to be a power imbalance with an age difference that big, especially with a teenager involved.\n",
            "commentAuthor": "u/talibob",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "18 is a minimum not a goal\n",
            "commentAuthor": "u/Alexpander4",
            "commentReplies": [
                {
                    "commentText": "I've never heard this expression, but I'll definitely be stealing it later",
                    "commentAuthor": "u/Rin-Tohsaka-is-hot",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I met my wife when I was 20 and her at 38. Been married now for 15 years and still going strong. We have similar outlooks on life, we get along brilliantly and never argue. Happiest I've ever been and wouldn't change a thing. It works for some, age isn't everything. The only downside is she gets to retire before I do, but having a job I love doesn't make that much of an issue.\n",
            "commentAuthor": "u/TheDraggo",
            "commentReplies": [
                {
                    "commentText": "We are in a similar situation except I was 30 when we met and he was 50. We have now bought a house, had a child and are planning to marry. People always judge a large age gap and I am under no illusion that he may die long before me and he will definitely retire much earlier. That being said we are very happy, on the same page and mentally the same age, I am 100% sure of my decision and I will love him unconditionally until the end. He’s also a great daddy to our little girl :) Our situation is different because I was not 19 when we met, I was a different person at 19 for sure. I’m so glad it all worked out for you :)",
                    "commentAuthor": "u/Cowie8591",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "Even if it doesn't work out - The older person should leave the younger person in a better place or mindset than before they got together. I dated someone 15 years older than me, and we broke up without any animosity or making eachother feel bad about anything. We are still friends too. Honestly, he helped me set a higher bar or standards as to how I want to feel and be treated by my partner. He really is a great guy, but we are in different places in our lives so it wouldn't be compatible long term.\n",
            "commentAuthor": "u/Moonwomb",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I think the relationship would be fine if it was like 25 - 36, but not 19 to 30\n",
            "commentAuthor": "u/Mermaid89253",
            "commentReplies": [
                {
                    "commentText": "Half your age plus seven rule in full display.36/2 + 7 = 25.",
                    "commentAuthor": "u/LegendaryWanderer",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "My hubby and I are 15 years apart. If I'd met him a few years earlier than I did I don't think I would have appreciated the things that I eventually found very attractive about him. Not to say it couldn't have worked out but life experience definitely makes you pick your battles with more discernment. Which makes for a better and more mature relationship IMO.\n",
            "commentAuthor": "u/blonderazor",
            "commentReplies": [
                {
                    "commentText": "That’s like my dad and stepmom. They’ve been together 15 years and they are 12 years apart. She was 48 and my dad was 60 when they met. It’s just different from 30 and 19.",
                    "commentAuthor": "u/Miqotegirl",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "I’m 31 and a 19 year old just seems like a child to me.\n",
            "commentAuthor": "u/Burritobabyy",
            "commentReplies": [
                {
                    "commentText": "This. I’m 33. At 19 I would totally have dated a 30 year old, but now I’ve seen what 30 looks like from the inside, there’s zero chance I’d be interested in someone that young, honestly, they would annoy the shit out of me. 19 is such a huge age for personal development and risk taking, you’ve got minimum responsibility and maximum potential. At 19 I was drinking booze every weekend, travelling and sleeping in my car, wearing weird outfits, almost always broke, just did whatever came to mind at the time - it was awesome! At 33 I’m a mum with a structured routine, healthy lifestyle, strict budget and a cupboard full of very appropriate mum-clothes. I would be wary of the motives of a 30 year old who dates a 19 year old.",
                    "commentAuthor": "u/yeet_and_defeat",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                },
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        },
        {
            "commentText": "When I was 30, I dated a woman who was 39. I still had a college-kid type of apartment and she had an adult apartment. I still couldn't figure out what I wanted in life (two years of military and lots of grad school) and she was finishing up a doctorate to get a real job. At the time, I just felt too immature for her, so it never went anywhere.\nNow she's 76 and I'm 67, and about every day I regret that I let her go.\n",
            "commentAuthor": "u/BerthaBenz",
            "commentReplies": [
                {
                    "commentText": "",
                    "commentAuthor": "u/",
                    "commentReplies": []
                }
            ]
        }
    ]
}